
{
    "races": ["human", "elf", "dwarf", "halfling", "gnome", "half_orc", "dragonborn", "tiefling"],
    "jobs": [
        "Scribe",
        "Blacksmith",
        "Alchemist",
        "Guard",
        "Merchant",
        "Herbalist",
        "Innkeeper",
        "Bard",
        "Bounty Hunter",
        "Miner",
        "Farmer",
        "Tailor",
        "Thief",
        "Healer",
        "Wizard's Apprentice",
        "Rat Catcher",
        "Librarian",
        "Grave Digger",
        "Sailor",
        "Noble",
        "Chieftain",
        "Shaman",
        "Cartographer",
        "Shipwright",
        "Priest",
        "Hunter",
        "Fisher",
        "Scout",
        "Tinker",
        "Smuggler",
        "Druid",
        "Monk",
        "Gladiator",
        "Sailmaker",
        "Stablemaster",
        "Chandler",
        "Glassblower",
        "Carpenter",
        "Mason",
        "Weaver"
      ],
    "personalities": ["Gruff", "Cheerful", "Suspicious", "Kind", "Arrogant", "Shy", "Cynical", "Optimistic", "World-weary", "Naive", "Ambitious", "Lazy", "Honest", "Deceitful", "Brave", "Cowardly", "Meticulous"],
    "quirks": [
        "Taps fingers incessantly",
        "Speaks in rhymes",
        "Has a nervous twitch",
        "Collects shiny objects",
        "Never makes eye contact",
        "Refers to self in third person",
        "Has an unusual pet",
        "Always smells of cinnamon",
        "Mispronounces common words",
        "Finishes other people's sentences",
        "Has a phobia of chickens",
        "Hums constantly",
        "Is a terrible liar but does it often",
        "Overly formal speech",
        "Carries a tattered book everywhere",
        "Refuses to eat green food",
        "Has an imaginary friend",
        "Always polishes their boots when nervous",
        "Collects teeth",
        "Corrects others' grammar mid-sentence"
      ],
    "voices": [
        "Deep and gravelly",
        "High-pitched and squeaky",
        "Slow and deliberate",
        "Fast and excitable",
        "Soft and whispery",
        "Loud and booming",
        "Monotonous and flat",
        "Smooth and melodic",
        "Hoarse and raspy",
        "Has a noticeable lisp",
        "Stutters when nervous",
        "Has a foreign accent",
        "Nasal and whiny",
        "Calm and soothing",
        "Sings their words occasionally",
        "Clipped, military cadence",
        "Breathy and airy",
        "Wavering, elderly tremor",
        "Thick regional brogue",
        "Hushed, conspiratorial tone"
      ],
    "mannerisms": [
        "Paces while talking",
        "Constantly adjusts their clothing",
        "Gesticulates wildly",
        "Strokes their chin thoughtfully",
        "Avoids sitting still",
        "Fiddles with a coin",
        "Cracks their knuckles",
        "Rubs their hands together",
        "Bites their lip",
        "Raises one eyebrow frequently",
        "Leans in too close when speaking",
        "Scratches their neck when thinking",
        "Always stands perfectly straight",
        "Leans against walls",
        "Tugs on their ear when thinking",
        "Winks at inappropriate times",
        "Drums fingers on nearby surfaces",
        "Counts under their breath",
        "Keeps hands clasped behind their back",
        "Constantly scans for exits"
      ],
    "secrets": [
        "Is secretly a member of a revolutionary group in {place}.",
        "Owes a massive debt to a dangerous criminal.",
        "Is an imposter who stole their current identity.",
        "Has a hidden stash of treasure buried near {place}.",
        "Is responsible for a crime everyone has forgotten.",
        "Knows the location of a rare magical artifact in {place}.",
        "Is secretly in love with someone they shouldn't be.",
        "Is an informant for the local guard... or a rival faction.",
        "Has a cursed item they can't get rid of.",
        "Believes {place} is doomed and is preparing to flee.",
        "Once belonged to a noble family but was disowned.",
        "Has a child they've never met.",
        "Is slowly being poisoned and doesn't know by whom.",
        "Is a werewolf/vampire/other creature.",
        "Is secretly royalty in hiding.",
        "Faked their own death once.",
        "Is a spy for a foreign power.",
        "Is wanted under a different name in {place}.",
        "Is bound by a magical geas tied to {place}.",
        "Has prophetic dreams that keep coming true about {place}."
      ],
    "globalHooks": [
        "I've lost a precious family heirloom in {place}, can you find it?",
        "Someone has been threatening me, I need protection.",
        "I need a rare ingredient that only grows in the dangerous parts of {place}.",
        "I saw something strange in {place} last night, and no one believes me.",
        "I need a message delivered, but I can't trust the usual couriers.",
        "I'm looking for a rare book, said to be in a local ruin.",
        "My rival has challenged me to a duel, and I need a second.",
        "I've been framed for a crime I didn't commit.",
        "Children have gone missing near {place}; help me search the old tunnels.",
        "A plague of nightmares afflicts {place}; someone is causing it.",
        "A relic from my family was seized by the magistrate; retrieve it quietly.",
        "Bandits demand tribute outside {place}; I need escorts and leverage.",
        "A creature stalks the roads after dusk; I saw its lair near {place}.",
        "Someone fouled the town well in {place}; find the saboteur.",
        "A traveling troupe vanished after performing in {place}; I found a clue.",
        "A map points to ruins beneath {place}; I need a brave team.",
        "My apprentice joined a dangerous cult; bring them back alive.",
        "Strange lights rise from the marsh near {place}; investigate.",
        "A noble plans to seize my land with forged deeds; help me prove it.",
        "A courier with a vital letter to {place} is overdue; track them."
      ],
    "globalGoals": [
        "To earn enough money to retire comfortably.",
        "To find a lost family member.",
        "To protect {place} from a looming threat.",
        "To achieve recognition for their craft.",
        "To escape their past and start a new life.",
        "To atone for a past sin.",
        "To see the world and all its wonders.",
        "To build something that will last forever.",
        "To reclaim their family's honor.",
        "To master a forbidden school of magic.",
        "To repay a life-debt owed long ago.",
        "To found a guild in {place}.",
        "To protect a secret that would ruin them.",
        "To break a powerful curse over their bloodline.",
        "To chart an unexplored region beyond {place}.",
        "To unite feuding clans.",
        "To avenge a slain mentor.",
        "To become the greatest in their field.",
        "To uncover the truth behind a prophecy.",
        "To save someone who doesn't want to be saved."
      ],
    "globalOffers": [
        "I can offer a modest reward for your help.",
        "I know a secret about {place} that could be useful to you.",
        "I can provide you with a safe place to rest.",
        "I have connections with influential people in {place}.",
        "I can craft a custom item for you if you help me.",
        "I can teach you a unique skill.",
        "I have a map that leads to a hidden location.",
        "My family is influential and can help you.",
        "I can grant you legal papers and permits in {place}.",
        "I can introduce you to a discreet fence.",
        "I can smuggle you past the city gates after curfew.",
        "I can arrange an audience with a minor noble.",
        "I can lend you a trained animal companion for a short time.",
        "I can supply potions and remedies at cost.",
        "I can share a safehouse key used by my network.",
        "I can bless your gear for a day with a minor boon.",
        "I can give you a letter of credit redeemable in {place}.",
        "I can teach you local hand-signs used by {place}'s underbelly.",
        "I can provide disguises and basic forgery.",
        "I can call in a favor from the temple."
      ],
    "jobFlavor": {
        "Scribe": {
            "hooks": [
              "A rare manuscript was stolen from my shop in {place}!",
              "I've intercepted a coded message I can't decipher.",
              "I need someone to retrieve a rare ink from a dangerous location in {place}.",
              "A censor in {place} ordered me to burn 'heretical' texts—help me hide them.",
              "A courier vanished with a sealed ledger bound for {place}.",
              "Water flooded the archives beneath {place}; help me salvage the records.",
              "An ancient palimpsest shows ghost writing—can you protect me while I study it?",
              "Someone is blackmailing me to alter legal records in {place}.",
              "A rival scribe claims I forged a noble’s charter; clear my name.",
              "A forbidden play is inciting riots in {place}; I need the original script.",
              "A quill I bought writes on its own at night—please investigate.",
              "A marginal note in a sermon hints at a treasure near {place}.",
              "The guild demands I produce a false confession—help me resist.",
              "An illuminated initial hides a map; I need guards to the site.",
              "A patron wants a book stolen back from a collector in {place}.",
              "I found records proving a lineage is forged—now I'm hunted.",
              "A scriptorium apprentice is missing; their notes point to catacombs.",
              "Arsonists plan to torch my copying house tonight in {place}.",
              "I need witnesses escorted to testify that records were altered.",
              "A sealed codex is locked with a word I dare not speak—come with me."
            ],
            "goals": [
              "To write a definitive history of {place}.",
              "To uncover a lost piece of knowledge.",
              "To create a perfect, illuminated manuscript.",
              "To prove a noble lineage in {place} was forged.",
              "To translate an ancient draconic chronicle.",
              "To found an independent scriptorium in {place}.",
              "To recover a lost writing system from ruins near {place}.",
              "To index every deed and title stored under the magistrate's hall.",
              "To compile an unbiased chronicle of the current war.",
              "To preserve banned works before they are destroyed.",
              "To win lifelong patronage from a great house.",
              "To devise an unbreakable cipher.",
              "To document oral histories of {place} before elders pass on.",
              "To catalog magical glyphs and their mundane analogues.",
              "To create a universal shorthand used across guilds.",
              "To become royal archivist of {place}.",
              "To finish a truthful memoir that endangers the powerful.",
              "To expose corruption hidden in tax rolls.",
              "To authenticate a legendary traveler's journal.",
              "To map the entire genealogy of three feuding clans."
            ],
            "offers": [
              "I can forge documents for you.",
              "I have access to maps and records of {place}.",
              "I can teach you a rare language.",
              "I can secure after-hours access to restricted stacks.",
              "I can copy spell formulae neatly (results not guaranteed).",
              "I can notarize charters and letters for passage in {place}.",
              "I can provide coded messages and a matching cipher key.",
              "I can hide items inside hollowed book bindings.",
              "I can introduce you to discreet archivists and clerks.",
              "I can prepare decoy papers for false identities.",
              "I can translate most scripts used around {place}.",
              "I can annotate your maps with safe routes and waypoints.",
              "I can draft wills and contracts that stand up in court.",
              "I can arrange library passes for a few days.",
              "I can keep a sealed deposit in the archive vault.",
              "I can circulate rumors through scribal networks.",
              "I can repair water- or smoke-damaged parchments you find.",
              "I can mark secret messages with invisible inks.",
              "I can authenticate or denounce forged pedigrees.",
              "I can teach you simple hand-signs used by messengers."
            ]
          },
        "Blacksmith": {
            "hooks": [
              "My finest hammer was stolen by goblins!",
              "A competitor in {place} is sabotaging my forge.",
              "I need a rare ore from the mountains near {place}.",
              "Something haunts my forge at night; tools move on their own.",
              "A meteorite fell near {place}; I need an escort to harvest the metal.",
              "The armorer's guild is muscling me out—help me gather proof.",
              "Bandits stole a wagon of charcoal I desperately need.",
              "The quenching well is cursed; anything dipped shatters.",
              "I must deliver a rack of swords to {place}; road's too dangerous alone.",
              "My anvil washed away in a flood—help me salvage it from the river.",
              "I want to test an experimental alloy in monster scales.",
              "The castle portcullis jammed; come help me repair it under fire.",
              "A fire elemental slipped into my furnace—contain it.",
              "Guards are extorting 'inspection fees'; catch them in the act.",
              "A rival claims I stole their design; the proof is in distant records.",
              "Gremlins keep stealing my tongs—find their nest.",
              "A giant commissioned armor; I need materials and time.",
              "Miners are striking; I need negotiators or another vein.",
              "The bell for {place}'s temple cracked; fetch special ore for recasting.",
              "Strange runes appeared on my anvil—someone cursed my shop."
            ],
            "goals": [
              "To forge a legendary weapon.",
              "To become the most renowned blacksmith in the land.",
              "To earn enough to buy their own mine.",
              "To uncover the secret to superior steelmaking.",
              "To craft an unbreakable chain that proves my skill.",
              "To arm a militia to defend {place}.",
              "To present a masterwork to the monarch.",
              "To see my apprentice pass the guild trials.",
              "To open a second forge in {place}.",
              "To build a portable field-forge for caravans.",
              "To perfect lightweight armor that saves lives.",
              "To restore honor to my family name.",
              "To forge a peace-gift that ends a feud.",
              "To master runesmithing without losing myself.",
              "To supply ships from a new harbor near {place}.",
              "To craft tools that advance every trade in {place}.",
              "To develop spark-less picks for explosive mines.",
              "To create a bell whose tone wards evil.",
              "To retire with a guild charter free of debt.",
              "To pass my secrets to a worthy successor."
            ],
            "offers": [
              "I can repair your weapons and armor at a discount.",
              "I can craft masterwork gear for you.",
              "I know the weaknesses of different types of armor.",
              "I can loan you tools or spikes for tough jobs.",
              "I can introduce you to a mercenary captain who owes me.",
              "I can heat-treat your blades properly before a big fight.",
              "I can stamp your gear with a respected maker’s mark.",
              "I can store valuables in my locked coal bunker.",
              "I can commission you as escorts for well-paid deliveries.",
              "I can sell you materials at near cost when available.",
              "I can recommend you to the guild quartermaster in {place}.",
              "I can arrange a meeting with a famed dwarven smith.",
              "I can modify armor for stealth or mobility.",
              "I can fit you with custom grips and counterweights.",
              "I can smelt scrap you bring into useful billets.",
              "I can help disguise contraband in harmless ironwork.",
              "I can supply caltrops, pitons, and climbing irons quickly.",
              "I can test mystery metals and tell you their quality.",
              "I can set up a mobile forge to support your expedition.",
              "I can provide a strongbox with a stout hasp and lock."
            ]
          },
        "Alchemist": {
            "hooks": [
              "My laboratory in {place} exploded... again. I need help cleaning up.",
              "I need a very rare plant for a potion of longevity.",
              "A rival alchemist stole my formula for a powerful potion.",
              "A homunculus escaped into the sewers of {place}; capture it alive.",
              "A shipment of glassware shattered mysteriously—sabotage is likely.",
              "An apprentice drank an unfinished draught; the symptoms are... unusual.",
              "A fire elemental is trapped in my alembic; help me release it safely.",
              "A noble demands an impossible love philter by dawn.",
              "The guild forbids my research; I need off-books ingredients.",
              "A plague of sleepwalking began near my shop; investigate whether I caused it.",
              "I need venom from a specific beast lairing outside {place}.",
              "Bandits stole my portable lab; track them before they sell it.",
              "The well near {place} is tainted with alchemical waste; fix it discreetly.",
              "A rival is selling fake cures with my seal; expose them.",
              "A cursed mortar whispers secrets; escort it to the old ruins.",
              "A distillation run won't stop; the pressure will burst the tower.",
              "A rare comet passes tonight; we must collect its dew.",
              "Someone plans to kidnap me for my recipes; guard me during the parley.",
              "The city banned fireworks; I need a secret test site.",
              "A bound imp that powers my furnace broke its pact; rebind it."
            ],
            "goals": [
              "To create the Philosopher's Stone.",
              "To cure a plague sweeping through {place}.",
              "To discover a potion with a completely new effect.",
              "To perfect a universal solvent that doesn't dissolve its container.",
              "To transmute base metals to gold reliably (and ethically).",
              "To publish a grimoire that makes alchemy safer for apprentices.",
              "To brew an elixir that restores any memory.",
              "To stabilize explosive reagents for safe transport.",
              "To replace costly reagents with common alternatives.",
              "To develop smokeless fuels for {place}'s forges.",
              "To craft a healing draught with no side effects.",
              "To neutralize a dangerous narcotic troubling {place}.",
              "To map how ley lines affect distillation.",
              "To create a homunculus that chooses its own destiny.",
              "To open a public laboratory school in {place}.",
              "To bottle a storm's lightning.",
              "To prove alchemy is science, not superstition.",
              "To revive an extinct plant needed for ancient recipes.",
              "To perfect long-term stasis for perishables.",
              "To invent a self-cleaning, self-heating cauldron."
            ],
            "offers": [
              "I can brew any standard potion for you.",
              "I can identify magical substances.",
              "I'll sell you experimental (and unstable) potions cheaply.",
              "I can supply antitoxins and basic healing salves at cost.",
              "I can neutralize poisons if you bring a sample.",
              "I can provide smoke bombs, flash vials, and stink pots.",
              "I can craft oils that harden armor briefly.",
              "I can waterproof gear with alchemical wax.",
              "I can test liquids for contaminants in {place}.",
              "I can inscribe heat-runes to keep you warm for a night.",
              "I can prepare climbing adhesive removable with a solvent.",
              "I can create long-burning lantern fuel.",
              "I can issue discreet guild chits for purchases in {place}.",
              "I can coat weapons for special resistances (temporary).",
              "I can fireproof your packs and cloaks.",
              "I can conceal items in reagent crates that pass inspection.",
              "I can teach field first aid using alchemical kits.",
              "I can brew truth-inducing incense for interviews.",
              "I can provide sealed vials safe for volatile samples.",
              "I can analyze monster parts and tell you profitable uses."
            ]
          },
        "Guard": {
            "hooks": [
              "I think my captain is corrupt, but I need proof.",
              "Smugglers are using a secret route into {place}.",
              "I'm supposed to be on patrol, but I need someone to check on my family.",
              "A serial burglar leaves chalk sigils; decode them and set a stakeout.",
              "A prisoner due for execution claims innocence; investigate before sunrise.",
              "Contraband floods the docks of {place}; help raid a warehouse.",
              "A masked vigilante embarrasses the watch; catch or recruit them.",
              "A gang war is brewing; broker a truce before festival day.",
              "A noble's gala needs undercover security; blend in and listen.",
              "Patrol routes leaked; find the mole within the guard.",
              "Something stalks the night watch; help set a trap.",
              "We found a severed hand clutching a key; find the door.",
              "Witnesses keep dying; guard the last one to court.",
              "A caravan with tax revenue vanished outside {place}.",
              "The jailer fell ill; assist transporting dangerous prisoners.",
              "A riot may erupt at tomorrow's speech; plan the crowd control.",
              "A missing patrol's trail leads into the catacombs.",
              "A blackmail ring targets officers' families—including mine.",
              "A banned cult recruits openly in {place}; gather evidence.",
              "A diplomat arrives under threat; ensure safe passage."
            ],
            "goals": [
              "To become the Captain of the Guard.",
              "To keep the people of {place} safe.",
              "To solve a major unsolved crime.",
              "To root out corruption within the watch.",
              "To modernize training and equipment in {place}.",
              "To earn enough to move my family to a safer quarter.",
              "To bring a notorious gang leader to justice.",
              "To unify city and harbor patrols under one command.",
              "To establish a volunteer watch for poor districts.",
              "To learn investigative methods from foreign cities.",
              "To end bribery at the gates.",
              "To secure a treaty by protecting foreign envoys.",
              "To rebuild trust between guards and citizens.",
              "To break the smuggling network's finances.",
              "To mentor a promising recruit into leadership.",
              "To expose the noble who shields criminals.",
              "To create a fair code of conduct for all.",
              "To retire honorably with a commendation.",
              "To solve the cold case that haunts me.",
              "To ensure {place}'s festivals happen without violence."
            ],
            "offers": [
              "I can get you out of minor legal trouble.",
              "I know the patrol schedules in {place}.",
              "I can look the other way... for a price.",
              "I can secure temporary carry permits for weapons in {place}.",
              "I can arrange a meeting with an honest magistrate.",
              "I can grant brief access to cordoned crime scenes.",
              "I can vouch for you at the gate to speed entry.",
              "I can provide official cloaks as disguises.",
              "I can place a quiet watch on a person or door.",
              "I can share recent incident reports and descriptions.",
              "I can loan manacles and lanterns for a night.",
              "I can introduce you to a trusted informant.",
              "I can escort you through restricted districts after curfew.",
              "I can keep found items in safekeeping at the watch house.",
              "I can issue a temporary bounty writ so you can make arrests.",
              "I can arrange for an alarm bell at your camp.",
              "I can get you a private audience with the captain.",
              "I can warn you before a sweep in {place}'s markets.",
              "I can quietly expunge minor citations from your record.",
              "I can deputize you for one day with limited authority."
            ]
          },
        "Merchant": {
            "hooks": [
              "A bandit crew has been raiding my caravans near {place}.",
              "I need an escort for a valuable shipment.",
              "A competitor is spreading vile rumors about my goods.",
              "Forged coins are flooding the market in {place}; help me test and trace them.",
              "Officials at the gate tripled my tariffs; I suspect extortion.",
              "My warehouse was broken into—only specific crates were taken.",
              "My caravan master went missing en route to {place}.",
              "Customs seized my shipment on a technicality; recover the paperwork I need.",
              "Pirates took a sloop carrying rare spices bound for {place}; salvage what you can.",
              "Dockworkers threaten to strike during the festival; protect my goods or mediate.",
              "Someone is counterfeiting my seal on inferior merchandise.",
              "An auction in {place} is rigged; I need proof before I bid.",
              "A secret buyer demands anonymity and odd delivery terms—vet them.",
              "The guild plans to revoke my license; uncover who is bribing the board.",
              "Mercenaries I hired are now shaking down my customers—deal with them.",
              "A cursed idol slipped into my cargo; I need it discreetly removed.",
              "I must deliver delicate glass to {place} without a single crack.",
              "A land dispute closed my usual route; obtain passage papers.",
              "My contact left a dead drop that never got picked up; find what went wrong.",
              "I found a smuggler’s path into {place}; decide whether to expose or leverage it."
            ],
            "goals": [
              "To establish a trade empire.",
              "To sell a one-of-a-kind item to a noble.",
              "To drive their rivals out of business.",
              "To open a new trade route through the mountains near {place}.",
              "To corner the market on a rare spice or dye.",
              "To gain a seat on the merchants’ guild council in {place}.",
              "To build a fleet and control river traffic.",
              "To rebuild after a devastating fire and return stronger.",
              "To earn an honest reputation that outlasts me.",
              "To create a chain of caravanserais between capitals.",
              "To secure a fair-trade charter recognized in {place}.",
              "To expand into magical reagents without angering alchemists.",
              "To supply armies ethically without profiting from suffering.",
              "To reduce predatory tariffs that crush small traders.",
              "To map a safe desert crossing with permanent markers.",
              "To invent letters of credit accepted across realms.",
              "To mentor an heir who improves on my legacy.",
              "To bring prosperity back to my neglected hometown.",
              "To unite feuding merchant houses under a common code.",
              "To retire to a counting house and write a ledger’s memoirs."
            ],
            "offers": [
              "I can give you a discount on my wares.",
              "I can get you rare and exotic goods from faraway lands.",
              "I hear all sorts of rumors from travelers.",
              "I can write letters of introduction to factors in {place}.",
              "I can extend a modest line of credit or vouchers.",
              "I can store a crate for you in my warehouse, no questions asked.",
              "I can secure passage with my next caravan or riverboat.",
              "I can arrange a quiet meeting with a customs clerk.",
              "I can tip you off before major auctions in {place}.",
              "I can provide legitimate invoices as cover for travel.",
              "I can connect you to a trustworthy moneychanger.",
              "I can supply trade maps showing tolls and choke points.",
              "I can disguise shipments with decoy labels and crates.",
              "I can introduce you to a jewel appraiser I trust.",
              "I can hire you as guards to grant you gate priority.",
              "I can post bonds on your behalf for certain dealings.",
              "I can find buyers for odd monster parts you bring.",
              "I can sponsor permits to trade in restricted districts.",
              "I can outfit you quickly with sturdy travel gear at cost.",
              "I can discreetly courier messages along my trade routes."
            ]
          },
        "Herbalist": {
            "hooks": [
              "A rare moonpetal flower is blooming tonight in {place}, but the area is dangerous.",
              "My supply of herbs was poisoned.",
              "I need someone to gather ingredients from a cursed swamp.",
              "A dryad accuses me of overharvesting; help me make amends safely.",
              "A giant hive of medicinal bees must be relocated from {place}.",
              "A wandering mushroom ring is moving nightly; I need samples without angering it.",
              "Someone vandalized my garden with salt; find who and why.",
              "I need mandrake harvested at midnight—without fatal screaming.",
              "The clinic is overwhelmed; help me forage triage herbs near {place}.",
              "A cliffside herb only blooms at dawn—keep me safe while I climb.",
              "A merchant sells a toxic lookalike for my best remedy; expose them.",
              "An ancient tree bleeds curative resin guarded by spirits.",
              "Herb thieves are stripping the hills; catch them before the season is lost.",
              "Fey rabbits infest my beds; humane solutions preferred.",
              "A fungal blight threatens crops near {place}; identify a cure.",
              "I owe a debt to a swamp hag; help me settle it without more blood.",
              "A snow lotus blooms atop a perilous peak near {place}.",
              "Pollen storms are triggering fevers; I must gather filters fast.",
              "The spirit of spring is missing; my plants won’t wake.",
              "A massive boar guards the only patch of star-anise; distract or pacify it."
            ],
            "goals": [
              "To find a cure for a rare disease.",
              "To cultivate a garden of every known magical plant.",
              "To live a simple, peaceful life.",
              "To open a free clinic in {place} for the poor.",
              "To publish an illustrated field guide trusted by all.",
              "To discover a panacea—if it can be made responsibly.",
              "To halt an invasive blight before it ruins the forest.",
              "To breed hardier crops for hungry villages.",
              "To reconcile with the druid circle I left.",
              "To teach an apprentice who surpasses me.",
              "To build a seed bank beneath {place}.",
              "To heal my own lingering illness.",
              "To replace addictive pain tonics with safer herbs.",
              "To map the bloom calendar across the region.",
              "To craft a calming perfume that tames beasts.",
              "To codify sustainable harvesting laws in {place}.",
              "To rewild a dead meadow into a sanctuary.",
              "To convince the city to fund a public apothecary.",
              "To outfit a traveling herb-wagon for remote hamlets.",
              "To cultivate a plant that glows softly for safe night light."
            ],
            "offers": [
              "I can provide healing poultices and remedies.",
              "I can identify any plant or animal in {place}.",
              "I know which plants are safe to eat and which are deadly.",
              "I can brew mild antitoxins and fever tonics at cost.",
              "I can share forage maps and seasonal notes around {place}.",
              "I can guide you through woods without damaging the flora.",
              "I can supply insect-repellent salves for swamps and forests.",
              "I can mask your scent from common predators for a short time.",
              "I can prepare compresses that speed natural rest and recovery.",
              "I can blend calming incense for tense negotiations.",
              "I can provide seeds and cuttings for your camp gardens.",
              "I can mix a paste that camouflages scent and color in underbrush.",
              "I can warn you about poisonous lookalikes along your route.",
              "I can teach basic wilderness first aid and splinting.",
              "I can craft ointments that prevent rashes and nettle burn.",
              "I can point out emergency shelters and safe water sources.",
              "I can introduce you to rangers and druids near {place}.",
              "I can provide natural dyes for disguises and signals.",
              "I can trade tinctures for monster parts useful in remedies.",
              "I can leave coded herb-markers to guide you back to safety."
            ]
          },
        "Innkeeper": {
            "hooks": [
              "A rowdy group of mercenaries is causing trouble in my inn.",
              "My cellar is infested with giant rats.",
              "A ghostly presence in {place} is scaring away my customers.",
              "A city inspector demands bribes or he'll shut me down—help me get leverage.",
              "Someone spread a rumor of food poisoning; clear my kitchen's name.",
              "My best server vanished mid-shift; guests report whispers under the stairs.",
              "A caravan booked the hall, then skipped the bill; track them to {place}'s gate.",
              "I overbooked for the festival; I need mediators and extra beds fast.",
              "Thieves are casing guest rooms; set a trap with me tonight.",
              "I found a hidden passage in the cellar; it breathes cold air.",
              "A crate of rare wine for a noble was stolen from my lockup.",
              "Quarantine rules changed; help me shelter stranded travelers.",
              "A wanted criminal is hiding among my guests; identify them quietly.",
              "A brawl will erupt tonight after the tourney; keep the peace.",
              "A grease fire gutted my kitchen; salvage supplies before looters do.",
              "Pixies keep stealing room keys; catch them or bargain a truce.",
              "A noble demands I evict a troupe; I fear retaliation either way.",
              "My ledger was stolen; without it I can't pay staff or suppliers.",
              "The well-water tastes metallic; someone may be poisoning it.",
              "Floodwater seeps up into the cellar each dusk; find the source."
            ],
            "goals": [
              "To own the most popular inn in the region.",
              "To pay off the debt on their establishment.",
              "To hear a story from every corner of the world.",
              "To earn a royal charter as official hostelry of {place}.",
              "To expand into a second inn closer to the gates of {place}.",
              "To provide safe beds for travelers of all stations.",
              "To host an annual harvest festival that unites the town.",
              "To assemble a cellar of legendary vintages.",
              "To make the inn a neutral ground for rivals to parley.",
              "To publish a travelers’ guide based on guest tales.",
              "To build a proper stage and book the finest performers.",
              "To drive crime out of the alley behind the inn.",
              "To create a cooperative network of honest inns.",
              "To rebuild after the last fire stronger and safer.",
              "To train an heir who loves the work.",
              "To add public baths and a clean waterhouse.",
              "To fortify a storm cellar for the entire block.",
              "To be recognized by the hospitality guild with a lantern-star.",
              "To provide free meals nightly for the poor without going broke.",
              "To retire to a quiet coastal tavern once the place thrives."
            ],
            "offers": [
              "I can offer you free room and board.",
              "I overhear all the gossip and rumors in {place}.",
              "I can introduce you to interesting patrons.",
              "I can stash valuables in a locked strongbox under the bar.",
              "I can stable your mounts and see them fed.",
              "I can show you a discreet back door and alley route.",
              "I can ring a house-signal to rally help if you're attacked.",
              "I can provide hot meals and travel rations at cost.",
              "I can arrange a private booth for sensitive meetings.",
              "I can book you as 'staff' to bypass certain lines.",
              "I can wake you at any hour and keep watch on your room.",
              "I can send a runner with messages across {place}.",
              "I can outfit you with plain servant garb for disguises.",
              "I can hide you in the laundry cart if need be.",
              "I can keep parcels for you under a false name.",
              "I can call on the neighborhood watch to look the other way.",
              "I can lend lanterns, bedrolls, and basic tools.",
              "I can mark safe houses and friendly taverns on your map.",
              "I can recommend craftsmen who won't ask questions.",
              "I can arrange a carriage or boat quickly through my contacts."
            ]
          },
       "Bard": {
            "hooks": [
              "I've lost my lucky lute.",
              "A rival bard in {place} stole my best song.",
              "I need a dramatic tale of heroism to turn into an epic ballad.",
              "Officials revoked my performance permit; help me win it back.",
              "Hecklers are being paid to ruin my shows; find the patron.",
              "An ancient mural hides music notation; guard me while I copy it.",
              "A siren stole my voice for a night; retrieve the token that binds it.",
              "A patron wants me to spy at a masked ball; I need backup.",
              "The college of bards demands a dangerous initiation quest.",
              "My instrument is haunted by a previous owner; lay them to rest.",
              "A forbidden play draws the watch; smuggle the script to {place}.",
              "A traveling troupe vanished on the road; follow their trail.",
              "I composed a satire that angered a noble; save me from 'duel' invitations.",
              "A coded song points to a treasure; help perform it at the site.",
              "A rival challenges me to a public duel of verse; be my seconds.",
              "The festival's main stage was sabotaged; find the culprit fast.",
              "A theater owner refuses to pay; negotiate or apply pressure.",
              "Street toughs extort buskers near {place}; break their hold.",
              "A ghost demands a final audience before moving on.",
              "I promised a wedding hymn by dawn; gather the story of the couple."
            ],
            "goals": [
              "To write a song that will be sung for centuries.",
              "To win the affection of a noble.",
              "To uncover a story that was meant to stay hidden.",
              "To be admitted to the college of bards as a master.",
              "To collect every folk tune sung around {place}.",
              "To master every instrument I can carry.",
              "To break a curse that steals my voice on new moons.",
              "To compose a requiem worthy of a lost city.",
              "To found a traveling troupe that pays performers fairly.",
              "To broker a peace through music between feuding houses.",
              "To invent a notation others can learn easily.",
              "To open a public music school in {place}.",
              "To win the grand festival's laurel three years running.",
              "To make a living without bowing to cruel patrons.",
              "To memorialize common folk in epic verse.",
              "To bridge cultures by blending foreign scales and rhythms.",
              "To headline the royal wedding and be paid in perpetuity.",
              "To encode truths in songs that censors can't erase.",
              "To craft a lullaby that banishes nightmares.",
              "To earn the title 'Laureate of {place}'."
            ],
            "offers": [
              "I can compose a song about your great deeds.",
              "My performances can create a useful distraction.",
              "I can use my charm to get information for you.",
              "I can get you in through a performers’ entrance.",
              "I can teach you basic stagecraft and disguise.",
              "I can introduce you to patrons and nobles after shows.",
              "I can carry messages hidden as lyrics or poetry.",
              "I can spread (or smother) rumors across taverns and theaters.",
              "I can secure a spotlight moment to slip someone onstage.",
              "I can rehearse a 'scene' that covers your movements.",
              "I can arrange a private serenade to soften a target's mood.",
              "I can barter our services for rooms and meals.",
              "I can coach you to speak confidently in courts and halls.",
              "I can book you as road crew to cross guarded doors.",
              "I can teach call-and-response signals useful in crowds.",
              "I can lend a fine instrument for a formal audience.",
              "I can hype your arrival so doors open in {place}.",
              "I can pen flattering letters that secure introductions.",
              "I can assemble street performers as eyes and ears.",
              "I can host a public contest to draw out a rival."
            ]
          },
        "Bounty Hunter": {
            "hooks": [
              "I'm tracking a dangerous fugitive last seen in {place}.",
              "I need a partner for a particularly difficult bounty.",
              "My target has powerful friends protecting them.",
              "Bounty posters were forged; help identify the real quarry.",
              "An innocent bears the bounty's likeness; prove it before the noose.",
              "The target hides in the catacombs beneath {place}.",
              "I need a distraction at the border checkpoint to make the grab.",
              "We'll lure the mark by faking a deal with their favorite fence.",
              "The writ says 'alive' but someone paid for 'dead'—find who.",
              "Rival hunters keep sabotaging my trails; flush them out.",
              "The bounty was quietly revoked; someone wants me eliminated.",
              "I need a legal writ from {place} to pursue across jurisdictions.",
              "A coded letter will bait the mark—deliver it and watch my back.",
              "A monster bounty stalks the trade road; trophies required.",
              "The quarry fled to a lawless settlement; negotiate an extradition.",
              "The mark joined the city watch; we need proof before acting.",
              "The target jumped to sea; check docks and ship ledgers in {place}.",
              "I tagged the mark with an arcane dye—protect the mage tracking it.",
              "An ambush is set for me in {place}'s market tomorrow; help flip it.",
              "I’ve got the target in irons—escort us through hostile territory."
            ],
            "goals": [
              "To catch the one target that got away.",
              "To earn enough to retire from this dangerous life.",
              "To bring a true villain to justice.",
              "To clear my name of a killing I didn’t commit.",
              "To found a reputable bounty office in {place}.",
              "To take only 'alive' bounties from now on.",
              "To map a network of safehouses across the realm.",
              "To avenge my mentor betrayed on a job.",
              "To train an heir who does the work ethically.",
              "To secure a standing royal contract.",
              "To end corruption in the bounty system of {place}.",
              "To perfect nonlethal capture techniques.",
              "To become a legend without losing my soul.",
              "To pivot into finding missing persons instead of criminals.",
              "To clean up the most lawless quarter of {place}.",
              "To pay off a blood-debt to a rival crew.",
              "To break the slavers’ ring operating near {place}.",
              "To publish a code of ethics for hunters.",
              "To redeem a past target I wrongly delivered.",
              "To retire to a quiet farm with no wanted posters on the wall."
            ],
            "offers": [
              "I'll split the bounty with you.",
              "I'm an expert tracker and fighter.",
              "I have contacts in the criminal underworld of {place}.",
              "I can arrange a quiet audience with a magistrate.",
              "I can loan manacles, nets, and bola lines.",
              "I can place a watch on known safehouses.",
              "I can share dossiers, sketches, and last sightings.",
              "I can provide locations of discreet safehouses.",
              "I can warn you about rival hunters on the job.",
              "I can secure a temporary pursuit writ for you.",
              "I can introduce you to reliable informants.",
              "I can teach you to tail someone without being seen.",
              "I can escort you through gang territory safely.",
              "I can seed decoy rumors to flush a target.",
              "I can stage a 'buy' to draw the mark into the open.",
              "I can get you through a gate using prisoner transfer ruses.",
              "I can file a bounty on your behalf, legally or… flexibly.",
              "I can recover stolen property through the claims office.",
              "I can set up message dead drops around {place}.",
              "I can call in a favor from the watch captain—once."
            ]
          },
        "Miner": {
            "hooks": [
              "The mine in {place} has collapsed, trapping my friends!",
              "We've broken into an ancient, monster-filled cavern.",
              "The mining company is cheating us out of our pay.",
              "We hit a bad air pocket—help us vent the shafts safely.",
              "Deep-dwellers are raiding our lower galleries at night.",
              "A crew went missing beyond the third gallery; find them.",
              "An underground river flooded our tunnels; need pumps and guards.",
              "Claim-jumpers staked markers inside our boundary; chase them off.",
              "Something haunts the night shift; the drills won’t stay quiet.",
              "Rivals set a cave-in trap on the haulage; help us clear it.",
              "Our ore wagon was ambushed leaving {place}; recover the load.",
              "Unnatural tremors shake the pit at regular intervals—source unknown.",
              "A crate of blasting powder vanished; prevent a disaster.",
              "A toxic mold is spreading through shored timbers—identify a cure.",
              "The surveyor disappeared near a marked fault line.",
              "A runaway ore cart derailed into a forbidden tunnel; retrieve it.",
              "We struck a methane pocket; evacuate and re-open safely.",
              "A crystal vein sings at dusk and lures workers—why?",
              "We opened a sealed dwarven tomb—spirits are angry.",
              "Company thugs intimidate union leaders; we need witnesses guarded."
            ],
            "goals": [
              "To strike a vein of mithril or adamantine.",
              "To buy their freedom from the mining company.",
              "To find a legendary gem said to be in the mountains near {place}.",
              "To make the mine the safest in the realm.",
              "To open a worker-owned cooperative mine.",
              "To map the entire underways beneath {place}.",
              "To perfect safer blasting and support methods.",
              "To restore an abandoned pit as a living museum.",
              "To atone for a past disaster on my watch.",
              "To supply stone for a great cathedral in {place}.",
              "To end debt-scrip and pay fair coin to miners.",
              "To win a rightful claim for my family.",
              "To reclaim ancestral halls lost to cave-ins.",
              "To build a subterranean rail for ore and people.",
              "To find a clean aquifer for nearby villages.",
              "To broker peace with the deep folk we disturbed.",
              "To become guildmaster without selling out the crews.",
              "To master lapidary arts and cut our own gems.",
              "To prove the hollow geode cavern is real.",
              "To retire to a small farm under open skies."
            ],
            "offers": [
              "I know the tunnels and caves around {place} like the back of my hand.",
              "I can spot weak points in stone walls.",
              "I can get you uncut gems for cheap.",
              "I can loan climbing gear, pitons, and lanterns.",
              "I can shelter you in a side shaft few know about.",
              "I can introduce you to the foreman and union stewards.",
              "I can share blasting schedules so you move unseen.",
              "I can test air quality and lend safety lamps and canaries.",
              "I can arrange pack mules and a stout ore cart.",
              "I can stash goods in an old adit no one patrols.",
              "I can mark a map with hidden exits and chimneys.",
              "I can outfit you with sturdy picks and hammers at cost.",
              "I can guide you through the mine during shift changes.",
              "I can trade ore credit with the smelter in {place}.",
              "I can collapse a tunnel behind you to block pursuit.",
              "I can dust you to blend with rock and damp your scent.",
              "I can lead you to crystal caverns for spell foci.",
              "I can hire laborers to move heavy obstacles fast.",
              "I can drill a narrow pilot hole where you need a breach.",
              "I can get you on the crew roster as 'inspectors' for a day."
            ]
          },
          "Farmer": {
            "hooks": [
              "Night creatures are trampling my fields near {place}; help me stand watch.",
              "A blight is spreading through my wheat—find the cause and a cure.",
              "Wolves (or worse) keep taking livestock; track and drive them off.",
              "Someone is stealing grain from my granary; set a trap tonight.",
              "The river jumped its banks and flooded our lower fields; we need hands and pumps.",
              "The well turned bitter overnight; test it and find a new source.",
              "A scarecrow walks at dusk—follow it and end whatever animates it.",
              "A neighbor moved his boundary stones; I need witnesses and a fair arbiter.",
              "Bandits demand 'harvest tax' on the road to {place}; break their hold.",
              "Locust swarms approach; help us build smoke pits and firebreaks.",
              "A merchant sold us bad seed; confront them in {place}.",
              "Strange circles burned into the barley; something landed there.",
              "The reeve says I owe double tithe; check the town ledgers.",
              "A farmhand is missing after chasing lights toward the marsh.",
              "My draft ox fell ill on plow-day; fetch a healer or rare herb.",
              "A hillside shrine protecting our orchards was desecrated; restore it.",
              "A pack of feral hogs is tearing up the potato patch; help trap them.",
              "A traveling hedge-witch cursed my soil after an argument; lift it.",
              "A miller is skimming flour weight; gather proof in {place}.",
              "A caravan trampled our field; I want compensation or justice."
            ],
            "goals": [
              "To make the farm the safest in the valley.",
              "To buy a proper mill press and keep profits local.",
              "To pay off debts and keep the land in the family.",
              "To breed a hardier grain that resists blight.",
              "To irrigate the far field with a new channel to {place}'s river.",
              "To form a co-op so smallholders stop getting cheated.",
              "To restore the old orchard and graft rare varieties.",
              "To build a stone granary that rats cannot breach.",
              "To earn a fair price at market without bribes.",
              "To survive the winter with stores to spare for neighbors.",
              "To teach my children to steward the land kindly.",
              "To replace backbreaking labor with smart tools.",
              "To end the reeve’s corrupt tithe practices in {place}.",
              "To bring bees and learn the honey trade.",
              "To reclaim fallow land overrun by thorn and briar.",
              "To seed a wildflower verge for soil and songbirds.",
              "To restore the shrine that blesses our rains.",
              "To host a harvest fair that unites the hamlets.",
              "To build a windpump so drought never ruins us again.",
              "To retire with the farm thriving and debt-free."
            ],
            "offers": [
              "I can put you up in the barn loft, no questions asked.",
              "I can supply fresh rations and water at cost.",
              "I can loan a sturdy cart and a team for a day.",
              "I can hide you under hay bales or in the root cellar.",
              "I can introduce you to the reeve and village elders.",
              "I can show you back lanes that avoid the toll gate to {place}.",
              "I can raise the hamlet bell if you need quick help.",
              "I can provide simple disguises as field hands.",
              "I can set signal lanterns along the hedgerows for you.",
              "I can barter produce for minor goods you bring.",
              "I can arrange quiet meetings in the cider shed.",
              "I can lend tools—axes, spades, mattocks, scythes.",
              "I can post a boy on lookout to warn of riders.",
              "I can keep a parcel buried under the old oak.",
              "I can get you news from every farmstead by sundown.",
              "I can gather a dozen strong backs for a day’s work.",
              "I can mask tracks across plowed earth or confuse hounds.",
              "I can share weather lore and flood timings near {place}.",
              "I can supply animal byproducts useful to alchemists.",
              "I can quietly move your gear on a produce wagon."
            ]
          },
          "Tailor": {
            "hooks": [
              "A rival slashed my best gowns before a noble's ball; find the culprit.",
              "Someone stole a bolt of rare spider-silk bound for {place}; recover it.",
              "The dyer’s guild cut my allotment; negotiate or uncover their scheme.",
              "A masquerade commission is due by dawn; I need safe access to measure the client.",
              "A cursed garment returns to my shop each night; discover who bound it.",
              "Counterfeiters are selling clothes with my mark; expose their workshop.",
              "A noble wants armor hidden in court fashion; source materials discreetly.",
              "Customs seized imported lace; retrieve lawful papers or the goods.",
              "A loom sings at midnight and tangles threads; something haunts it.",
              "A patron refuses to pay claiming 'ill omen' in the pattern; clear my name.",
              "I sketched a design from an ancient fresco—escort me to copy the rest.",
              "Bandits robbed my courier; my client list is now at risk.",
              "A shipment of dyes spoiled; I need rare mordants from near {place}.",
              "The guild vote is rigged; help me secure honest ballots.",
              "A wedding trousseau went missing; track the thief through pawnshops.",
              "A jealous rival bribed my apprentices; win them back or outmaneuver.",
              "A theater demands costumes for a dangerous play; protect fittings and cast.",
              "A bolt of cloth whispers secrets when cut; help me test it safely.",
              "A client demands a cloak that resists rain and knives; procure materials.",
              "A fireworks show scorched my shopfront—find who ordered it."
            ],
            "goals": [
              "To become master of the tailor's guild in {place}.",
              "To clothe the court with honest, well-paid labor.",
              "To create a garment that changes size flawlessly.",
              "To revive an ancient weave lost to time.",
              "To open a free school for apprentices from poor quarters.",
              "To develop armor-weight cloth that moves like silk.",
              "To perfect weatherproof cloaks for travelers.",
              "To create a uniform style that unites the city watch.",
              "To source dyes that are beautiful and non-toxic.",
              "To design stage costumes that empower street theater.",
              "To secure a royal warrant and crest embroidery rights.",
              "To end sweatshop practices in the alley looms.",
              "To invent a measurement system any tailor can share.",
              "To publish a pattern book that spreads my style.",
              "To craft mourning clothes that honor lost loved ones.",
              "To outfit a relief caravan with rugged, warm gear.",
              "To prove my rival plagiarized my patterns.",
              "To build a sunlit atelier that inspires all who enter.",
              "To make disguises that fool even vigilant guards.",
              "To retire after training a successor better than me."
            ],
            "offers": [
              "I can provide convincing disguises with matching papers’ look.",
              "I can add hidden pockets and sheath channels to your clothes.",
              "I can reinforce seams for climbing and rough travel.",
              "I can tailor uniforms that let you pass as staff in {place}.",
              "I can dye garments to match shadows, stone, or forest.",
              "I can stitch house crests that open noble doors.",
              "I can mend gear overnight and remove most stains.",
              "I can pad armor for silence and comfort.",
              "I can fit you for a gala to meet nobles discreetly.",
              "I can lend drab servant garb for infiltration.",
              "I can sew coded stitching that passes messages.",
              "I can line cloaks with foil to resist sparks and heat.",
              "I can disguise contraband inside hems and interlinings.",
              "I can introduce you to cloth merchants and dyers.",
              "I can supply costume pieces to stage diversions.",
              "I can alter captured uniforms to your sizes.",
              "I can craft weatherproof travel cloaks at cost.",
              "I can keep a wardrobe in storage under an alias.",
              "I can produce quick tear-away outfits for escapes.",
              "I can lend measuring cords and chalks for your own decoys."
            ]
          },
          "Thief": {
            "hooks": [
              "The guild demands a cut I never agreed to—help me get leverage in {place}.",
              "I lifted a noble's signet by mistake; help me return it without being seen.",
              "A rival crew framed me for a burglary; find proof before the watch closes in.",
              "A vault key was split into three tokens hidden across {place}; help me collect them.",
              "A fence is selling cursed goods under my name; expose them discreetly.",
              "An informant vanished after our meet at the old bridge; track who snatched them.",
              "A magistrate keeps a blackmail ledger; I need it swapped for a decoy.",
              "Someone mapped our rooftop routes; destroy copies before a crackdown.",
              "A lockwright owes me a favor but is under guard; get me inside for a chat.",
              "I need a loud distraction at the docks while I lift a ledger from the harbormaster.",
              "A rival crew poaches our marks; challenge them to a 'contest' with fair rules.",
              "A sorcerer warded a strongbox I must open; guard me while I work.",
              "The guildmaster set a death test for me; I want to survive it and keep my pride.",
              "A watch captain runs a shakedown ring; help me plant evidence for internal audit.",
              "A contact in {place}’s sewers found a new smugglers’ artery; secure it before others do.",
              "A noble collector wants a painting ‘borrowed’ for one night; no damage, no alarms.",
              "I hid a haul in a cemetery crypt; now the dead are restless—come with me.",
              "A witness can clear my name but fears reprisals; keep them safe to court.",
              "A counterfeit ring uses my signature cut—help me catch the forger.",
              "A cursed coin keeps returning to my purse; find out who marked me and why."
            ],
            "goals": [
              "To pull off one last legendary job and retire clean.",
              "To go straight and open a locksmith shop in {place}.",
              "To topple the guild’s cruel leadership without bloodshed.",
              "To steal back what was taken from my family.",
              "To perfect nonlethal methods and leave no scars behind.",
              "To build a network that protects street kids from press-gangs.",
              "To outwit the realm's greatest inquisitor and live to laugh about it.",
              "To map the rooftops of {place} better than any city survey.",
              "To settle every debt I owe—fairly, not by the knife.",
              "To become guildmaster and make a code with real honor.",
              "To retire with enough coin to fund honest trade.",
              "To crack the uncrackable vault beneath {place}.",
              "To redeem a partner I betrayed long ago.",
              "To train apprentices who never need to steal to eat.",
              "To expose the noble who profits from the guild’s crimes.",
              "To stage a heist that embarrasses corrupt officials into reform.",
              "To retrieve a relic that proves my true name and lineage.",
              "To make the city safer for the poor by starving predators of targets.",
              "To vanish so thoroughly even the songs can’t find me.",
              "To leave a secret fund for widows and orphans of our trade."
            ],
            "offers": [
              "I can scout buildings and sketch guard rotas in {place}.",
              "I can pick most mundane locks and disarm simple traps.",
              "I can introduce you to a discreet fence who pays fair.",
              "I can secure a safe roof-route across three wards.",
              "I can tail a mark for days without being noticed.",
              "I can plant or remove small items without fuss.",
              "I can arrange a meeting with the guild—neutral ground.",
              "I can provide thief-signs and chalk codes used in {place}.",
              "I can stash your gear where no watchman looks.",
              "I can smuggle you past a gate hidden among porters.",
              "I can stage a convincing 'burglary' to cover your tracks.",
              "I can borrow uniforms that pass at a glance.",
              "I can whistle up lookouts and street urchins as runners.",
              "I can swap parcels at crowded markets without alarm.",
              "I can warn you ahead of watch sweeps and curfews.",
              "I can test gems and coins so you aren’t cheated.",
              "I can set simple alarms and trip-lines at your camp.",
              "I can share maps of sewers and forgotten stairwells.",
              "I can arrange a midnight parley with a rival crew.",
              "I can spread or smother rumors through back-alley channels."
            ]
          },
          "Healer": {
            "hooks": [
              "The clinic in {place} is overwhelmed after a fire—help me triage patients safely.",
              "A strange fever resists my tonics; escort me to gather a rare ingredient.",
              "A cursed wound won't close; I need to consult an old shrine outside {place}.",
              "Refugees arrived injured and starving; protect our supply run to the granary.",
              "Someone is cutting my bandage rolls with chalk dust; find the saboteur.",
              "A plague rumor spreads faster than illness; help me calm the crowd.",
              "An apothecary sells addictive draughts as 'cures'; gather proof.",
              "A noble insists on treatment in secret; ensure privacy and safe passage.",
              "My surgical tools were stolen; track the thief before tonight's operation.",
              "A caravan brought an unknown toxin; I need samples from the source.",
              "Temple wardens and surgeons are feuding; broker peace so we can work.",
              "A battlefield outside {place} will need hands by dawn; escort my wagon.",
              "A child shows signs of a rare curse; fetch a relic from the old chapel.",
              "A water pump is spreading sickness; guard me while I test it.",
              "A werebite victim seeks aid quietly; keep vigil while I treat them.",
              "A cemetery keeper reports restless dead; I need to examine unburied bodies.",
              "Someone swapped my herbal stores with lookalikes; help me replace them fast.",
              "A midwife was taken by bandits; I won’t deliver alone—come with me.",
              "A benefactor funds us but demands control; help me find a fair path.",
              "A traveling charlatan undermines trust in care; counter their show safely."
            ],
            "goals": [
              "To open a public infirmary in {place} with no one turned away.",
              "To train a new class of field medics for caravans and militias.",
              "To cure a disease that took my family.",
              "To prove that faith and science can work together.",
              "To create sterile kits cheap enough for every village.",
              "To end price-gouging on lifesaving tonics in {place}.",
              "To map safe water sources and publish them freely.",
              "To replace addictive pain draughts with safer blends.",
              "To found a school for midwives and bone-setters.",
              "To perfect a poultice that closes wounds without scarring.",
              "To earn the right to practice in any temple ward.",
              "To build a rolling clinic that reaches the remotest farms.",
              "To compile a handbook in plain words anyone can use.",
              "To coordinate disaster response across guilds and temples.",
              "To secure a stockpile that keeps through harsh winters.",
              "To teach rulers that prevention is cheaper than cures.",
              "To reconcile with a mentor I defied.",
              "To establish fair burial and quarantine practices.",
              "To ensure healers are protected, not preyed upon, in {place}.",
              "To retire after training successors who surpass me."
            ],
            "offers": [
              "I can provide first aid and stabilize the wounded.",
              "I can brew simple antitoxins and fever tonics at cost.",
              "I can vouch for you with temple wardens in {place}.",
              "I can teach you triage and clean-field practices.",
              "I can examine water and food for contamination.",
              "I can write letters for passage to quarantined districts.",
              "I can offer a safe cot in the infirmary for a night.",
              "I can arrange quiet treatment off the books.",
              "I can assess curses and advise on proper ritual help.",
              "I can supply clean bandages and splints for travel.",
              "I can keep a patient sedated during a hard journey.",
              "I can coordinate with apothecaries for bulk remedies.",
              "I can introduce you to midwives and surgeons I trust.",
              "I can certify fitness for certain official tasks.",
              "I can share symptom bulletins so you avoid outbreaks.",
              "I can bless your camp with simple wards of comfort.",
              "I can maintain confidentiality when it truly matters.",
              "I can help negotiate fair prices for care in {place}.",
              "I can prepare a field kit tailored to your route.",
              "I can send a runner to fetch help if things go bad."
            ]
          },
          "Wizard's Apprentice": {
            "hooks": [
              "My master vanished mid-ritual; the tower wards lock me out—help me get inside.",
              "Our spellbook sprouted legs and fled into {place}'s alleys; retrieve it intact.",
              "A rival apprentice hexed my exam quills; I need evidence.",
              "An unseen servant barricaded the lab; hold the door while I dispel it.",
              "A summoned sprite stole my focus crystal and flew toward the bell tower.",
              "The familiar I was binding escaped into the sewers; it's clever and invisible.",
              "The teleportation circle misaligned to a ruin outside {place}; escort me to recalibrate it.",
              "An animated broom is recruiting other brooms; we must stop a sudsy uprising.",
              "The guild confiscated my thesis; help me copy it from the restricted stacks.",
              "A bottle imp I bought swears it's cursed—please help adjudicate the bargain.",
              "A lightning rod atop the tower attracts something at dusk; guard me during the storm.",
              "My master owes an alchemist; I must deliver a rare reagent safely.",
              "A mirror shows a different room each midnight; watch my back while I step through.",
              "A bookbinder replaced our grimoire's pages with blanks; find the missing leaves.",
              "An examiner insists I duel; be my seconds and prevent lethal 'accidents'.",
              "Wild magic surges near {place}'s fountain; I need samples of the water.",
              "The arcane laundry turned my robes invisible—help me find the valve spirits.",
              "The town council wants our tower inspected; hide the more… risky research.",
              "Someone swapped our chalk with ghost chalk; now sigils attract the dead.",
              "A golem in the basement wants freedom; negotiate before it breaks out."
            ],
            "goals": [
              "To earn my first wizard's sash and be recognized by the guild of {place}.",
              "To restore my mentor from petrification.",
              "To craft my own wand from a lawful source.",
              "To master one school without neglecting the others.",
              "To publish a thesis that even archmages respect.",
              "To pay off my apprenticeship debts honorably.",
              "To build a safe laboratory that never explodes.",
              "To map the ley lines beneath {place}.",
              "To design wards that protect, not imprison.",
              "To perfect a harmless fireworks cantrip for festivals.",
              "To translate an ancient primer lost in the stacks.",
              "To prove I'm more than a servant carrying reagents.",
              "To rescue apprentices exploited by cruel masters.",
              "To develop rituals that use fewer rare components.",
              "To create a familiar that chooses its mage freely.",
              "To repair the tower's broken floating stair.",
              "To discover why wild surges spike at dawn.",
              "To earn a teaching license from the academy.",
              "To correspond with scholars beyond {place}.",
              "To found a scholarship for poor but gifted students."
            ],
            "offers": [
              "I can scribe low-tier scrolls neatly if you supply the formula.",
              "I can identify simple magical auras with time and tools.",
              "I can arrange a meeting with my master—if they are… available.",
              "I can secure after-hours access to the academy's public library.",
              "I can ward a campsite with basic alarm sigils.",
              "I can mend torn gear and minor cracks with cantrips.",
              "I can copy maps with perfect fidelity using tracing cantrips.",
              "I can maintain a ritual light through the night.",
              "I can perform ritual casting to save your costly components.",
              "I can lend a spare component pouch and chalks.",
              "I can provide arcane chalk and ink for circles and sigils.",
              "I can translate common arcane shorthand in {place}'s notes.",
              "I can test potions for spoilage or simple curses.",
              "I can fetch guild permits for experiments in {place}.",
              "I can consult star calendars to choose auspicious timings.",
              "I can conjure harmless illusions for distraction or theater.",
              "I can introduce you to bookbinders who hide compartments.",
              "I can maintain a familiar as a messenger for short distances.",
              "I can mark a safe circle you can retreat to in emergencies.",
              "I can keep an accurate lab log that protects you legally."
            ]
          },
          "Rat Catcher": {
            "hooks": [
              "The granary in {place} crawls at night; my traps aren't enough—help me clear it.",
              "Something in the sewers is organizing the rats into packs; find the 'king'.",
              "A noble's pantry is infested, but they demand discretion.",
              "The temple crypt is chewed through; relics are scattered.",
              "A cheese merchant blames me for gnawed barrels; prove the holes were cut by thieves.",
              "My best terrier fell into a drain; help me navigate the culverts.",
              "A rat the size of a hound guards a litter near the aqueduct—move it safely.",
              "Someone poisons the wells blaming 'vermin'—we need evidence.",
              "A wererat gang demands tribute; map their burrows with me.",
              "A ship from far lands brought strange fleas; quarantine the docks.",
              "A sewer sluice jammed with bones; something bigger is down there.",
              "A rat king with knotted tails was seen; I want it studied, not slain.",
              "The council wants proof my methods are humane; I'll stage a demonstration.",
              "A rival catcher is seeding rats to make business; expose him.",
              "A pastry shop refuses to close for cleaning; persuade them before a scandal.",
              "Something eats the rats I snare and leaves only skins.",
              "A plague rumor starts after each of my jobs; someone spreads lies.",
              "A hidden smuggler route uses old ratways; help me seal it… or sell it.",
              "A witch claims the rats are her familiars; negotiate a truce.",
              "The flood opened new tunnels beneath {place}; survey them before the vermin do."
            ],
            "goals": [
              "To make {place}’s grain stores vermin-proof.",
              "To train a line of champion ratting terriers.",
              "To earn an honest city contract and steady pay.",
              "To write a proper manual on humane trapping.",
              "To replace poison with smarter methods.",
              "To prove a rival fakes infestations.",
              "To trace the outbreaks to their real cause.",
              "To map every drain and culvert under {place}.",
              "To retire with both knees still good.",
              "To get respect for a dirty, necessary trade.",
              "To start a school for apprentices who need work.",
              "To build sealed refuse bins for the market quarter.",
              "To breed cats that hunt but don't spread disease.",
              "To convince the council to fund repairs to the sewers.",
              "To capture a living rat king for study.",
              "To rid the docks of plague fleas.",
              "To stop smugglers using rat holes for crime.",
              "To set up community clean days that actually happen.",
              "To invent a scent barrier that keeps vermin away.",
              "To pass the trade on to my child better than I found it."
            ],
            "offers": [
              "I can show you sewer entrances no one else notices.",
              "I can set traps that alert you with a simple bell line.",
              "I can lend a trained terrier to guard your camp at night.",
              "I can mask your food stores with scents vermin avoid.",
              "I can scout underfloors and hollow walls quietly.",
              "I can guide you through drains to bypass patrols—messy but fast.",
              "I can identify nests, droppings, and paths at a glance.",
              "I can supply sturdy bite-proof bags and oilskins.",
              "I can smoke out a tunnel without bringing the place down.",
              "I can rig one-way doors to seal a passage behind you.",
              "I can stash small parcels in dry niches no one checks.",
              "I can teach you how to avoid disease after sewer work.",
              "I can borrow the night soil cart as a perfect cover.",
              "I can coordinate with market wardens to clear alleys.",
              "I can retrieve items you drop in grates—most of the time.",
              "I can read the flow of water to predict floods in {place}.",
              "I can introduce you to dockhands who owe me favors.",
              "I can set decoy bait that reveals thieves instead of rats.",
              "I can provide leather gaiters and gloves at cost.",
              "I can keep your hideout vermin-free for a month—guaranteed."
            ]
          },
          "Librarian": {
            "hooks": [
              "A rare manuscript vanished from the restricted stacks in {place}; help me recover it quietly.",
              "Moisture spells failed and mold spreads through the archives; escort me to fetch reagents.",
              "A donor demands we display a cursed tome; I need leverage to refuse.",
              "Someone is cutting pages from travel journals; trap the culprit in the reading room.",
              "A phantom turns pages at night to the same passage; guard me while I investigate.",
              "Catalog cards were swapped to hide a book's location; restore the truth before inspection.",
              "An overdue grimoire belongs to a very dangerous borrower; accompany me to retrieve it.",
              "A crate of records for {place}'s taxes arrived mis-numbered; help reconcile before audits.",
              "The genealogy ledger contradicts itself; I suspect forgery—find the original copy.",
              "A bookworm the size of a hound is eating bindings; track it into the sub-basement.",
              "A traveling scholar claims ownership of our atlas; verify provenance on the road.",
              "A map glows when the moon is high; escort me to test it outdoors.",
              "The scriptorium apprentices smuggle out chapbooks; intercept the next handoff.",
              "A fiery marginalia spirit escaped from an illuminated text; contain it without burning shelves.",
              "The bell tower's chimes encode references; help me decode the pattern.",
              "A noble wants the banned list to target dissidents; hide sensitive records with me.",
              "An ancient index points to a 'Room 0' that shouldn't exist; stand watch while I search.",
              "Couriers with periodicals for {place} keep getting robbed; establish a safe route.",
              "Two catalog systems disagree; I need to collate in a hostile rival library.",
              "A witness placed a confession between pages; find it before the watch arrives."
            ],
            "goals": [
              "To make knowledge in {place} accessible to common folk safely.",
              "To complete a unified catalog across languages and scripts.",
              "To preserve fragile texts against damp, fire, and zealots.",
              "To recover volumes looted during the last war.",
              "To compile an honest history that the powerful cannot erase.",
              "To establish a traveling book-wagon for distant hamlets.",
              "To train archivists who can spot forgeries at a glance.",
              "To build a vault that survives siege and flood.",
              "To translate a corpus of field journals into plain speech.",
              "To map the underground stacks and seal dangerous niches.",
              "To secure a charter that protects the library from politics.",
              "To index oral histories before the elders of {place} pass on.",
              "To digit—no, meticulously copy—maps with accurate scales.",
              "To reunite a scattered collection of a famed explorer.",
              "To create a reading school where children learn for free.",
              "To restore a lost catalog of medicinal recipes responsibly.",
              "To craft a classification for magical works that reduces harm.",
              "To sponsor public lectures that uplift, not inflame.",
              "To obtain a genuine first edition of the city's founding charter.",
              "To ensure the library outlives me by a thousand years."
            ],
            "offers": [
              "I can grant you reading-room access after hours in {place}.",
              "I can produce copies of maps, deeds, and letters quickly.",
              "I can verify seals and expose common forgeries.",
              "I can arrange a carrel for discreet meetings among stacks.",
              "I can research any local law or custom within a day.",
              "I can introduce you to scholars and clerks who owe favors.",
              "I can hide small items inside rebinding projects.",
              "I can provide library cards that pass first inspection.",
              "I can fetch city plans showing tunnels and service corridors.",
              "I can produce old newspapers that shift public opinion.",
              "I can annotate your maps with references and safe houses.",
              "I can recommend quiet lodgings to visiting scholars.",
              "I can request inter-library loans from cloistered orders.",
              "I can teach you cyphers used by catalogers in {place}.",
              "I can store sealed packets in our deed chest securely.",
              "I can post notices that reach literate guilds fast.",
              "I can provide a stack ladder and canvas tarps for stealth.",
              "I can summon a calm hush that muffles your movements.",
              "I can certify a transcript for court or guild review.",
              "I can signal allies by arranging books in certain windows."
            ]
          },
          "Grave Digger": {
            "hooks": [
              "Freshly filled graves in {place} are being disturbed; help me catch the robbers.",
              "A bell rope rang from a safety coffin at midnight; dig with me and pray we're in time.",
              "Something tunnels beneath the old mausoleum; I hear stone cracking.",
              "A grieving family swears the marker names are swapped; verify records and right the wrong.",
              "Glow-worms form words on new graves; stand watch while I read them.",
              "A plague pit was uncovered by floodwater; we must secure it safely.",
              "The night watch refuses to enter after dusk; accompany me to finish rites.",
              "A noble demands a secret burial outside consecrated ground; weigh the risks with me.",
              "Strangers meet among the headstones to trade contraband; gather proof.",
              "A lich-hunter wants to exhume a body; ensure the permit is real—or stop them.",
              "A mourner leaves black salt sigils; identify and confront them discreetly.",
              "A sinkhole opened under the paupers' field; rescue remains with dignity.",
              "A procession vanished between the gate and chapel; follow the cart tracks.",
              "Children dare each other to enter the bone vault; post a safe watch tonight.",
              "A spirit complains its grave goods were stolen; track the fence in {place}.",
              "A new crypt door sweats chill air and whispers; help me seal it properly.",
              "Scavengers gnaw coffin wood; something bigger drives them.",
              "The bell tower clapper fell onto graves; recover it without further damage.",
              "A headless statue points each dawn at a different plot; find the pattern.",
              "An undertaker forged burial records; compare with my ledger and catch them."
            ],
            "goals": [
              "To keep the dead at peace and the living safe in {place}.",
              "To map every grave, crypt, and tunnel beneath the yard.",
              "To establish proper rites for paupers and travelers alike.",
              "To build drainage so floods never foul the resting places.",
              "To end grave robbery through vigilance and fair law.",
              "To repair broken stones and honor forgotten names.",
              "To sanctify the old north field where curses linger.",
              "To train assistants who treat the dead with respect.",
              "To relocate bones threatened by the new roadworks.",
              "To plant yews and wildflowers that soothe mourners.",
              "To compile a book of epitaphs and their stories.",
              "To seal dangerous catacombs without burying secrets.",
              "To reconcile with the temple over jurisdiction.",
              "To craft coffins that waste less wood yet endure.",
              "To create a memorial for unidentified remains.",
              "To ensure night watches are paid and sober.",
              "To end the practice of false burials for insurance.",
              "To prove a rumored mass grave and mark it properly.",
              "To teach schoolchildren respect for sacred grounds.",
              "To be buried simply among those I served."
            ],
            "offers": [
              "I can show you crypt entrances and service tunnels no one else uses.",
              "I can hide you in a bier wagon or tool shed until nightfall.",
              "I can provide sturdy shovels, lanterns, and grave boards at cost.",
              "I can produce burial records and plot maps for {place}.",
              "I can arrange a midnight meeting by the chapel without witnesses.",
              "I can dig a decoy trench to mislead pursuers.",
              "I can consecrate or salt a threshold against restless things.",
              "I can introduce you to a discreet stonecutter and carpenter.",
              "I can loan pallbearer cloaks for inconspicuous movement.",
              "I can identify fresh disturbances and hidden burrows quickly.",
              "I can keep a parcel safe inside a sealed niche.",
              "I can coordinate with temple wardens for quiet rites.",
              "I can advise on embalming scents to mask odors on the road.",
              "I can ring the passing bell as a signal at set hours.",
              "I can mark safe walking lines across soft ground at night.",
              "I can erect temporary screens to block prying eyes.",
              "I can escort you through catacombs without getting lost.",
              "I can supply lime and tools to neutralize hazards.",
              "I can recommend honest undertakers and warn of frauds.",
              "I can arrange a solemn cover story for your presence here."
            ]
          },
          "Sailor": {
            "hooks": [
              "My ship's compass spins whenever we near {place}'s lighthouse; find out why.",
              "Pirates shadowed us for three nights; help set a trap beyond the shoals.",
              "The harbormaster seized our cargo after an anonymous tip; clear our manifest.",
              "A crewman vanished overboard without a splash; something called him.",
              "Smugglers use my colors to move contraband; restore my name in {place}.",
              "A sea serpent nests near the channel markers; we need it driven off.",
              "The figurehead whispers routes at midnight; escort me to test them.",
              "Mutiny brews belowdecks; mediate before knives come out.",
              "Storm wreckage carries a noble's seal; salvage it before rivals.",
              "The quarantine flag was raised on my ship without cause; prove we’re clean.",
              "A cursed cargo sings; I need it dumped far from {place} without notice.",
              "The tide charts no longer match; sound the bar with me at low tide.",
              "Press-gangers took my best hand; free him from a warship.",
              "A ghost ship mirrors our course; board it with me at moonrise.",
              "Dockside toughs demand 'mooring fees'; catch the collector's boss.",
              "A rival captain sabotaged our rigging; gather proof in {place}.",
              "We found a bottle chart to a hidden cove; help me reach it first.",
              "My pilot was bribed to run us aground; we need a new pilot fast.",
              "A storm spirit haunts our mast; find an appeasement rite.",
              "A bale of silk burst with strange spores; secure and study it."
            ],
            "goals": [
              "To captain my own ship without debt.",
              "To chart a safe passage through the reefs near {place}.",
              "To find the island my father swore existed.",
              "To earn a letter of trade exempt from petty tariffs.",
              "To recruit a crew who'd follow me through any storm.",
              "To master celestial navigation and teach it to others.",
              "To run a regular ferry that binds {place} to distant ports.",
              "To uncover who keeps tipping pirates to my routes.",
              "To retire with enough to buy a dockside warehouse.",
              "To rescue survivors lost on the black current.",
              "To prove a legendary current can be ridden upstream.",
              "To make the harbor safe from press-gangs.",
              "To earn the title Harbor Pilot of {place}.",
              "To map the shoals so no more ships break there.",
              "To build a stout lifesaving station on the headland.",
              "To bring home my missing sibling from a distant sea.",
              "To recover a sunken bell and ring it again.",
              "To break the curse on my bloodline at sea.",
              "To join the explorers' guild with a discovery.",
              "To die on land, not in a storm."
            ],
            "offers": [
              "I can secure you passage to or from {place}.",
              "I can hide you in a ballast locker or cable tier.",
              "I can get your gear past the dock inspectors.",
              "I can introduce you to the harbor pilot on duty.",
              "I can read tides and weather to time your move.",
              "I can lend a skiff for quiet landings.",
              "I can store a crate in my hold under honest cargo.",
              "I can move messages along coastal ships fast.",
              "I can arrange berths on a convoy with protection.",
              "I can teach knots and rigging useful for climbs.",
              "I can provide tarps, line, and grapnels at cost.",
              "I can get you on the crew roster as deckhands.",
              "I can smuggle small items inside coil cores.",
              "I can set signal lanterns to guide you at night.",
              "I can recommend captains who won't ask questions.",
              "I can call in a favor from the dockmaster once.",
              "I can secure a warehouse bay for a day.",
              "I can tow your craft with our longboat.",
              "I can arrange a false foghorn pattern as cover.",
              "I can post lookouts across the masts to spot trouble."
            ]
          },
          "Noble": {
            "hooks": [
              "A rival petitions to strip my lands near {place}; help me contest it.",
              "A family heirloom vanished from the vault; retrieve it discreetly.",
              "I am challenged to a duel at dawn; investigate the instigator.",
              "A marriage alliance could end a feud; vet the other house.",
              "A blackmailer holds letters; switch them for decoys.",
              "Peasants plan a march on my manor; help me hear them safely.",
              "An impostor collects rents in my name; unmask them.",
              "The council will vote on a tax; sway two undecided members.",
              "A banquet was poisoned; find the source before the feast resumes.",
              "Bandits claim to act under my seal; expose their patron in {place}.",
              "A cousin forged a will; secure the true testament.",
              "Smugglers use my boathouse; catch them without scandal.",
              "A relic in our chapel is missing; solve it before pilgrims arrive.",
              "An estate boundary stone was moved; survey and restore it.",
              "My steward hides accounts; audit the ledgers with me.",
              "A hunting accident was no accident; identify the would-be killer.",
              "Guests at my masquerade plan a theft; guard the gallery.",
              "The town criers spread seditious verse; trace the author.",
              "My heir is kidnapped; negotiate or mount a rescue.",
              "Refugees camp on my land; arrange relief without inviting revolt."
            ],
            "goals": [
              "To govern {place} justly and be remembered kindly.",
              "To end a generations-old feud honorably.",
              "To restore the manor and employ local craftsmen.",
              "To reform tithes and rents to be fair.",
              "To secure a seat on the high council.",
              "To educate my heir to be better than I was.",
              "To fund public works—roads, wells, and bridges.",
              "To root out corruption in my household.",
              "To patronize scholars and artists who uplift {place}.",
              "To establish a refuge for the poor on my lands.",
              "To modernize defenses without oppressing the people.",
              "To prove my claim against a conniving cousin.",
              "To see justice done without favoritism.",
              "To create a charter that limits my successors' excesses.",
              "To end brigandage on the roads through diplomacy.",
              "To reconcile with a village I wronged.",
              "To marry for love without weakening alliances.",
              "To ensure succession is clear and peaceful.",
              "To plant forests and steward the river's health.",
              "To retire from court intrigue and actually live."
            ],
            "offers": [
              "I can grant an audience with key officials in {place}.",
              "I can provide letters of introduction to noble houses.",
              "I can offer temporary lodging in my guest wing.",
              "I can secure legal counsel and advocates.",
              "I can issue a minor writ to ease travel and trade.",
              "I can sponsor your petition before the council.",
              "I can place you under my protection—briefly.",
              "I can fund part of an expedition in exchange for shares.",
              "I can host a meeting where rivals must behave.",
              "I can loan liveried clothing to pass as my staff.",
              "I can present you at court without raising eyebrows.",
              "I can store sensitive items in my family vault.",
              "I can pay discreet informants within high society.",
              "I can arrange access to private gardens and archives.",
              "I can introduce you to the captain of the guard.",
              "I can call off pursuit within my lands for a night.",
              "I can commission bespoke gear from master artisans.",
              "I can intercede with the temple on your behalf.",
              "I can quietly erase a minor fine or citation.",
              "I can host a masquerade as cover for your operation."
            ]
          },
          "Chieftain": {
            "hooks": [
              "A rival clan moved our boundary cairns near {place}; arbitrate before blood is shed.",
              "Scouts spotted raiders shadowing our herds; help set an ambush.",
              "The totem stone cracked after lightning; escort me to the seer’s cave.",
              "A peace moot in {place} needs neutral escorts—no weapons drawn.",
              "Hotheaded youths plan a cattle raid on allies; stop them without killing.",
              "A city tax collector trespasses on our land; find lawful grounds to repel him.",
              "The sacred spring runs foul; discover the cause upstream of {place}.",
              "Famine looms after hail; secure a grain convoy before rivals do.",
              "Our envoy was seized at the ford; arrange a prisoner exchange.",
              "A rival demands trial by combat; find a champion—or a legal loophole.",
              "Boats vanish at the crossing; expose sabotage along the reeds.",
              "The seer warns of a white wolf omen; track and interpret its path.",
              "Merchants clear-cut a grove despite our treaty; make them answer in {place}.",
              "Messengers vanish on the ridge road; something nests in the crags.",
              "The longhouse burned; track the arsonists through the marsh.",
              "My heir fled with a lover from a rival house; bring them back safely.",
              "The salt caravan is overdue; it may have taken the haunted pass.",
              "A storm wrecked our winter stores; help salvage and guard the site.",
              "An old warlord’s barrow was opened; oath-breakers stir at night.",
              "Refugees ask for shelter on our land; help us screen and resettle fairly."
            ],
            "goals": [
              "To unite the valley clans under a just compact.",
              "To end a generations-long blood feud honorably.",
              "To win lawful recognition from the council of {place}.",
              "To secure winter stores so no child starves again.",
              "To train a successor chosen by council, not only by blood.",
              "To raise palisades and watchtowers along the frontier.",
              "To codify wergild and forbid vengeance killings.",
              "To open a safe trade road between our lands and {place}.",
              "To reclaim grazing rights lost to creeping borders.",
              "To protect sacred groves and springs from exploitation.",
              "To found a school so our children need not leave to learn.",
              "To end slave-taking and ransom abuse along the river.",
              "To forge an oath-bond with the mountain dwarves.",
              "To shift from lone rule to a circle of elders over time.",
              "To restore the cracked oathstone and renew our vows.",
              "To keep traditions while adopting worthy crafts and tools.",
              "To build a granary network shared by all hamlets.",
              "To ensure women and elders hold council seats.",
              "To map our seasonal routes and mark safe camps.",
              "To retire to counselor and see peace hold after me."
            ],
            "offers": [
              "I can grant you safe-passage tokens through our lands.",
              "I can assign warriors to escort you across the marches.",
              "I can extend guest-right: shelter, food, and protection.",
              "I can signal with war-horns and drums to cover your moves.",
              "I can lend trackers who read spoor like script.",
              "I can loan pack beasts and a stout cart for a day.",
              "I can provide guides through the high passes and fords.",
              "I can share dried provisions and water-skins at cost.",
              "I can mediate disputes with neighboring clans.",
              "I can introduce you to our smiths, fletchers, and healers.",
              "I can call a warband once to answer your horn.",
              "I can name you oath-kin for limited protection in {place}.",
              "I can provide a ferry or canoe at the guarded crossing.",
              "I can mark you with clan colors to pass patrols unchallenged.",
              "I can outfit you with tents and cold-weather gear.",
              "I can post lookouts to warn you of riders or raids.",
              "I can grant temporary hunting and felling rights.",
              "I can hide you among our traveling camp unnoticed.",
              "I can pledge nonaggression across our territory for three days.",
              "I can convene a moot so all clan heads hear your case."
            ]
          },
          "Shaman": {
            "hooks": [
              "My dreams warn of a flood; come read the river spirits with me near {place}.",
              "A child speaks in many voices; help with a gentle, lawful exorcism.",
              "Bone totems from the shrine were stolen; track the thief before the new moon.",
              "A cult disrupted the eclipse rite; recover the stolen relic and restore balance.",
              "The ancient oak sickens; fetch sap and soil from three springs around {place}.",
              "A burial cairn was opened; an ancestor wanders asking for rites.",
              "Witch-fire dances on the moor; I need samples without angering what makes it.",
              "A rival shaman spreads fear; witness a public debate and keep blades sheathed.",
              "The spirit-road to {place} is blocked; guard me while I reopen the gate.",
              "Our totem beast was wounded by iron; escort me to heal it.",
              "A thunderbird feather was stolen from the lodge; retrieve it quietly.",
              "Nightmares bind the village; stand watch while I weave a dream ward.",
              "A fey market lures our youths; recover them without breaking the truce.",
              "Star-iron fell beyond the ridge; gather it without offending the sky.",
              "Sickness follows a newly dug well; appease the earth and test the water.",
              "A ceremonial mask possesses its wearers; help bind it in a cold stream.",
              "A storm is trapped in the drum; release it over safe ground.",
              "A ghost bride seeks a lost ring; find it and finish her vows.",
              "Hunters broke a taboo at the calving grounds; make reparations swiftly.",
              "A shadow at noon devours light; identify and drive off the sun-eater."
            ],
            "goals": [
              "To keep balance between clan, land, and spirits around {place}.",
              "To train a worthy successor before my strength fails.",
              "To collect songs and oral law before elders pass on.",
              "To end blood-magic and expose charlatans safely.",
              "To reconcile our lodge with the temple and the druids.",
              "To map spirit-paths and safe crossings near {place}.",
              "To restore shrines defiled by fear or neglect.",
              "To banish a devouring thing that feeds on grief.",
              "To teach simple wards every household can keep.",
              "To prove healing does not require cruelty or rare parts.",
              "To lift a hereditary curse that haunts our line.",
              "To craft a rite that cools battle-fury before it kills.",
              "To found a sanctuary where the outcast can mend.",
              "To learn the true names of the local winds.",
              "To bind a treaty with the river spirit for fair water.",
              "To see the bones of the forgotten properly laid.",
              "To keep festivals joyful without drunken harm.",
              "To protect totem beasts from hunters and hunger.",
              "To meet death well and become a kindly ancestor.",
              "To ensure our rites can be done with common means."
            ],
            "offers": [
              "I can bless you with a ward that lasts a day.",
              "I can purify food and water drawn near {place}.",
              "I can identify simple curses and advise remedies.",
              "I can set protective circles around your camp.",
              "I can speak on your behalf to fey or local spirits.",
              "I can craft small talismans that carry good luck.",
              "I can guide you along spirit-roads—swift but risky.",
              "I can keep vigil and guard your dreams from harm.",
              "I can read omens in wind, ash, and birds.",
              "I can introduce you to hermits and elders who know the land.",
              "I can hold a naming or masking rite for a new identity.",
              "I can cleanse taboo-breaking to lift lingering bad luck.",
              "I can teach breath and focus to steady fearful hearts.",
              "I can consecrate ground for safe, undisturbed rest.",
              "I can bury or burn remains with proper rites and respect.",
              "I can keep a dangerous relic in a warded cache for a time.",
              "I can ask a spirit-guide beast to scout at a distance.",
              "I can share chants that harden minds against coercion.",
              "I can mark safe trees and stones to guide you in storms.",
              "I can forecast weather signs for travel around {place}."
            ]
          },
          "Cartographer": {
            "hooks": [
              "My boundary map for {place} was altered—help me find the true survey stones.",
              "I must triangulate from a perilous peak overlooking {place}; escort me to the summit.",
              "An old chart shows an island that moves; I need proof it exists.",
              "Survey cairns are being knocked down at night; catch the saboteur.",
              "A mosaic map in the bathhouse points to tunnels; guard me while I trace it.",
              "Counterfeit copies of my atlas flood {place}; find the forger's press.",
              "The river changed course after storms; I need to remap before the tax men arrive.",
              "A comet misaligned my star charts; help recalibrate the observatory.",
              "Ink that blooms only in marsh mist reveals routes; fetch a flask from {place}'s fen.",
              "A patron wants a 'secret route' to a smuggler’s cove; vet the request and escort me.",
              "Hikers vanished following my guide; see if a rival swapped the waystones.",
              "A vault opens with map-folds as a key; watch my back while I test the pattern.",
              "A lighthouse bearing no longer matches charts; resight the coastal baselines.",
              "A rival accuses me of plagiarism; secure my field notes from a witness in {place}.",
              "A hill rings hollow where my levels dip; investigate a rumored undercity.",
              "A noble demands I shrink rival lands on paper; help me refuse safely.",
              "A sandstorm buried half my markers; help me re-establish the grid.",
              "Strange lights trace lines over {place} at night; I need to record their path.",
              "A caravan wants a desert route with water marks; guide me to verify the wells.",
              "My pack mule was mauled near a benchmark; guard me while I recover the gear."
            ],
            "goals": [
              "To publish the definitive atlas of {place} and its surrounds.",
              "To standardize place-names so travelers stop getting lost.",
              "To map safe trails for caravans and pilgrims.",
              "To chart the undercity tunnels beneath {place}.",
              "To correct ancient errors copied for generations.",
              "To create raised-relief maps anyone can read by touch.",
              "To plot ley lines and correlate them with ruins.",
              "To compile a tide and current annex respected by sailors.",
              "To found a public map-room and survey school in {place}.",
              "To leave accurate milestones on every major road.",
              "To survey a geodetic baseline across the valley.",
              "To produce pictographic maps useful to the illiterate.",
              "To chart winter routes passable when passes close.",
              "To reconcile temple, guild, and crown boundaries fairly.",
              "To map every reliable spring and way-station near {place}.",
              "To chart the starfield as seen from sacred hilltops.",
              "To annotate hazards—bandits, beasts, and bad bridges—honestly.",
              "To release open survey notes so others can improve them.",
              "To earn a guild master-seal recognized in any court.",
              "To bury a time-tube of maps for those who come after."
            ],
            "offers": [
              "I can loan you precise maps of {place} and nearby wilds.",
              "I can draw a custom route with time and distance marks.",
              "I can annotate your map with safe houses and waypoints.",
              "I can show roof-routes and alley lines most miss.",
              "I can update you on patrol paths and gate schedules.",
              "I can write letters to surveyors along your road.",
              "I can lend compasses, plane tables, and field lenses.",
              "I can hide a message inside a survey cairn outside {place}.",
              "I can craft decoy maps that mislead pursuers.",
              "I can file plats and deeds that stand up in court.",
              "I can mark vantage points perfect for signals or ambushes.",
              "I can share wind and weather patterns season by season.",
              "I can place subtle glyphs on stones to guide you back.",
              "I can create invisible-ink overlays that reveal at dusk.",
              "I can draft 'treasure maps' as believable covers.",
              "I can measure ranges useful for siege or hunting.",
              "I can get you reading-room access to guild charts in {place}.",
              "I can teach basic orienteering and pace counting.",
              "I can print your route on cloth that resists rain and fire.",
              "I can store your travel log sealed in my map chest."
            ]
          },
          "Shipwright": {
            "hooks": [
              "Someone is boring holes in new hulls at night; help me catch the saboteur in {place}.",
              "A dryad guards the best timber stand; negotiate sustainable cuts or an alternative.",
              "My new design lists in crosswinds; I need ballast trials under guard.",
              "A supplier sold iron that rusts to dust; track them before the next launch.",
              "A warship commission is late; escort rare pitch and timber through bandit country.",
              "The keel was laid off-true; help me jack and block it before dawn inspection.",
              "Sea trials need a steady crew and sharp eyes; join us past the headland.",
              "My yard plans were stolen; recover them before a rival files a claim in {place}.",
              "Guild stewards shut my slip for 'safety'; expose the bribe behind it.",
              "Shipworms infest a batch of planks; acquire copper and lime quickly.",
              "The tar kettles ran dry; guard a convoy to the pitch fields near {place}.",
              "A figurehead arrived cursed; find a rite or a carver to calm it.",
              "A wreck with my maker's mark lies offshore; help salvage before scavengers do.",
              "Dock taxes tripled overnight; find who forged the decree.",
              "A client demands hidden compartments; judge whether to build them—and the risks.",
              "I must tow an unfinished hull to {place}; protect us from pirates and rocks.",
              "A storm snapped the new mast; fetch a straight spar from the high forest.",
              "Someone stole every anchor chain in my yard; track the blacksmith's thieves.",
              "We found an ancient riverboat hull; secure it for study before it's looted.",
              "The river ran shallow this season; help dredge a channel past the launch ways."
            ],
            "goals": [
              "To build the fastest cutter on the coast.",
              "To design watertight compartments that save crews.",
              "To open a teaching yard that raises honest apprentices.",
              "To source timber without destroying sacred groves.",
              "To craft a flagship worthy of a royal fleet from {place}.",
              "To fit hospital ships that carry hope, not plague.",
              "To master copper sheathing to beat worms and weed.",
              "To invent a folding topmast for low bridges upriver.",
              "To standardize parts so repairs are swift in any port.",
              "To earn a permanent drydock berth on the inner quay.",
              "To starve corruption from the dock guilds of {place}.",
              "To see every ship leave with true lifeboats aboard.",
              "To build a twin-hull ferry safe for rough rivers.",
              "To pay off the yard's debts and own my tools outright.",
              "To teach sailors to maintain, not merely endure, their ships.",
              "To perfect a sail plan that beats upriver winds.",
              "To carve figureheads that bless and protect their crews.",
              "To unite shipwrights against predatory contracts.",
              "To turn the old boathouse into a working museum.",
              "To retire with my name on a fleet still afloat."
            ],
            "offers": [
              "I can prioritize repairs or refits for your vessel in {place}.",
              "I can add hidden lockers or false bottoms—if you accept the risks.",
              "I can reinforce hulls, rails, and ladders for hard boarding.",
              "I can lend a skiff or punt for quiet landings.",
              "I can introduce you to captains hiring no-questions-asked.",
              "I can supply rope, tar, caulking, and spare spars at cost.",
              "I can hide small items inside lumber bundles and keel blocks.",
              "I can stash you in a boat cradle until nightfall.",
              "I can open a side gate to the slips when the watch looks away.",
              "I can issue yard passes that pass a casual glance.",
              "I can lend carpenters for a day to raise or break things quietly.",
              "I can store crates under tarps among the cordage.",
              "I can signal with the yard whistle and flags as prearranged.",
              "I can slip you into the drydock after dark for inspections.",
              "I can rig weighted nets to recover what falls overboard.",
              "I can water-seal your packs with pitch and canvas.",
              "I can lash together pontoons for a temporary crossing.",
              "I can share fresh soundings and tide notes from today.",
              "I can refer you to a sailmaker and rigger who owe me.",
              "I can crate up 'spare parts' that look dull but hide valuables."
            ]
          },
          "Priest": {
            "hooks": [
              "A relic was stolen from our altar in {place}; retrieve it before pilgrims arrive.",
              "Someone forged indulgence letters with our seal; find the counterfeiter.",
              "A would-be prophet gathers a crowd outside the temple; help ensure peace.",
              "Sanctuary has been claimed by a fugitive; investigate their plea before guards storm in.",
              "The bell-rope was cut and the bell seized; track the thieves through {place}.",
              "A sacred spring runs dry; escort me to inspect upstream shrines.",
              "A funeral procession is threatened by rival gangs; keep mourners safe.",
              "Tithes went missing between parishes; the courier never reached {place}.",
              "An orphanage roof collapsed in a storm; secure supplies and labor.",
              "A chronicler disappeared from the scriptorium; their notes accuse a patron.",
              "Someone smeared blood on the chapel door; find whether it’s a warning or a curse.",
              "A zealot calls for a purge; help me protect the innocent.",
              "Our hospice medicines are watered down; expose the supplier.",
              "Ancient catacomb doors opened by themselves; stand watch while I investigate.",
              "A sacred icon weeps resin; crowd control before panic or profiteers.",
              "A festival float was sabotaged; the route through {place} must be secured.",
              "A demonologist offers to debate me; ensure it's not a trap.",
              "The bishop's letters contradict each other; fetch the original archive copy.",
              "A shrine-keeper is extorted by the watch; gather proof.",
              "A traveling reliquary needs escort and discreet lodging."
            ],
            "goals": [
              "To feed every hungry mouth in {place} without judgment.",
              "To rebuild trust between temple and common folk.",
              "To end the sale of blessings and make rites freely given.",
              "To unite rival orders in common service.",
              "To found a shelter and bathhouse near the market.",
              "To train chaplains who serve outside the walls.",
              "To publish clear accounts so tithes are beyond reproach.",
              "To restore the ruined chapel in the old quarter.",
              "To reconcile with the druids and share stewardship.",
              "To establish a hospice that never closes.",
              "To protect sanctuary as a sacred right in {place}.",
              "To teach reading to any child who asks.",
              "To end exploitative vows forced upon the poor.",
              "To compile a book of wise sayings from many faiths.",
              "To root out corruption within temple ranks.",
              "To resolve street conflicts without bloodshed.",
              "To sponsor clean wells and public fountains.",
              "To train successors who are kinder and braver.",
              "To make holy days a joy for all, not a burden.",
              "To step away from power when the work is done."
            ],
            "offers": [
              "I can offer sanctuary within temple walls for a night.",
              "I can arrange a private meeting with the abbot in {place}.",
              "I can bless your journey with a simple rite.",
              "I can introduce you to healers at the hospice.",
              "I can provide alms, food, and clean water.",
              "I can secure discrete lodging among lay brothers and sisters.",
              "I can deliver messages via parish runners across {place}.",
              "I can open the archives for a brief, supervised search.",
              "I can vouch for your character to a magistrate.",
              "I can rally volunteers for a day of heavy work.",
              "I can mediate disputes in neutral chapel rooms.",
              "I can arrange burial or memorial rites quietly.",
              "I can consecrate ground for safe rest.",
              "I can put you on a charity roster for free gate passage.",
              "I can keep valuables in a temple vault for a time.",
              "I can refer you to honest midwives and counselors.",
              "I can circulate a handbill that shifts public opinion.",
              "I can provide simple charms of comfort and courage.",
              "I can speak on your behalf to other temples and shrines.",
              "I can feed rumors to zealots to direct them away from you."
            ]
          },
          "Hunter": {
            "hooks": [
              "A white stag leads hunters to cliffs; track without killing it.",
              "Wolves take livestock near {place}; drive them off without destroying the pack.",
              "A manticore nested in the quarry; we need it relocated or slain.",
              "Poachers are emptying the duke's preserve; set an ambush.",
              "Something drags travelers from the road at dusk; follow the spoor.",
              "A migrating herd blocks the only pass; guide it safely.",
              "A giant boar gored three woodcutters; find its wallow.",
              "Footprints appear and vanish by the river; a shapeshifter? Track carefully.",
              "Gigantic spider webs strand caravans; clear a route and find the nest.",
              "A witch's familiar watches our traps; outwit it without angering its master.",
              "A trophy hunter hired killers to frame me; clear my name.",
              "A wyvern preys on shepherds; mark safe grazing zones.",
              "The old forest is 'moving'; trees shift overnight—survey and report.",
              "A bear awakened early raids stores; relocate it humanely.",
              "Bandits wear beast-cloaks to terrorize hamlets; expose them.",
              "A haunted hunting lodge has returning hoofbeats; watch with me.",
              "A swamp beast bellows near {place}'s causeway; find its lair.",
              "My traps are being sprung by clever hands; a rival sabotages me.",
              "A cursed pelt brings nightmares; trace its origin and unmake it.",
              "A hunter went missing beyond the black fen; bring them back."
            ],
            "goals": [
              "To keep predators and people in balance around {place}.",
              "To end trophy killing and teach respect for quarry.",
              "To map migration routes and protect crossings.",
              "To train a ranger corps drawn from local folk.",
              "To perfect humane traps and release methods.",
              "To break the poaching ring bribing officials.",
              "To track a legendary beast said to be immortal.",
              "To prove monsters follow patterns that can be predicted.",
              "To establish a sanctuary where wounded animals heal.",
              "To replace fear with knowledge through public lessons.",
              "To earn a fair contract as {place}'s game warden.",
              "To rescue children pressed into illegal snaring.",
              "To capture, study, and release rare species responsibly.",
              "To chart safe foraging zones that regrow each season.",
              "To craft guides that any traveler can follow.",
              "To reconcile with druids after an old dispute.",
              "To pass my skills to apprentices from poor families.",
              "To end bounties that cause waste and cruelty.",
              "To restore the lost stag herd to the valley.",
              "To finally sleep without hearing the screams of the hunt."
            ],
            "offers": [
              "I can guide you through wilds faster than the roads.",
              "I can read spoor, scat, and sign to predict danger.",
              "I can set blinds, hides, and lookouts around your camp.",
              "I can supply snares and simple traps, and teach their use.",
              "I can camouflage you and mask your scent for a day.",
              "I can chart water sources and safe crossings near {place}.",
              "I can fetch fresh game and prepare field rations.",
              "I can lead you by deer tracks to avoid patrols.",
              "I can whistle signals that carry through forest without echo.",
              "I can warn you where monsters lair and when they hunt.",
              "I can barter pelts and horns for supplies in {place}.",
              "I can craft decoys that distract beasts or guards.",
              "I can tether alarm lines that reveal stalkers.",
              "I can secure climbing routes up cliffs and trees.",
              "I can share storm and wind lore for the highlands.",
              "I can introduce you to trappers who owe me favors.",
              "I can train your mount to keep calm under roar and fire.",
              "I can mark a trail with signs only we recognize.",
              "I can salvage monster parts that fetch a fair price.",
              "I can teach you how to leave no trace through {place}."
            ]
          },
          "Fisher": {
            "hooks": [
              "Someone slashed my nets at night near {place}; help me catch the culprit.",
              "A red tide closed the harbor; I need safe test samples collected offshore.",
              "The new dam blocked the spawning run; negotiate a fish ladder in {place}.",
              "Something sings from the fog and lures boats onto the shoals.",
              "A sea-beast tears lines and steals catch; drive it from our grounds.",
              "The tax collector doubled wharf fees; uncover who pockets the difference.",
              "A ghost net drifts under the moon and snags every keel; tow and cut it free.",
              "Storm flotsam includes sealed idols; I want them gone without rumor.",
              "A whale is tangled in tarred rope near {place}; help me cut it loose.",
              "Rivals are lifting my crab pots; set a watch and mark their boat.",
              "The lighthouse lantern keeps dimming; someone sabotages the shutters.",
              "False channel markers appeared overnight; reset the buoys before dawn.",
              "A cursed catch whispers names; take it to deep water with me.",
              "Smugglers hide parcels in pots stamped with my mark; clear my name.",
              "River otters raid our live-wells—unless those are nimble thieves.",
              "The river spirit demands tribute for safe passage; find a fair rite.",
              "A child fell through ice at the weir; help search the dark pools.",
              "Invasive lampreys chew our nets; fetch alchemical repellent from {place}.",
              "A legendary golden pike surfaced; bring witnesses and a safe net.",
              "My spouse vanished following a glow on the tide; track that light."
            ],
            "goals": [
              "To own a stout sloop free of debt.",
              "To make our fishery sustainable for our children.",
              "To build a smokehouse and icehouse that serve {place}.",
              "To map safe grounds and share them with the co-op.",
              "To end bycatch with better gear of my own design.",
              "To win a fair market without bribes at the docks.",
              "To train apprentices who respect the sea and river.",
              "To restore salmon to the upper runs above {place}.",
              "To earn a harbor license that can't be revoked by bullies.",
              "To outfit rescue boats that launch in any weather.",
              "To prove moon and current lore beats guesswork.",
              "To replace cruel hooks with kinder tackle where possible.",
              "To found a fishers’ guild that protects small crews.",
              "To add weather vanes and a bell to warn of squalls.",
              "To repay every debt and own my nets outright.",
              "To supply fresh food to the poor of {place}.",
              "To chart a storm-shelter cove no one else knows.",
              "To end the smuggling that stains our trade.",
              "To be remembered for saving lives, not just landing catch.",
              "To leave the boat to my family in good repair."
            ],
            "offers": [
              "I can ferry you quietly by skiff to or from {place}.",
              "I can read tides and winds to time your move.",
              "I can stash a crate in a fish shed that no one checks.",
              "I can introduce you to honest dockhands and pilots.",
              "I can lend nets, lines, hooks, and oilskins at cost.",
              "I can guide you to a hidden cove out of sight.",
              "I can get your gear past cursory dock inspection.",
              "I can signal with lanterns from the jetty as arranged.",
              "I can arrange a berth on a dawn boat with few questions.",
              "I can keep perishables on ice for two days.",
              "I can tow a small craft with my longboat.",
              "I can provide fresh bait that draws river beasts.",
              "I can recommend captains who owe me favors in {place}.",
              "I can show tidal flats safe to cross at low water.",
              "I can hide small parcels among legal catch manifests.",
              "I can teach knots, splices, and quick lashings.",
              "I can set floats as markers to guide you at night.",
              "I can alert you if the watch sweeps the quays.",
              "I can loan tarps and pitch to waterproof your packs.",
              "I can arrange a fish auction distraction at a set hour."
            ]
          },
          "Scout": {
            "hooks": [
              "Bandits shifted camp near {place}; I need eyes on numbers and routes.",
              "A rockslide buried the pass; help me find a new traverse before caravans arrive.",
              "Enemy riders test our borders at dawn; watch with me and chart their paths.",
              "A missing patrol left cairn-signs; follow the trail into the pines.",
              "Someone moved waystones to mislead travelers; reset them and catch the saboteur.",
              "A dragon circles the ridge at noon; I want proof, not panic.",
              "The old ford is deeper than it looks; sound it and mark safe crossings.",
              "A courier vanished between beacons; check the signal towers for tampering.",
              "Poachers lace the preserve with snares; map and lift them without alerting the ring.",
              "A haunted ruin offers the only overlook; hold lanterns while I sketch.",
              "An army camps under camouflage; count fires without being seen.",
              "A marsh road swallows carts; I need to lay corduroy under cover of night.",
              "A rival scout feeds false reports to {place}; expose their handler.",
              "Storms erased our trail marks; help me blaze a fresh, hidden line.",
              "An avalanche threatens the north slope; place warning flags and sounders.",
              "Caravans are ambushed at the same mile; find the lookout's lair.",
              "A bridge was trapped; disarm the charges and set watchers.",
              "A smugglers’ path skirts the watch; decide if we seal it or use it.",
              "Signal mirrors flash from the hills at dusk; catch the code.",
              "I must track a quiet killer whose sign is nearly nothing; be patient and steady."
            ],
            "goals": [
              "To build an early-warning network around {place}.",
              "To train a corps of scouts who value truth over glory.",
              "To map every pass, ford, and goat track in the hills.",
              "To standardize trail signs so allies don't get lost.",
              "To reconcile with rangers and share watch posts.",
              "To perfect silent approach and clean withdrawal.",
              "To end ambushes on the caravan road through {place}.",
              "To publish a field guide that keeps green scouts alive.",
              "To found a beacon chain that works in any weather.",
              "To learn enemy habits so we fight only when needed.",
              "To earn command without forgetting the ground.",
              "To create safe winter routes for isolated hamlets.",
              "To teach foraging and water-finding to common folk.",
              "To track a legendary fugitive no one else could follow.",
              "To broker peace talks by mapping neutral corridors.",
              "To recover a mentor lost beyond the black ridge.",
              "To keep scouts honest when lords demand lies.",
              "To retire with both knees and all my wits intact.",
              "To leave maps and caches that outlast my name.",
              "To make the road to {place} safer for children."
            ],
            "offers": [
              "I can lead you along routes no patrol watches.",
              "I can spot ambush sign and set counter-ambushes.",
              "I can find water, forage, and shelter on lean ground.",
              "I can mark a trail with signs only we will read.",
              "I can place lookouts and relieve them through the night.",
              "I can provide camouflage and teach quiet movement.",
              "I can draw accurate sketches of camps and terrain.",
              "I can rig alarm lines and deadfalls around your camp.",
              "I can time your approach to pass between patrols.",
              "I can introduce you to trustworthy guides near {place}.",
              "I can set decoys and false tracks to shake pursuit.",
              "I can map safe winter paths around drifts and cornices.",
              "I can ferry messages via beacon, whistle, or runner.",
              "I can chart alternate exits before you go in.",
              "I can lay stepping stones through marsh and mire.",
              "I can identify fresh tool marks and recent fires.",
              "I can cloak your campfire to hide smoke at dawn.",
              "I can arrange a dawn extraction from a hard spot.",
              "I can cache food and gear at pre-marked waypoints.",
              "I can keep a watch log that holds up to scrutiny."
            ]
          },
          "Tinker": {
            "hooks": [
              "My walking cart threw a wheel outside {place}; guard me while I fix it.",
              "A clockwork bird I sold is spying on its owner; help me recall it safely.",
              "My prototype stove keeps exploding—escort me to test it far from town.",
              "A rival stole my spring-steel formula; recover the notes from {place}.",
              "An automaton went missing and follows flute music; track the piper.",
              "The mill gears jam on moonless nights; something nests in the teeth.",
              "A noble wants a discreet prosthetic—secure materials and privacy.",
              "Gremlins infest my tool chest; capture one alive for study.",
              "I promised a water pump to the wellhead before dawn—haul and protect it.",
              "Someone counterfeits my maker’s mark; find their shop in {place}.",
              "A bridge winch failed mid-raise; guard me as I unspool the chain.",
              "My gyroscope points at the old ruins; I need witnesses and guards.",
              "A self-playing hurdy-gurdy won't stop; fetch a silence rune from {place}.",
              "I traded for a 'frictionless' oil—it's eating iron; help contain it.",
              "A caravan needs quick axle repairs on the bandit road—cover me.",
              "A windmill shrieks like a banshee; maybe bearings, maybe worse.",
              "A tiny golem I made thinks it's a king; coax it from the sewer throne.",
              "The guild banned my collapsible ladder; test it outside {place}.",
              "Someone swapped my tempered glass with sugar panes; find the saboteur.",
              "I need meteoric iron shavings from the crater beyond {place}."
            ],
            "goals": [
              "To build a workshop in {place} where ideas are welcome.",
              "To patent a safe spring that won't maim apprentices.",
              "To craft cheap, sturdy tools for common folk.",
              "To perfect a water pump for drought seasons.",
              "To design a fold-boat that fits in a handcart.",
              "To prove gremlins are real and teach how to deter them.",
              "To build a clock that keeps perfect time at sea.",
              "To replace cruel traps with humane mechanisms.",
              "To publish plans freely so any village can mend things.",
              "To make a limb that moves as well as the old one.",
              "To invent smokeless stoves for crowded alleys in {place}.",
              "To craft a printing press light enough for the road.",
              "To power mills with wind where rivers fail.",
              "To assemble a traveling repair fair that teaches skills.",
              "To create gear that folds small but works hard.",
              "To map suppliers who trade fairly with small shops.",
              "To train apprentices from families shut out of guilds.",
              "To make devices that help the deaf and the blind.",
              "To stop fires with clever sprinklers on rooftops.",
              "To retire with a bench worn smooth by students."
            ],
            "offers": [
              "I can mend broken gear quickly with rivets and clever pins.",
              "I can craft custom fittings, hinges, and latches at cost.",
              "I can build collapsible ladders and poles for climbs.",
              "I can tune crossbows and improve the draw safely.",
              "I can hide tiny compartments in innocent tools.",
              "I can rig pulleys to lift heavy loads quietly.",
              "I can sharpen blades and true arrow shafts.",
              "I can make spring-snares and harmless trip alarms.",
              "I can repair clockworks and read simple mechanisms.",
              "I can waterproof packs with waxed cloth I carry.",
              "I can lend unusual tools: gimlets, calipers, thread dies.",
              "I can blueprint a route of anchor points and tie-offs.",
              "I can solder wires and mend cracked lamps.",
              "I can stitch leather gear and replace torn straps.",
              "I can improvise bridges from poles and rope fast.",
              "I can disguise gadgets as common household items.",
              "I can draft clear diagrams for others to follow.",
              "I can barter repairs for information around {place}.",
              "I can leave maintenance kits at prearranged caches.",
              "I can teach you field fixes that last longer than luck."
            ]
          },
          "Smuggler": {
            "hooks": [
              "Gate duties tripled overnight in {place}; find who forged the decree.",
              "A new patrol dogs the river at dusk; I need fresh timings scouted.",
              "A rival uses my mark to move poison; clear my name before a sweep.",
              "Hidden caches along the cliff road were emptied; locate the mole.",
              "A lighthouse keeper switched signals; decode the new pattern.",
              "A buyer insists on meeting in the catacombs; I want eyes on exits.",
              "A customs hound tracks by scent through rain; help me change the trail.",
              "A corrupt inspector wants my ledger; we need a decoy that passes.",
              "The ferry master doubled prices; negotiate or find a back channel.",
              "A bridge watch found my ropeway; help me cut it down unseen.",
              "A new ward marks contraband crates; obtain a countermark in {place}.",
              "A crew member vanished with route notes; recover them quietly.",
              "An anonymous tip points to my boathouse; clear anything risky now.",
              "A client demands live cargo—absolutely not; help me set boundaries.",
              "Rumors say the marsh lights are signals; confirm and chart them.",
              "An ambush waits at the goat path; flip it or find a safer pass.",
              "A noble wants a painting 'relocated' for a night; zero damage, zero panic.",
              "A rival bribes the night watch; gather proof for a quiet trade.",
              "A sandbar exposed one of my tunnels; collapse or repurpose it.",
              "A warehouse fire threatens my false wall; help me salvage and mask."
            ],
            "goals": [
              "To move only what harms no one and feed my crew.",
              "To buy a legitimate warehouse in {place} and go clean.",
              "To map routes that avoid villages and patrols responsibly.",
              "To end bribes by proving the inspectors take them.",
              "To retire every debt to those who covered me.",
              "To ferry refugees safely when gates close unjustly.",
              "To build a courier chain that protects messengers.",
              "To shift from contraband to discreet logistics.",
              "To expose traffickers who hide under our shadow.",
              "To publish a code that forbids cruel cargo forever.",
              "To replace risky runs with smart paperwork.",
              "To maintain a foghorn of favors, not fear.",
              "To buy my boat outright and rename her honest.",
              "To ensure no one dies for a purse of coin again.",
              "To prove I can outthink any blockade without blood.",
              "To turn rivals into partners with fair shares.",
              "To give street kids jobs that don't break them.",
              "To stash enough to vanish if I must—without burning bridges.",
              "To become a legitimate transporter with trusted routes.",
              "To sleep without listening for boots at the door."
            ],
            "offers": [
              "I can move small parcels through {place} without questions.",
              "I can arrange night passage by skiff beneath the quay.",
              "I can secure clean papers that pass the first glance.",
              "I can introduce you to a discreet moneychanger.",
              "I can time the gate—two bells when inspections slacken.",
              "I can hide items in false-bottom crates and casks.",
              "I can route you along patrol gaps and blind corners.",
              "I can stash gear in a boathouse locker for a week.",
              "I can borrow a warehouse key for one quiet hour.",
              "I can set lantern codes to guide you through fog.",
              "I can pass messages via dock chalk and rope knots.",
              "I can book you as 'porters' to dodge awkward questions.",
              "I can get you aboard a barge that no one searches.",
              "I can tip you before a sweep hits the markets.",
              "I can line a pack with foil to foil scent hounds briefly.",
              "I can obtain a wagon with a removable false axle.",
              "I can call in a favor from a harbor pilot once.",
              "I can arrange decoy cargo that draws the watch away.",
              "I can provide drab clothes and dock slang to blend in.",
              "I can make sure your arrival looks like you were always there."
            ]
          },
          "Druid": {
            "hooks": [
              "Loggers cut into the sacred grove near {place}; help me halt the axes without bloodshed.",
              "The river through {place} runs sour after midnight; trace the upstream poison.",
              "A crown fire races toward the hamlets; help me set safe firebreaks tonight.",
              "Iron jaw-traps maim beasts in the north wood; find the poachers’ camp.",
              "The fey court swapped two seasons; we must bargain to set them right.",
              "A wasting sickness spreads in the deer herd; I need samples from three ranges.",
              "The old stone circle was toppled; stand guard while we raise the menhirs.",
              "A werebear is blamed for killings; track the true culprit before a mob forms.",
              "A creeping mire swallows fences near {place}; map the sinkholes and seal them.",
              "Migrating birds fall from a clear sky; discover what hunts above the clouds.",
              "The eldest oak uprooted itself and lumbers toward {place}; turn it back gently.",
              "Moonwell waters taste of lye; an alchemist’s waste is leaching in—prove it.",
              "Hill giants overhunt the ridge; negotiate a lawful limit before famine hits.",
              "Salt-wind blight scalds the orchards; fetch reagents and keep watch while I brew.",
              "The wolf-queen’s mind is cursed; hold the pack at bay while I attempt a rite.",
              "Coral beds near {place} bleach and die; escort me to plant live stone.",
              "A new mine bleeds sour water; compel the foreman to dam and cleanse the runoff.",
              "An earth crack vents choking gas; keep watch while I bind the rift with roots.",
              "Thorn sprites steal tools and children’s toys; parley without starting a war.",
              "A fallen star warped the glade; gather shards while I calm the wild magic."
            ],
            "goals": [
              "To keep balance between folk, field, and forest around {place}.",
              "To reconcile our circle with the temple and the city wardens.",
              "To store seeds and spores against lean years to come.",
              "To end cruel iron-trap hunting within our bounds.",
              "To rewet the marsh and bring back beaver to heal the streams.",
              "To plant shelterbelts that break the killing winds.",
              "To map ley lines and bless crossings near {place}.",
              "To teach commoners simple stewardship any can keep.",
              "To protect migration corridors through farms and roads.",
              "To heal the Heart-Tree whose roots bind this valley.",
              "To forge a binding with the river spirit for fair water.",
              "To raise waystations where healers can rest and tend beasts.",
              "To stop bribe-fatled logging masked as 'emergency clearing'.",
              "To make villages fire-wise with safe burns and stone wells.",
              "To guard the last breeding pair of a sacred creature.",
              "To choose and train a successor kinder than I am.",
              "To weave gardens on rooftops across {place}.",
              "To turn monsters aside without needless killing.",
              "To lift a land-curse laid in the war before our time.",
              "To be buried under an oak that feeds a living grove."
            ],
            "offers": [
              "I can guide you through wilds leaving scarcely a footprint.",
              "I can name what’s safe to eat and what heals or harms near {place}.",
              "I can ask beasts to scout a path or carry a warning.",
              "I can soothe frightened animals so they don’t stampede.",
              "I can find sweet water and mark springs for you.",
              "I can read wind and cloud to warn of weather coming.",
              "I can mask your scent from common predators for a day.",
              "I can bless a campsite so night things pass you by.",
              "I can brew simple salves from local herbs at cost.",
              "I can quicken seeds in a trench to screen your trail.",
              "I can cleanse a small pool fouled by travel or neglect.",
              "I can call birds to watch the road and cry out at foes.",
              "I can teach courtesies the fey accept around {place}.",
              "I can daub you in clays and greens to fade into brush.",
              "I can cut discreet blazes that only we will notice.",
              "I can introduce you to rangers, hermits, and beekeepers.",
              "I can offer neutral ground in a warded grove for parleys.",
              "I can ease petty hexes and gnawing bad dreams.",
              "I can lay remains to rest with proper earth rites.",
              "I can share a map of game trails and safe fords."
            ]
          },
          "Monk": {
            "hooks": [
              "Bandits demand 'tithe' at our monastery gate near {place}; help me end it without blood.",
              "A sacred sutra was returned with forged pages; find the thief within the city.",
              "The tourney master rigs bouts to shame our school; guard the ring and the rules.",
              "A reliquary must be carried on foot to {place}; escort us through hostile quarters.",
              "The rope bridge we maintain snapped; cover me while I rebuild under fire from raiders.",
              "My master left to meditate and never returned; help search the mountain paths.",
              "Novices are blackmailed by a gang; free them without staining their vows.",
              "Our bronze bell vanished at night; track the thieves before it’s melted.",
              "A rival monastery demands a duel of champions; mediate terms or stand with me.",
              "A supply caravan was hijacked on the pilgrim road; recover it with restraint.",
              "A temple statue animates at dusk; restrain it while I lift a curse harmlessly.",
              "A moneylender holds the deed to our soup hall; find lawful grounds to void it.",
              "A stone vault opens only with a kata; keep watch while I decipher it.",
              "Our orphan shelter faces eviction; gather witnesses and the true ledger in {place}.",
              "Pilgrims are ambushed on the ridge path; set watches and guide them safely.",
              "Smugglers wear monk robes to pass gates; clear our name and expose the ring.",
              "Our brewing water is tainted upstream; escort me to test wells and parchments.",
              "Thieves discovered a tunnel beneath our cloister; seal it without collapsing the nave.",
              "Quakes crack the meditation hall; brace the beams while I direct novices.",
              "Whispers say the abbot is possessed; investigate with compassion and proof."
            ],
            "goals": [
              "To perfect a form that harms none who yield.",
              "To teach discipline and mercy to anyone who knocks.",
              "To stand between the strong and the weak in {place}.",
              "To train novices who surpass the masters kindly.",
              "To rebuild our hall and open it to all travelers.",
              "To end a petty feud between neighboring schools.",
              "To write a plain manual of balance and breath.",
              "To feed the hungry daily from our kitchens.",
              "To form night patrols that resolve fights without blades.",
              "To walk a year of roads in humble pilgrimage.",
              "To cool the hot heads of guilds before they riot.",
              "To convince magistrates that compassion is strength.",
              "To raise a bell tower whose sound calms a crowd.",
              "To recover a missing master and welcome them home.",
              "To found wayhouses where the weary sleep in safety.",
              "To sit a hundred days without anger rising once.",
              "To restore honor after a shameful youthful brawl.",
              "To forgive an enemy and make them a friend.",
              "To open a women’s hall with equal teaching.",
              "To retire as a gardener who still listens."
            ],
            "offers": [
              "I can teach breath and stance that steady the heart.",
              "I can serve as an unarmed escort who avoids killing.",
              "I can disarm and bind without lasting harm when needed.",
              "I can climb quietly and cross rooftops without commotion.",
              "I can run messages swiftly across {place} on foot.",
              "I can take night watch alone while others sleep.",
              "I can lodge you in a guest cell with simple fare.",
              "I can introduce you to a fair-minded magistrate.",
              "I can sit both sides at a table and broker a truce.",
              "I can carry burdens and rebuild what fighting broke.",
              "I can lash beams, repair ropes, and set safe footings.",
              "I can ease pain with acupressure and steady hands.",
              "I can drill you in staff and open-hand basics.",
              "I can slip through crowds unseen and report clearly.",
              "I can keep silence for days as cover for you.",
              "I can outfit you as pilgrims to cross checkpoints.",
              "I can offer tea, bread, and honest counsel.",
              "I can safeguard a relic or letter in our reliquary.",
              "I can teach hand signals used by our order.",
              "I can keep a truthful log and vouch for your conduct."
            ]
          },
          "Gladiator": {
            "hooks": [
              "My bout in {place} is fixed; help me expose the pit boss without getting knifed.",
              "Someone poisoned my liniment; I need a clean salve before tonight’s match.",
              "A rival’s blade was filed to a razor; swap it for regulation steel mid-bout.",
              "The beast pens were sprung; help me herd a manticore back alive.",
              "A noble wants me to throw the final; find leverage so I can refuse safely.",
              "My training partner vanished after meeting a bookie; track the debt collectors.",
              "Arena sand hides traps; map them before I face a crowd favorite.",
              "A masked fighter uses illegal hexes; get proof that stands in {place}’s court.",
              "The armory master sells my best gear out the back; catch him red-handed.",
              "A riot is brewing after an unfair decision; help me calm the crowd.",
              "An old injury flares; escort me to a healer who won’t alert my rivals.",
              "The promoter replaced my shield with a brittle twin; switch it before the gong.",
              "A new champion wants a blood duel; negotiate rules to make it nonlethal.",
              "My slave contract was ‘extended’; find the original terms in {place}’s registry.",
              "A beastmaster demands I fight unarmored; uncover why he hates me.",
              "My victory laurel was stolen; the thief plans to sell it to a collector.",
              "Rumors say I killed in the street; prove the corpse was a staged fake.",
              "A troupe of stage fighters plans a con in my name; stop the impostors.",
              "Tomorrow’s exhibition features live ballistae; sabotage the worst dangers.",
              "A scribe claims my lineage isn’t freeborn; retrieve my mother’s papers."
            ],
            "goals": [
              "To win my freedom and end contract bondage in {place}.",
              "To defeat the arena champion in a fair match.",
              "To found a school that teaches restraint before glory.",
              "To prove skill can thrill a crowd without blood.",
              "To retire with my chosen family safe and housed.",
              "To expose the match-fixing syndicate that runs the pits.",
              "To earn a royal laurel by right, not patronage.",
              "To track down a sibling sold to a distant arena.",
              "To master every style: sword, spear, net, and empty hand.",
              "To broker safer rules for beasts and fighters alike.",
              "To turn the games into festivals for charity.",
              "To replace lethal duels with judged contests.",
              "To make the poor of {place} proud when I fight.",
              "To sponsor apprentices who came from the streets.",
              "To reconcile with a rival I wronged years ago.",
              "To become an envoy who settles feuds without blades.",
              "To write a handbook of forms any guard can learn.",
              "To end bookies’ hold over young fighters.",
              "To carry the torch once, then set it down with honor.",
              "To be remembered as a protector, not a killer."
            ],
            "offers": [
              "I can train you in practical unarmed and shield work.",
              "I can stage a convincing ‘brawl’ to cover your exit.",
              "I can get you backstage passes to the arena in {place}.",
              "I can introduce you to honest trainers and cutmen.",
              "I can rally fighters as muscle for a lawful cause.",
              "I can spar to test your gear and stance safely.",
              "I can draw a crowd where you need a distraction.",
              "I can vouch for you with the arena quartermaster.",
              "I can arrange a private ring for discreet meetings.",
              "I can move heavy obstacles with crew and tackle.",
              "I can teach crowd signals used by marshals and refs.",
              "I can provide padded practice weapons and helms.",
              "I can act as a bodyguard who avoids killing.",
              "I can introduce you to promoters who owe me favors.",
              "I can smuggle a note or item inside a trophy garland.",
              "I can coach you to pass as a fighter for a day.",
              "I can secure infirmary access for treatment after hours.",
              "I can hush a section of the crowd with a practiced salute.",
              "I can arrange a charity exhibition as public cover.",
              "I can call in a favor from a famed champion—once."
            ]
          },
          "Sailmaker": {
            "hooks": [
              "Someone slashed three new mainsails in my loft at {place}; help catch the saboteur.",
              "A storm trysail tore along the seam; I need escort to test a stronger cut offshore.",
              "My bolt of spider-silk canvas vanished; track the thief through the dye houses.",
              "A rival stole my lateen pattern book; recover it before the regatta.",
              "The harbor banned black-dyed sails; find the clause and the official behind it.",
              "A cursed needle pricks anyone who lies; it’s missing from my bench—discreetly find it.",
              "Rot crept through a batch of flax; trace the bad oil press in {place}.",
              "Smugglers want hidden pockets stitched into a jib; I need witnesses to refuse.",
              "A new square-topsail rig needs batten slats; fetch straight heartwood from upriver.",
              "A visiting captain demands a kite-sail test; guard me while I trial it at dusk.",
              "Someone swaps my beeswax with tallow; catch them before we waterproof the lot.",
              "The loft cat is missing; traps show giant rats in the rope bins—clear them out.",
              "A customs man claims my cloth weights are false; prove the balance is rigged.",
              "Sea-worms chewed bolt-ropes stored on a damp sill; salvage what we can.",
              "A lightning strike scorched a sail bundle; I need safe storage space fast.",
              "A theater wants flying rigs on stage by morning; help cut and lash without accidents.",
              "An old mariner offers a ‘wind-seeking vane’; test it without wrecking a mast.",
              "A royal commission demands ceremonial pennants; protect the courier run.",
              "A firebrand agitates dockers to smash the loft; find who’s paying him.",
              "A gull-roost fouls finished cloth; rig a humane deterrent on the roof."
            ],
            "goals": [
              "To build the best loft on the coast at {place}.",
              "To train apprentices paid fairly for their stitches.",
              "To perfect storm sails that save crews and masts.",
              "To chart standard patterns any rigger can trust.",
              "To replace cruel tar with kinder proofing that lasts.",
              "To dye with plants that don’t poison the harbor.",
              "To design quiet sails that don’t flap and reveal you.",
              "To win the regatta on workmanship, not bribes.",
              "To craft ceremonial banners that uplift the docks.",
              "To make repair kits every boat can afford.",
              "To source flax from farmers at honest prices.",
              "To publish patterns free for lifeboats and ferries.",
              "To pair with shipwrights so rigs and hulls fit perfectly.",
              "To invent a reefing system one child can haul.",
              "To equip rescue crews with bright signal flags.",
              "To end the guild’s gatekeeping over simple skills.",
              "To keep my crew in steady work through winter.",
              "To create awnings and windbreaks for the poor of {place}.",
              "To be known for sails that carry mercy as well as trade.",
              "To leave the loft to a successor who loves the craft."
            ],
            "offers": [
              "I can patch rips fast and true before you sail.",
              "I can cut a storm trysail tailored to your rig.",
              "I can proof canvas to shed rain and sparks.",
              "I can sew hidden pockets—if that’s wise and legal.",
              "I can splice bolt-ropes and seize rings properly.",
              "I can lend spare canvas for tents and field shelters.",
              "I can mark signal flags and simple code pennants.",
              "I can stitch stealthy luffs that quiet the flapping.",
              "I can dye cloth to match night, fog, or dunes.",
              "I can introduce you to riggers who won’t cheat you.",
              "I can measure your mast and boom without yard fees.",
              "I can stash small items inside rolled sails safely.",
              "I can repair hammocks and sling fresh ones at cost.",
              "I can lend heavy needles, palms, and waxed twine.",
              "I can rig a sun-shade or windbreak at your camp.",
              "I can reinforce climbing seams for boarding actions.",
              "I can letter a banner that opens doors in {place}.",
              "I can wrap fragile cargo in canvas that resists damp.",
              "I can set a lantern code seen clear from the loft.",
              "I can vouch for you with the dock guild—once."
            ]
          },
          "Stablemaster": {
            "hooks": [
              "Someone is cutting girths in my yard at {place}; help me catch the saboteur.",
              "A prize mare vanished before dawn; track the thieves fast.",
              "A courier's gelding returned riderless and bloody; find the route he took.",
              "My hayloft nearly caught fire; I suspect arson over a debt.",
              "A stallion goes berserk at moonrise; guard while the farrier examines him.",
              "Feed stores are fouled with bitter dust; identify and stop the culprit.",
              "Shoes are being swapped for brittle iron; follow the black-market farrier.",
              "Bandits are renting mounts under false names; help me test papers at the gate.",
              "Strange hoofprints circle the paddock each night; follow them beyond {place}.",
              "A noble blames me for a thrown shoe during a hunt; prove sabotage.",
              "Foaling has begun early; fetch the healer and keep the yard quiet.",
              "Rats gnaw the grain bins; set traps before disease spreads.",
              "A sick cough spreads from stalls to handlers; escort me to secure clean water.",
              "Smugglers used my coach house as a drop; clear my name with the watch.",
              "A racing syndicate wants my best gelding 'softened'; stop them.",
              "Thugs demand 'protection' from my ostlers; gather proof for the captain in {place}.",
              "A wagon overturned at the slope; recover tack and guard the salvage.",
              "Someone swapped my saddles for lookalikes with hidden blades; find them.",
              "Ghostly bells jingle in the empty lane at night; stand watch with me.",
              "A new farrier undercuts prices with bad nails; expose the danger before a tragedy."
            ],
            "goals": [
              "To run the safest and cleanest livery in {place}.",
              "To breed a hardy line fit for couriers and patrols.",
              "To pay my ostlers fair wages and keep them housed.",
              "To build a covered coach house for foul-weather work.",
              "To end cruel bits and spurs in common use.",
              "To fit a pump and cistern so no beast drinks foul water.",
              "To earn the city contract for messenger remounts.",
              "To open way-stations every ten miles from {place}.",
              "To train apprentices into honest farriers.",
              "To turn the manure heap into gardens that feed the poor.",
              "To replace straw thatched roofs with safe tiles.",
              "To keep a sanctuary for broken warhorses.",
              "To standardize tack so borrowing never harms beasts.",
              "To map safe night routes for coaches and post.",
              "To add a forge on-site for emergency shoes.",
              "To end bribes to inspectors who prey on stables.",
              "To breed sure-footed ponies for mountain trails.",
              "To host a fair that showcases humane training.",
              "To insure every wagon and mount against loss.",
              "To retire with the yard thriving in kinder hands."
            ],
            "offers": [
              "I can stable your mounts and keep them fed and groomed.",
              "I can provide fresh remounts for a hard ride out of {place}.",
              "I can loan a stout wagon, harness, and driver.",
              "I can arrange discreet entry by the back lane after curfew.",
              "I can introduce you to a trustworthy farrier and wheelwright.",
              "I can hide you in a hay cart to slip past the gate.",
              "I can repair tack, reins, and saddles overnight.",
              "I can mark a fast relay route with water stops.",
              "I can supply nosebags, blankets, and spare shoes at cost.",
              "I can post a stableboy as a runner to carry messages.",
              "I can stall a pursuer's mount with a 'lost shoe' story.",
              "I can keep a crate under lock in the harness room.",
              "I can arrange a coach under a false hire name.",
              "I can teach you how to handle skittish mounts quietly.",
              "I can swap your livery colors to avoid notice in {place}.",
              "I can whistle up teamsters who owe me favors.",
              "I can provide straw bale screens to block prying eyes.",
              "I can time your departure between patrol rounds.",
              "I can kennel hounds and fit them with travel muzzles.",
              "I can vouch for you with the gate sergeant at dawn."
            ]
          },
          "Chandler": {
            "hooks": [
              "My candle molds were stolen the night before festival; help me recover them in {place}.",
              "Someone waters my lamp oil; find the adulterator before lanterns fail.",
              "A batch of beeswax is tainted with soot that chokes; trace the source.",
              "Temple orders vanished en route to {place}; follow the scent of resin and wicks.",
              "A rival stamps my seal on crumbly tallow; expose their shop.",
              "Lantern-lighters are ambushed on the quay; escort the rounds tonight.",
              "A blue flame haunts my workshop at dusk; watch while I test for gas leaks.",
              "Scented tapers made a noble ill; identify the allergen and the saboteur.",
              "A shipment of wicks burns too fast; the spinner swapped fibers—prove it.",
              "A warehouse blaze started in my oil casks; find the arsonist before I'm ruined.",
              "Festival sky-lanterns were cut with brittle frames; we need safe replacements.",
              "A guild inspector demands bribes; help me collect honest weights and measures.",
              "Someone hides messages in sealing wax; catch the courier at {place}'s gate.",
              "Glow-fungus contaminated my store; secure samples while I clean it out.",
              "Street lamps go dark in one ward only; map the pattern and the culprit.",
              "A 'miracle' smokeless taper appears—counterfeit and dangerous; seize a sample.",
              "A barge of oil overturned; contain the spill before it reaches the wells.",
              "A watch captain blames me for blacked-out alleys; prove his men are selling oil.",
              "A noble demands invisible-ink candles; vet the request and its risks.",
              "My bees are being robbed at night; track the thieves to their buyer."
            ],
            "goals": [
              "To light every street in {place} safely and fairly.",
              "To perfect smokeless, low-soot candles for sickrooms.",
              "To switch from foul tallow to clean oils and wax.",
              "To found a lamplighters' guild that serves the poor.",
              "To keep honest scales and end short measures.",
              "To plant bee gardens so wax comes without cruelty.",
              "To teach safe storage so fires no longer start at shops.",
              "To craft storm lanterns that never blow out.",
              "To supply lighthouses with steady fuel and wicks.",
              "To make festival lights that bring joy, not hazard.",
              "To publish formulas anyone can make without poison.",
              "To replace whale oils with plant and seed oils.",
              "To standardize wick sizes across {place}’s lamps.",
              "To stock emergency lamps in every ward house.",
              "To train apprentices from families the guild ignores.",
              "To offer free night-lights for alleys where crime thrives.",
              "To invent seal-wax that proves tampering at a glance.",
              "To pair with glassblowers for safer chimneys and globes.",
              "To win a city charter that protects honest chandlers.",
              "To leave the shop to a successor who keeps it bright."
            ],
            "offers": [
              "I can supply lanterns, candles, wicks, and clean oil at cost.",
              "I can proof your travel lanterns against wind and rain.",
              "I can provide sealing wax and stamps, or copy a seal you own.",
              "I can craft scent-masking tapers for stealth in {place}.",
              "I can rig shuttered dark-lanterns for discreet signals.",
              "I can lend glass chimneys and spare mantles for a night.",
              "I can store a parcel in an oil crate no one will sniff.",
              "I can mark a lamp code in windows to guide you home.",
              "I can outfit a patrol with hand-lamps and spare fuel.",
              "I can arrange night deliveries that avoid watch attention.",
              "I can provide festival lanterns as a cover for your gathering.",
              "I can donate street oil to win goodwill in a rough ward.",
              "I can blend glow-paint for map marks that show at dusk.",
              "I can teach safe wick trimming to cut smoke indoors.",
              "I can issue clean-burning oil chits redeemable in {place}.",
              "I can craft long-burn tapers timed for your op.",
              "I can repair lamp hooks and brackets along your route.",
              "I can hide micro-messages inside candle cores.",
              "I can summon lamplighters to snuff or blaze a signal.",
              "I can vouch for you with the guild to rent equipment."
            ]
          },
          "Glassblower": {
            "hooks": [
              "My furnace bricks cracked during last night’s burn in {place}; guard the repair crew.",
              "A shipment of pure sand was diverted; track the wagon before it hits the black market.",
              "Colored cullet I use for temple windows was swapped with slag; find the saboteur.",
              "A noble wants mirror glass cut to a secret passage; judge the risks and escort me.",
              "The guild inspector accused me of thin-walling bottles; help weigh the proof.",
              "Bandits target my delivery of apothecary vials to {place}; ride shotgun.",
              "My best blower vanished after boasting of a new recipe; follow their ash prints.",
              "A stained-glass panel we installed weeps resinous tears; investigate the chapel.",
              "An alchemist’s acid ate through my ‘resistant’ flasks; test a safer formula off-site.",
              "A rival stamps my maker’s mark on shoddy goblets; expose their furnace in {place}.",
              "The annealing lehr jammed; I need tools fetched and watch kept on the yard.",
              "A sand sprite haunts the melt; bargain with it before it ruins another batch.",
              "Lens blanks for the scholar cracked on cooling; check the cooling tunnels for drafts.",
              "The glass-cutter’s diamond was stolen; chase the pawnbroker trail through {place}.",
              "A broker wants black glass masks for a midnight rite; vet the commission carefully.",
              "My bell jars trap tiny lights that whisper; escort me to test them at the marsh.",
              "A crate of chandeliers for the theater arrived in shards; find where the break occurred.",
              "A kiln boy coughs glass dust; secure proper masks while I face the guild.",
              "A mirror shows a room that isn’t mine; stand watch while we cover it in silver.",
              "I need obsidian from a cursed hill to mix into shock-proof glass; guide me there."
            ],
            "goals": [
              "To perfect crystal so clear it vanishes against sky.",
              "To found a safe, well-ventilated glasshouse in {place}.",
              "To master true red and deep cobalt without poison.",
              "To make reading lenses cheap enough for every shop.",
              "To glaze windows in poor wards before winter comes.",
              "To craft alchemists’ ware that shrugs off most acids.",
              "To cast flawless mirrors for observatories near {place}.",
              "To teach apprentices proper annealing and avoid injuries.",
              "To standardize bottle sizes so merchants stop cheating.",
              "To build a lehr that uses half the fuel with baffled flues.",
              "To design lantern globes that never soot nor shatter easily.",
              "To supply stained glass that tells true histories of {place}.",
              "To blow harmonicas and bells whose tones calm crowds.",
              "To revive lost canework patterns from an old master’s book.",
              "To craft prisms that split moonlight for navigation.",
              "To stop guild bullies from taxing safety gear as ‘luxury’.",
              "To recycle cullet citywide and end glass in the gutters.",
              "To cast panes wide enough for a greenhouse in {place}.",
              "To produce dark goggles that save smiths’ eyes.",
              "To leave the furnace to a successor who loves the craft."
            ],
            "offers": [
              "I can provide bottles, vials, and jars sized to your kit at cost.",
              "I can cut glass quietly to fit a window you specify in {place}.",
              "I can silver a mirror or dull one to hide reflections.",
              "I can grind simple lenses for scopes, spectacles, or signals.",
              "I can loan padded crates to move fragile cargo unseen.",
              "I can hide notes inside double-walled flasks or goblets.",
              "I can make dark lantern globes for covert signals.",
              "I can craft bullseye lenses that throw a tight beam.",
              "I can supply glass marbles that mark trails by moonlight.",
              "I can repair a cracked pane overnight if you bring shards.",
              "I can emboss a false crest—or erase one you own—cleanly.",
              "I can provide sand and fine cullet to cover tracks on stone.",
              "I can temper thin panes that resist a thrown rock once.",
              "I can cast seal-wax stamps in glass that won’t heat-stick.",
              "I can etch warning runes or marks only seen when fogged.",
              "I can furnish glass syringes for clean, precise dosing.",
              "I can blow bell jars to protect relics or evidence.",
              "I can craft oil lamp chimneys that resist gusts at sea.",
              "I can lend cutting wheels, nippers, and glazing putty.",
              "I can vouch for you with the artisans’ quarter in {place}."
            ]
          },
          "Carpenter": {
            "hooks": [
              "A scaffolding collapse at the guildhall in {place}; I need a guarded inspection.",
              "Termites ate through storeroom beams; fetch treatment and keep watch tonight.",
              "Someone swapped our seasoned timbers with green wood; find the mill that cheated us.",
              "A new footbridge was sabotaged; help me reset trestles before the flood.",
              "The reeve claims my measurements are false; I need witnesses while I re-mark the lot.",
              "A theater wants a trapdoor by dawn; protect the crew while we rig it safely.",
              "My sawyers were jumped on the road; recover the blades and carts.",
              "A fire gutted three row houses; escort me to shore walls before they fall.",
              "A noble wants a hidden compartment in a cradle—decide if we refuse and why.",
              "A bell tower sways in wind; guard me while I climb to tighten the braces.",
              "A rival filed my plane irons blunt; catch them in the yard at {place}.",
              "The barge ramp snapped under weight; salvage and re-laminate planks.",
              "Strange chalk marks on doorframes map a burglary route; help me scrub or bait it.",
              "A traveling fair needs sturdy stalls fast; keep pickpockets off my tool chest.",
              "City inspectors demand bribes to sign off beams; gather proof quietly.",
              "A mill dam warped our lumber stack; we must re-season under guard.",
              "A warehouse floor booms hollow; I fear a sinkhole—survey with me.",
              "A logging contract threatens a sacred grove; negotiate alternatives.",
              "A storm tore roofs across {place}; organize crews and keep looters out.",
              "A coffin lid returned with scratch marks inside; I need a truth we can bear."
            ],
            "goals": [
              "To build sound homes for families priced out in {place}.",
              "To teach apprentices fair wages and true measure.",
              "To standardize joinery that resists rot and fire.",
              "To replace crooked inspectors with honest practices.",
              "To erect bridges that hold carts and crowds safely.",
              "To use reclaimed wood so forests breathe again.",
              "To found a public works shed that lends tools free.",
              "To craft siege ladders and mantlets that save lives.",
              "To map roof paths for fire brigades and mark hydrants.",
              "To design folding bunks for refugee shelters.",
              "To build a hall where workers meet without fear.",
              "To publish a pattern book any village can follow.",
              "To end child labor in the back-alley workshops.",
              "To master timber framing that laughs at earthquakes.",
              "To fit rain gutters and cisterns house by house.",
              "To craft cabinetry that hides nothing but joy.",
              "To reinforce schools and clinics first in {place}.",
              "To earn a guild charter without bending the knee.",
              "To restore an old hall and give it to the community.",
              "To retire with callused hands and a light heart."
            ],
            "offers": [
              "I can raise a sturdy barricade in minutes with scrap and spikes.",
              "I can lend ladders, scaffolds, and staging planks at cost.",
              "I can fit secret compartments—if you accept the risks.",
              "I can reinforce doors and window bars discreetly.",
              "I can lay trap floors that creak only where you choose.",
              "I can blueprint a building and note every weak point.",
              "I can provide tarps, ropes, pegs, and timber quickly.",
              "I can disguise an entrance behind shelving or wainscot.",
              "I can build portable screens to hide your meeting.",
              "I can repair wheels, axles, and wagon beds overnight.",
              "I can set roof anchors and lines for safe climbs.",
              "I can install shutters that drop with one pull as cover.",
              "I can craft collapsible furniture for fast setups.",
              "I can supply sawdust to mask blood or tracks on stone.",
              "I can teach knots, lashings, and safe load handling.",
              "I can mark a map with safe beams and rotten ones in {place}.",
              "I can secure a workyard where no one asks questions.",
              "I can stash a parcel in a lumber pile no guard will search.",
              "I can cut signboards or crests to open certain doors.",
              "I can vouch for you with the builders’ guild clerk."
            ]
          },
          "Mason": {
            "hooks": [
              "An arch over the market road in {place} has cracked; guard me while I inspect it.",
              "Our quarry face sloughed off at dawn; help rescue trapped cutters.",
              "Someone adulterates mortar with river sand; catch the saboteur before a wall fails.",
              "Ceilings in the old catacombs are sagging; stand watch while I shore them.",
              "The bridge pier is scoured by floods; we must set cofferdams under fire from thieves.",
              "A noble wants a hidden passage behind ashlar; weigh the risks and witnesses.",
              "A gargoyle fell from the chapel; rival crews may have tampered with the anchors.",
              "Counterfeit mason’s marks appear on shoddy work; expose the fraud in {place}.",
              "Lime kilns vent choking fumes into the ward; escort me to test drafts safely.",
              "Smugglers cut a crawlspace through a foundation I laid; help me seal it cleanly.",
              "A sinkhole opens under the plaza at dusk; rope, cribbing, and order are needed.",
              "Aftershocks cracked three rowhouses; I need hands to brace them before night.",
              "The keystone for the north gate was stolen; track the thieves before inspection.",
              "A corner-stone at the new hall grows warm at night; I suspect a curse—come armed.",
              "Quarry spirits rage after blasting; we must bring offerings and set new wedges.",
              "Temple steps are subsiding; redirect the drain that undermines them.",
              "Someone shaved our measuring rods; verify spans and catch the cheat.",
              "The city demands the wall breach be closed before dawn; protect the crew.",
              "We found a breathing void behind an ashlar face; watch my back while I open it.",
              "My ledger of loads and payments vanished; recover proof before the guild hearing."
            ],
            "goals": [
              "To raise a stone bridge that stands a century.",
              "To build safe homes ordinary folk can afford in {place}.",
              "To make true measures standard so no inspector can cheat.",
              "To train apprentices who prize safety over speed.",
              "To end bribes and kickbacks among city surveyors.",
              "To vault a hall that resists shakes and fire.",
              "To restore the old aqueduct that once served {place}.",
              "To form a quarry cooperative that shares fair profit.",
              "To quarry without scarring sacred hills or poisoning streams.",
              "To build a stone archive so records outlive fires.",
              "To map bedrock, faults, and old tunnels beneath {place}.",
              "To raise a memorial to workers lost on the job.",
              "To design walls with humane sally doors and alarms.",
              "To lay storm drains that keep streets passable in floods.",
              "To rebuild war-ruined blocks stronger than before.",
              "To stop mortar adulteration by guild decree.",
              "To erect a public bathhouse of clean stone.",
              "To restore a ruined keep for common use, not tyranny.",
              "To open the guild to women and outsiders on merit.",
              "To retire as a teacher of stone-lore and safe practice."
            ],
            "offers": [
              "I can shore a failing wall or arch within the hour.",
              "I can spot weak joints and false fronts at a glance.",
              "I can plan a breach point that drops a wall safely.",
              "I can build a false wall or discreet niche if need be.",
              "I can erect stout ramps, stairs, and scaffolds quickly.",
              "I can stamp load limits so floors don’t kill the unwary.",
              "I can hide a parcel inside a rubble-core pier for a time.",
              "I can provide lime, gravel, wedges, and cribbing at cost.",
              "I can map catacombs and service tunnels under {place}.",
              "I can seal a crypt or collapse a tunnel behind you.",
              "I can carve lawful seals and inscriptions you provide.",
              "I can time hammering to mask other noises nearby.",
              "I can lend chisels, mallets, slings, and pry bars.",
              "I can tarp a site and post a night watch that stays quiet.",
              "I can mark safe lines on walls before you climb.",
              "I can build barricades from rubble that truly hold.",
              "I can survey a lot and prove a neighbor shifted markers.",
              "I can source sound stone that won’t spall in frost.",
              "I can store crates beneath a stack of dressed blocks.",
              "I can vouch for you with the builders’ guild in {place}."
            ]
          },
          "Weaver": {
            "hooks": [
              "My best loom in {place} was sabotaged; help me catch who filed the heddles.",
              "A dyer sold bad mordant that rots cloth; trace the batch before deliveries ruin reputations.",
              "A bolt of spider-silk vanished en route; find it before smugglers cut it into masks.",
              "A tapestry shows moving scenes after midnight; guard me while I test the warp for curses.",
              "Journeymen plan a strike; mediate with the guild so no one starves.",
              "Counterfeit stamps mark cheap cloth with my seal; expose the press in {place}.",
              "Smugglers hide messages in selvedge; help decode and confront the broker.",
              "Moths infest the storehouse; escort me to gather lavender and cedar safely.",
              "My pattern book was stolen; follow the thread to a rival’s shop.",
              "Festival banners caught fire; I need safe flame-retardant weaves by dawn.",
              "A shuttle pricks and numbs anyone who uses it; someone hexed the bobbin.",
              "Dye runoff poisons a creek; collect samples and confront the fullers’ yard.",
              "A caravan with our winter cloth was ambushed outside {place}; reclaim the bolts.",
              "A tailor refuses payment and spreads lies; help me secure a fair judgment.",
              "An imported cloth undercuts honest wages; check tariffs and the smuggler route.",
              "A noble wants mourning cloth that never stains; source safe dye and guard delivery.",
              "Runaway apprentices were lured by a sweatshop; free them without bloodshed.",
              "A saint’s veil on display is a forgery; prove it without starting a riot.",
              "Selvedge marks hide a ciphered threat; find who wove it and why.",
              "Guild wardens plan to shutter small looms; rally witnesses to the vote in {place}."
            ],
            "goals": [
              "To pay fair wages and end child labor in {place}.",
              "To weave flame-resistant fabric for kitchens and ships.",
              "To develop brilliant dyes that do not poison water.",
              "To found a cooperative where small looms survive.",
              "To publish an open pattern library for all tailors.",
              "To clothe the poor with warm, durable cloth each winter.",
              "To teach apprentices from families the guild ignores.",
              "To open a weaving school that welcomes any learner.",
              "To standardize bolt lengths so cheats cannot shave yardage.",
              "To design quiet, breathable camouflage cloaks for scouts.",
              "To furnish banners that unite festivals without faction.",
              "To map honest wool, flax, and dye roads into {place}.",
              "To improve treadle looms for faster, safer work.",
              "To supply sail-cloth blanks fairly to lofts and riggers.",
              "To revive a lost brocade and teach it widely.",
              "To guarantee clean water by reforming fullers’ pits.",
              "To break the guild ring that fixes prices.",
              "To build a living museum where elders teach craft.",
              "To wax-proof travel cloaks without heavy stink.",
              "To retire to a sunlit room where the shuttle sings."
            ],
            "offers": [
              "I can supply bolts of sturdy cloth at honest measure.",
              "I can mend tears quickly and invisibly where possible.",
              "I can stitch hidden pockets and strong inner seams.",
              "I can dye garments to match night, stone, or forest.",
              "I can outfit you as servants or travelers who pass unnoticed in {place}.",
              "I can weave straps, slings, bands, and cords that hold.",
              "I can cut signal banners and pennants with simple codes.",
              "I can provide thick hangings that muffle sound in a room.",
              "I can lend tarps and tenting strong enough for storms.",
              "I can patch sails in a pinch and refer you to a sailmaker.",
              "I can make cloaks that break up your outline at dusk.",
              "I can wrap parcels inside bolts that look like cheap cloth.",
              "I can introduce you to honest dyers, fullers, and tailors.",
              "I can lend heavy needles, waxed thread, and awls.",
              "I can weave a scarf with coded stripes only we read.",
              "I can repair nets and screens to keep pests at bay.",
              "I can wax-proof cloaks and packs for wet marches.",
              "I can run looms late so the din covers other work nearby.",
              "I can cut bandages and tourniquets from clean offcuts.",
              "I can vouch for you with the weavers’ guild in {place}."
            ]
          }
    },
    "data": {
        "human": {
            "names": {
              "male": ["Aran", "Boric", "Corbin", "Damian", "Edric", "Finnan", "Gareth", "Hadrian", "Joric", "Loric", "Merek", "Perrin", "Roric", "Stellan", "Tevan"],
              "female": ["Alina", "Bryn", "Cora", "Elara", "Fiora", "Gwyn", "Helena", "Isolde", "Jessa", "Lyra", "Mara", "Nadia", "Roslyn", "Seraphina", "Valora"],
              "neutral": ["Avery", "Blair", "Cameron", "Drew", "Ellis", "Finley", "Grey", "Hayden", "Jordan", "Kai", "Morgan", "Quinn", "Rowan", "Skyler", "Taylor"]
            },
            "lastNames": [
              "Ashworth","Blackwood","Cartwright","Dunfield","Fairwind","Greenbottle","Highhill","Ironhand","Laker","Miller",
              "Oakhurst","Porter","Silverton","Thatcher","Whitlock","Ravenscroft","Brookstone","Hillford","Redfern","Wainwright"
            ],
            "name_syllables": { "prefix": [], "middle": [], "suffix": [], "patterns": [] },
            "appearance": {
              "shared": {
                "physical": [
                  "Average height","Sturdy build","Weathered skin","A friendly smile","Scars from old battles",
                  "Plain features","Expressive eyes","Calloused hands","A simple haircut","A tattoo of a family crest",
                  "Sun-browned complexion","Crooked nose from an old break","Ink-stained fingertips","Wind-tangled hair","Missing or chipped tooth",
                  "Rough stubble","Laugh lines at the eyes","Nail-beds dark with oil","Faint smell of smoke or soap","Small birthmark on the cheek"
                ],
                "clothing": [
                  "Simple leather tunic","Sturdy traveler's clothes","Worn farmer's garb","A colorful sash","A heavy wool cloak",
                  "Well-worn boots","A simple silver ring","A pouch tied to a belt","Patched cloak with careful stitches","Embroidered cuffs showing hometown",
                  "Weathered hat with a bent brim","Utility belt with tools","Fingerless gloves","Travel-stained scarf","Linen shirt rolled at the sleeves",
                  "Sturdy bracers","Good-luck charm on cord","Oilskin overcoat","Reinforced trousers","Spare shoes slung by laces"
                ]
              },
              "gender": {
                "male": {
                  "physical": [
                    "A neatly trimmed beard","Broad shoulders","A square jaw","A receding hairline","A prominent scar on his cheek",
                    "Sun-creased forehead","Work-hardened forearms","Short-cropped hair","Knuckles bruised from practice","Pierced ear with plain stud",
                    "Crooked grin","Heavy brow","Callused palms","Slight limp from old injury","Deep-set eyes",
                    "Thick neck","Tanned V on his throat","Rope burns on wrists","Fleck of paint or soot on face","Smells faintly of ale or leather"
                  ],
                  "clothing": [
                    "A blacksmith's apron","A soldier's gambeson","A simple vest over a linen shirt","Rolled-up sleeves with armbands","Suspenders and work trousers",
                    "Heavy cloak clasped with a brooch","Sturdy leather jerkin","Tool-laden belt","Wool cap","Oiled boots",
                    "Traveling tabard","Wrist wraps","Weather-stained cloak","Brass-buckled belt","Patterned waistcoat",
                    "Scarf tucked into collar","Cudgel hung at hip","Gloves tucked in belt","Shoulder mantle of fur","Hammer loop on pants"
                  ]
                },
                "female": {
                  "physical": [
                    "Long hair in a practical braid","Kind eyes","A slender frame","A dusting of freckles","Nimble fingers",
                    "Strong calves from walking","Sun-kissed cheeks","Scar on the eyebrow","Braided bangles of hair","Steady, appraising gaze",
                    "Quick, practiced smile","Callused fingertips","Tiny tattoo at the wrist","Loose strand that escapes braid","Graceful posture",
                    "Laugh that arrives easily","Smudge of flour or ink","Slight hitch in her step","Pierced ears with small hoops","Smells of herbs or soap"
                  ],
                  "clothing": [
                    "A simple dress with an apron","A warm shawl","A necklace with a small gemstone","Practical boots beneath skirts","Threadbare cardigan mended neatly",
                    "Headscarf tied at nape","Leather satchel crossbody","Work gloves tucked in belt","Embroidered bodice","Traveling cloak pinned with brooch",
                    "Hidden pockets sewn into hem","Rolled sleeves for work","Coin purse on braided cord","Woolen cloak with hood","Utility belt with pouches",
                    "Fur-lined vest","Apron with stitched family sigil","Weatherproofed riding skirt","Ribbon at wrist as keepsake","Locket tucked under collar"
                  ]
                },
                "neutral": {
                  "physical": [
                    "Androgynous features","Short, practical hair","A lean build","A watchful gaze","A single ear piercing",
                    "Light step that makes little sound","Scar across knuckles","Steady hands","Sun-browned arms","Quick, economical movements",
                    "Crooked nose set well","Eyes that scan exits","Faint dimple when smiling","Trace of ink at wrist","Patchy tan lines from gear",
                    "Small callus on trigger finger","Old rope burn around palm","Slightly hoarse voice","Calm breathing even under stress","Smells faintly of oil or leather"
                  ],
                  "clothing": [
                    "A comfortable tunic and trousers","A hooded cloak","Fingerless gloves","High-collared short coat","Utility vest with many pockets",
                    "Worn leather satchel","Soft-soled shoes for quiet steps","Neckerchief that doubles as mask","Canvas belt with rings","Patchwork cloak reversible",
                    "Simple bracers","Cap pulled low","Sturdy gaiters","Hidden knife sheath sewn inside hem","Plain sash used as bandage",
                    "Waxed canvas jacket","Traveler’s cloak with inside loops","Sleeves tied at elbows","Wrist-strap timepiece or bead counter","Spare sash wrapped around waist"
                  ]
                }
              }
            }
          },
        "elf": {
            "names": {
              "male": ["Aelar", "Birel", "Caelen", "Dior", "Elros", "Faelar", "Galan", "Hador", "Ithron", "Laeron", "Mirel", "Naertho", "Riel", "Silvanus", "Taeron"],
              "female": ["Alariel", "Celebrian", "Doriana", "Elara", "Finduilas", "Galadriel", "Ithiliel", "Luthien", "Mireth", "Nariel", "Riel", "Sariel", "Tauriel", "Yavanna"],
              "neutral": ["Amoriel", "Elion", "Lael", "Linwe", "Nimloth", "Riellian", "Saelos", "Tiriel", "Valen"]
            },
            "lastNames": [
              "Amastacia","Galanodel","Holimion","Ilphelkiir","Liadon","Meliamne","Naïlo","Siannodel","Xiloscient","Elowen",
              "Silverfrond","Moonshadow","Starbreeze","Evenwood","Dawnsinger","Mistwalker","Willowshade","Nightbloom","Sunstrider","Windrider"
            ],
            "name_syllables": { "prefix": [], "middle": [], "suffix": [], "patterns": [] },
            "appearance": {
              "shared": {
                "physical": [
                  "Slender and graceful build","Pointed ears","Sharp, ethereal features","Almond-shaped eyes of a striking color",
                  "No facial hair","Long, fine hair","An ageless quality","Moves with a silent grace",
                  "Faint, musical cadence to movements","Eyes flecked with gold or silver","Fine-boned hands","Skin with cool undertones",
                  "Hair that catches light like silk","Subtle, natural fragrance like rain or leaves","Delicate cheekbones","Barely visible veins like pale vines",
                  "Footfalls light as a cat","Ears adorned with small rings","Subtle luminescence in moonlight","Composed, serene expression"
                ],
                "clothing": [
                  "Flowing silks in natural colors","Elegant leather armor","Intricate silver jewelry","A finely crafted wooden bow on their back","Soft, high boots","A cloak fastened with a leaf-shaped clasp",
                  "Garments embroidered with leaf or star motifs","Sashes that drape elegantly","Cloaks that ripple like water","Belts worked in silver filigree",
                  "Lacquered bracers with vinework","Soft gloves without seams","Travel cloaks lined with moss-green","Quivers of whitewood","Delicate circlets and diadems",
                  "High-collared tunics with fine stitching","Boots that leave little trace","Jewelled brooches shaped like leaves","Silk scarves that double as veils","Gossamer layers for festivals"
                ]
              },
              "gender": {
                "male": {
                  "physical": [
                    "A sharp, aristocratic profile","Long hair, often braided","A lean, muscular build","Keen eyesight",
                    "Brows arched like blades","Hair bound with small silver rings","Eyes bright as ice or spring water","Cheekbones cut and refined","Long fingers suited to strings and bows",
                    "Scar faintly tracing the jaw","Measured breathing, slow and steady","Skin unlined despite age","Tattoo-thin runes along the temple","Graceful posture like a dancer",
                    "Slightly tapered canines","Voice smooth and resonant","Steps that never scuff","A gaze that lingers on horizons","Skin dusted by pale freckles like stardust","Subtle scent of cedar"
                  ],
                  "clothing": [
                    "A finely woven tunic","High leather boots","A silver circlet","Sleeveless tunic under layered cloak","Sashes braided with narrow cords",
                    "High boots with minimal heels","Armguards stitched in leaf patterns","Travel mantle clasped with moonstone","Quiver harness fitted close","Light mail hidden beneath silk",
                    "Knife sheaths of white leather","Soft belts with engraved buckles","Hooded cloak that shadows the face","Long coat with slits for movement","Fingerless archery gloves",
                    "Slim, jeweled earcuffs","Vambraces of laminated wood","Embroidered collar standing tall","Ceremonial sash of silver thread","Lightweight shoulder cape"
                  ]
                },
                "female": {
                  "physical": [
                    "Delicate features","Extremely long hair, flowing freely","A serene expression","Nimble, artistic hands",
                    "Lashes long and fine","Hair like a waterfall, intricately braided","Eyes luminous in dim light","Cheeks with a faint natural flush","Ears with delicate cuffs and chains",
                    "Hands graceful and steady","A walk like drifting petals","Voice clear as a bell","Subtle scent of wildflowers","A beauty mark near the eye",
                    "Composure that rarely cracks","Tattoo of a vine curling the wrist","Slightly pointed canines peeking when smiling","Spine straight and poised","Brows shaped like willow leaves","Footsteps soft as snowfall"
                  ],
                  "clothing": [
                    "An elegant gown of pale fabric","A circlet of woven flowers and silver","Delicate slippers",
                    "Gowns layered like petals","Corseted bodices with vine embroidery","Long sleeves that bell at the wrist","Belts of braided silk","Cloaks with silver-thread hems",
                    "Slippers that whisper over stone","Hairpins shaped like leaves","Half-masks for festivals","Travel skirts slit for movement","Delicate armlets and bracelets",
                    "Hooded capes of pale grey","Sashes in twilight hues","Fine gloves that reach mid-forearm","Veils for formal rituals","Wraps that can be tied many ways",
                    "Quiver straps designed to blend with gowns","Small shoulder cape of white fur"
                  ]
                },
                "neutral": {
                  "physical": [
                    "Perfectly balanced, androgynous features","Hair kept in an intricate but practical style","A calm, observant demeanor",
                    "Eyes that seem to change with light","Cheekbones smooth and fine","Jawline neither sharp nor soft—just right","Hands with long, nimble fingers","Ears accentuated by minimal jewelry",
                    "Movements that waste no energy","Breath quiet and measured","Skin cool to the touch","No visible pores or blemishes","A gaze that listens","Hair falling in straight, clean lines",
                    "Subtle scar at the collarbone","Graceful neck","A faint tilt to the head when curious","Footfalls almost inaudible","Smells faintly of rain","Expression serene but unreadable"
                  ],
                  "clothing": [
                    "Well-fitted tunic and leggings","A simple, elegant cloak","Jewelry that is beautiful but not ostentatious",
                    "Travel belt with hidden pockets","Boots that flex like gloves","Sleeveless over-vest for archery","Soft scarf looped twice","Longcoat tailored close",
                    "Hood with stiffened edge","Fingerless gloves for dexterity","Thin corded bracelets","Sash that can serve as climbing line","Cloak pin shaped like a leaf",
                    "Quiver worn low for balance","Simple circlet of carved wood","Light mail worn beneath clothing","Knee-high gaiters","Layered tunic for temperature changes",
                    "Belt pouch with neat compartments","Travel cloak that resists rain"
                  ]
                }
              }
            }
          },
        "dwarf": {
            "names": {
              "male": ["Balin", "Borin", "Dain", "Durin", "Fili", "Gimli", "Gloin", "Kili", "Oin", "Ori", "Thorin", "Thrain", "Dwalin", "Brokkr", "Eitri"],
              "female": ["Astrid", "Bruna", "Dis", "Elga", "Freyda", "Gerta", "Hilda", "Ingra", "Lifsa", "Marna", "Ragna", "Siggrun", "Thora", "Vistra"],
              "neutral": ["Baran", "Durin", "Gorm", "Helta", "Korgan", "Rurik", "Torra"]
            },
            "lastNames": [
              "Axeworthy","Battlehammer","Brewbeard","Caskborn","Deepdelver","Foamfist","Goldhand","Ironfoot","Rockseeker","Stoneshield",
              "Thunderforge","Graybeard","Coppervein","Graniteheart","Steelmantle","Barrelbreaker","Hearthguard","Ironanvil","Stonebrow","Orewarden"
            ],
            "name_syllables": { "prefix": [], "middle": [], "suffix": [], "patterns": [] },
            "appearance": {
              "shared": {
                "physical": [
                  "Short and stout build","Broad and muscular","A ruddy complexion","Strong hands","A determined expression","Eyes like chips of stone",
                  "Thick, braided hair or beard","Heavy, thunderous footfalls","Dense body hair","Square, wide nose","Soot-smudged skin from the forge",
                  "Callused palms and fingertips","Deep, rolling laugh","Knotted forearms crisscrossed with scars","Bushy eyebrows that meet when frowning",
                  "Slight bow-legged stance","Faint smell of smoke, ale, or oil","Stubborn set to the jaw","Veins like cords across hands","Old nicks from flying stone"
                ],
                "clothing": [
                  "Thick leather clothing","Heavy-duty boots","A wide belt with numerous pouches","A thick fur-lined cloak","Simple, functional garb","Steel-toed boots",
                  "Blacksmith's apron scorched at the hem","Tool harness with loops and rings","Iron-banded bracers","Bronze-buckled belt","Reinforced knee patches",
                  "Hooded felt cowl for cold tunnels","Lantern hook or cap-lamp on band","Stout backpack with bedroll","Stone or rune talisman on cord",
                  "Heavy gauntlets for rough work","Elbow guards sewn into sleeves","Cloak clasp shaped like a hammer","Canvas over-trousers for mine work","Spare smithing gloves tucked in belt"
                ]
              },
              "gender": {
                "male": {
                  "physical": [
                    "A long, magnificent beard, often braided","A broken nose","Thick, hairy arms","A booming voice",
                    "Beard ringed with metal clasps","Barrel chest and stout neck","Scarred knuckles from years at the anvil","Ember-flecked eyes in the forge light",
                    "Short-cropped hair at the sides","Callused shoulders from hauling stone","Smoke-scented hair and beard","Broad, square hands",
                    "Deep furrow between brows","Stiff knee from an old cave-in","Ruddy ears from heat and ale","Braided mustache curled at tips",
                    "Heavy, even breathing","Old tattoo of clan mark on bicep","Thick fingers adorned with signet rings","A grin that shows a gold-capped tooth"
                  ],
                  "clothing": [
                    "A blacksmith's apron","Chainmail under a tunic","A horned helmet","Broad leather belt with iron buckle","Smithing gloves tucked at the waist",
                    "Heavy cloak trimmed with fur","Iron-riveted work boots","Utility apron with many pockets","Stiff canvas trousers for shop use","Scale shirt for serious business",
                    "Thick wool undershirt","Tool bandolier across the chest","Forge-stained cap or coif","Ring of keys hanging from belt","Iron gorget for neck protection",
                    "Hammer loop and chalk pouch","Quilted gambeson beneath leathers","Shoulder cape of bear or ram hide","Bracer watch of knotted cords for timing heats","Leather satchel full of files and tongs"
                  ]
                },
                "female": {
                  "physical": [
                    "A thick beard, worn with pride","Stout, powerful arms","Hair in thick, practical braids","A surprisingly gentle smile",
                    "Keen, appraising eyes","Braids clasped with stone or bone","Small scar across the cheek","Surefooted stance on loose rock","Callused, capable hands",
                    "Tattooed knuckles spelling clan runes","Rosy cheeks warmed by the forge","Low, resonant voice","Broad, steady hips built for hauling","Steel-hard gaze when crossed",
                    "Ears pierced with heavy hoops","Dusting of stone grit along forearms","Leather wraps around hair to keep sparks off","Subtle scent of cedar soap","Freckles across the bridge of the nose","Square, neatly trimmed nails"
                  ],
                  "clothing": [
                    "A sturdy leather jerkin","Trousers tucked into boots","Rings on several fingers","Apron with deep pockets","Heavy overskirt over leggings",
                    "Braided belt with tool hooks","Kerchief or headwrap tied back","Fitted mail shirt for rough work","Fur-lined traveling cloak","Bearded-braid clips inset with gems",
                    "Lace-up bracers for wrist support","Tool satchel worn crossbody","Reinforced bodice for lifting","Charm necklace of carved stone","Headscarf pinned with a brooch",
                    "Stout gloves with cuff guards","Knee guards strapped over trousers","Double-stitched work boots","Carved stone brooch with clan sign","Canvas smock thrown over nice clothes at work"
                  ]
                },
                "neutral": {
                  "physical": [
                    "A well-kept but practical beard","A solid, unmovable stance","Observant, deep-set eyes","Compact, muscular frame","Square shoulders and thick wrists",
                    "Calm, measured breathing","Amber or iron-grey eyes","Short, practical braids or trimmed beardline","Coal-smudged fingertips","Callus bands across palms",
                    "Measured, heavy footfalls","Rumbling chuckle that warms a room","Hair kept under a simple cap","Sturdy neck and broad jaw","Scar splitting one eyebrow",
                    "Scent of stone dust and oil","Slight bow in the legs from years underground","Ears nicked by old scrapes","Sun-bleached streaks in beard or hair","Cheeks flushed from heat or drink"
                  ],
                  "clothing": [
                    "Functional miner's clothes","A hooded cloak","Heavy leather gloves","Tool belt with hammer and chisel","Strap for lamp or lantern",
                    "Thick wool socks and gaiters","Short cape for warmth without bulk","Reinforced work trousers at the knees","Leather cap with riveted brim","Coil of rope slung across shoulder",
                    "Canvas satchel with chalk and wedges","Sturdy greaves over work boots","Iron-studded belt for weight","Chalk pouch for marking stone","Bandolier of pitons and spikes",
                    "Dust scarf or bandana for lungs","Waxed earplugs on a cord","Oilskin over-jacket for rain","Spare apron rolled and tied","Ledger tucked into a board sleeve"
                  ]
                }
              }
            }
          },
        "halfling": {
            "names": {
              "male": ["Alton", "Cade", "Finnan", "Lyle", "Milo", "Norbert", "Orien", "Perrin", "Roscoe", "Samwise", "Tobo", "Wellby"],
              "female": ["Bree", "Cora", "Eglantine", "Lila", "Marigold", "Portia", "Rosie", "Seraphina", "Tansy", "Willow", "Ruby"],
              "neutral": ["Cerry", "Dell", "Pippin", "Joss", "Reed", "Shay"]
            },
            "lastNames": [
              "Brushgather","Goodbarrel","Greenbottle","High-hill","Littlefoot","Proudfoot","Tealeaf","Thornhopper","Underbough","Whitfoot",
              "Appleblossom","Honeypot","Merryweather","Oakbottom","Quickstep","Rumblebelly","Hearthfoot","Barleycorn","Willowmoss","Puddlewick"
            ],
            "name_syllables": { "prefix": [], "middle": [], "suffix": [], "patterns": [] },
            "appearance": {
              "shared": {
                "physical": [
                  "About three feet tall","A round, pleasant face","Curly hair","Large, hairy feet","A slightly pudgy build","Quick, nimble movements","A warm, infectious smile",
                  "Rosy cheeks that flush easily","Bright, twinkling eyes","Nimble, deft fingers","Dimples that appear when they grin","Barefoot stride that makes little sound",
                  "Faint scent of fresh bread or apples","Mud-spattered calves from field paths","Callused soles tough as leather","Curious head tilt when listening",
                  "Easy, musical laughter","Quick reflexes that surprise taller folk","A contented belly from good meals","Warm, steady hands"
                ],
                "clothing": [
                  "Comfortable, earthy-toned clothes","A colorful vest","No shoes","A simple tunic and breeches","A wide-brimmed hat for traveling","A small leather backpack",
                  "Suspenders that creak pleasantly","Patchwork cloak sewn from keepsakes","Waistcoat with many little pockets","Flowered kerchief at the neck",
                  "Belt crowded with tiny pouches","Woven friendship bracelet","Little pipe-case on a cord","Embroidered cuffs with cheerful patterns","Bright wooden buttons",
                  "Tin whistle hanging from a strap","Bread satchel or pie tin wrapped in cloth","Cook's apron rolled for emergencies","Knitted cap pulled to the ears","Breeches with tidy knee patches"
                ]
              },
              "gender": {
                "male": {
                  "physical": [
                    "Slight sideburns","A twinkle in his eye","A healthy appetite is apparent","Ruddy cheeks from sun and ale","Dimpled chin that deepens when he laughs",
                    "Curling sideburns that frame the face","A modest belly over a quick pair of legs","Quick, clever hands","Tough, leathered soles","Faint scent of sweet smoke",
                    "Freckles dusted across the nose","Bright, curious gaze","Short, curled eyelashes","Tousled curls that never quite behave","Lithe, springy step",
                    "A nicked ear from youthful scrapes","Warm, callused palms","Laugh lines etched at the eyes","A button nose that reddens in cold","Soft humming audible in his breathing"
                  ],
                  "clothing": [
                    "Often seen with a pipe","Suspenders","A slightly rumpled shirt","Vest with brass buttons","Rolled-up trousers above the ankles",
                    "Checked scarf tucked under the chin","Felt cap with a jaunty tilt","Patch-lined cloak for drizzles","Thick wool socks (even if barefoot soon after)","Pocket watch on a short chain",
                    "Elbow patches on a favorite jacket","Neatly darned knee breeches","Embroidered braces with patterns","Striped work shirt for market day","Leather belt with pudding-skin pouch",
                    "Tiny penknife on a cord","Walking stick polished by years","Bright kerchief in breast pocket","Sleeves held by garters","Flower tucked in the lapel for luck"
                  ]
                },
                "female": {
                  "physical": [
                    "Hair often decorated with flowers","Bright, curious eyes","A gentle demeanor","Rosy cheeks and ready dimples","Laugh lines that tell of many stories",
                    "Quick, nimble hands suited to craft","Soft curls pinned with combs","Braid crowned over the head","A dusting of freckles across the nose","Light, dancer's step",
                    "Flour or herb smudges on fingers","Warm, inviting smile","Sun-kissed forearms from garden work","Tiny flower tucked behind one ear","Small hoop earrings",
                    "Steady, reassuring gaze","Round, cheerful face","Callused fingertips from needle or lute","Hair that frizzes in damp","Melodic voice even when whispering"
                  ],
                  "clothing": [
                    "A simple dress with an apron","A small pouch for collecting interesting things","A hand-knit shawl","Flowered dress hemmed for walking","Patched hem with careful stitches",
                    "Woven belt tied in a bow","Bonnet or ribboned hat for market days","Basket looped over the arm","Laced bodice for best occasions","Beaded necklace of glass or seed",
                    "Apron with hidden pockets","Embroidered kerchief at the neck","Warm shawl pinned with a brooch","Travel cloak with generous hood","Ribboned hatpin to tame the breeze",
                    "Thread bracelets wrapped thrice","Sturdy skirt over leggings for travel","Bare feet with a simple ankle chain","Floral brooch carved from wood","Spindle case or knitting needles in bag"
                  ]
                },
                "neutral": {
                  "physical": [
                    "An open, friendly face","A head of unruly curls","Constantly fidgeting","Quick, steady hands","Wide, attentive eyes",
                    "Rosy-tipped nose","Ink or jam smudged at the corner of the mouth","Tough soles used to long walks","Balanced, nimble stance","One deep dimple when amused",
                    "A soft, comfortable belly","Ready, bubbling laugh","Freckles scattered across cheeks","Keen ears that catch gossip","Tiny scar on the shin from childhood",
                    "Smell of fresh earth or pastry","Curious tilt of the head","Calm, even breathing","Feather-light step when sneaking","Quick grin that arrives before words"
                  ],
                  "clothing": [
                    "Overalls","A patched-up jacket","A satchel full of snacks","Waistcoat with bright mismatched buttons","Rolled sleeves ready for work",
                    "Striped scarf tucked close","Cap with a jaunty feather","Belt with tidy utility pouches","Knit cap for chilly mornings","Short traveling cloak",
                    "Pocketed vest for trinkets","Sling bag with crumbs and twine","Tin cup dangling from a loop","Small seed pouch tied to belt","Suspenders that actually fit",
                    "Bandana for hair or dust","Woven anklet or charm cord","Blanket roll strapped with string","Button-on sleeve guards","Walking stick with carved notches"
                  ]
                }
              }
            }
          },
        "gnome": {
            "names": {
              "male": ["Alston", "Boddynock", "Dimble", "Fonkin", "Gerbo", "Glim", "Jebeddo", "Orryn", "Roondar", "Zook"],
              "female": ["Bimpnottin", "Ellywick", "Lilli", "Loopmottin", "Marnan", "Nissa", "Roywyn", "Tana", "Waywocket"],
              "neutral": ["Fip", "Nix", "Pella", "Quill", "Spocket", "Zanna"]
            },
            "lastNames": [
              "Badger","Cobblestone","Fizzlebang","Geargrind","Muddlepot","Nackle","Sparkhammer","Tinker-Tots","Wobble-Knee","Copperpot",
              "Brassbutton","Cogsprocket","Fiddlewick","Glimmerglass","Hopspring","Inkwhistle","Nimblefuse","Pennywhistle","Quickgear","Rivetspark"
            ],
            "name_syllables": { "prefix": [], "middle": [], "suffix": [], "patterns": [] },
            "appearance": {
              "shared": {
                "physical": [
                  "Small and slender, under four feet tall","A large nose and ears","Bright, intelligent eyes","Skin tones of earthy colors","A shock of wild hair",
                  "Ink-splattered fingertips","Singed eyebrows from misfires","Perpetual grin that fades only when thinking","Quick, darting gaze that takes everything in","Soot smudged across the cheeks",
                  "Callused fingertips from tools and wires","Smell of oil, resin, or ozone","Nimble feet that bounce on the balls","Hair prickling with static","Tiny nicks and bandages on knuckles",
                  "Pockets bulging with odds and ends","Expressive eyebrows that wag with moods","Slight overbite and bright, quick teeth","Breath quickens audibly when excited","Nose twitching when curious"
                ],
                "clothing": [
                  "A leather apron with many pockets","Goggles, either on head or eyes","Clothes often smudged with grease or soot","A tool belt with strange contraptions","Mismatched socks",
                  "Utility vest stitched with loops","Belt crowded with tiny vials and screws","Retractable magnifier clipped to collar","Patchwork waistcoat with brass buttons","Knee-length coat with reinforced elbows",
                  "Boots with spring inserts or adjustable straps","Small backpack rattling with gizmos","Cap with folding ear flaps","Fingerless work gloves, burn-spotted","Scarf that hides a coil of wire",
                  "Bandolier of tools and chalks","Spare goggles hanging from the belt","Pocket watch with a tinkered face","Ear protectors slung around neck","Roll-up tool wrap tied to the thigh"
                ]
              },
              "gender": {
                "male": {
                  "physical": [
                    "A neatly trimmed, pointed beard","A mischievous grin","Constantly tinkering with something","Singed moustache tips","Ink-stained nails",
                    "Quick, deft hands with tiny scars","Spectacles perched low on the nose","Hair that sticks up despite combing","A slight squint from close work","Quick, shallow breaths when excited",
                    "Grease smear at the temple","Slight stoop from long bench hours","Callus ridge on forefinger and thumb","High, domed forehead","Occasional static pop in beard hairs",
                    "Smell of hot metal and resin","Whiskers braided with fine wire","Soot-dusted eyebrows","Nimble, bouncing step","Steady hands even under pressure"
                  ],
                  "clothing": [
                    "A waistcoat with many buttons","Slightly too-large boots","Suspenders bristling with clips","Goggles pushed up onto the brow","Pocket watch on a chain with odd ticks",
                    "Canvas apron with singe marks","Rolled sleeves held with leather bands","Short, vented workcoat","Tool-laden belt with holsters","Fingerless gloves reinforced with patches",
                    "Knee pads strapped over trousers","Cap with hinged magnifier","Bracer with tiny gear-dials","Thick scarf that hides wire spools","Heavy utility pockets sewn inside vest",
                    "Oilskin duster for field tests","Wrist loop holding calipers","Boots with screw-on heels","Notebook tethered to the lapel","Vial rack sewn into the inner coat"
                  ]
                },
                "female": {
                  "physical": [
                    "Hair in wild, eccentric pigtails or buns","A curious, tilted head","Expressive eyebrows","Freckles of soot across the nose","Quick smile that crinkles the eyes",
                    "Ink smudge on the thumb","Surprisingly strong forearms","Stray curls escaping pins","Bright eyes that track mechanisms","Faint burn scar on the wrist from trials",
                    "Quick, bouncing step","Nails stained with dyes","Dimples that show when concentrating","Small tattoo of a cog at the wrist","Slightly singed hair tips",
                    "High cheekbones flushed with excitement","Subtle scent of lavender and oil","Eyes magnified behind lenses","Steady, meticulous hands","Left-handed ink smear along the palm"
                  ],
                  "clothing": [
                    "Colorful, patched-up clothing","Several small, jangling pouches","Headband holding goggles in place","Apron painted with alchemical symbols","Skirt with hidden tool loops",
                    "Leather corset-belt for support","Utility sash with labeled pockets","Wrist cuff that holds needles and pins","Knee-length boots with laces","Bolero jacket with reinforced shoulders",
                    "Bandolier of chalks and quills","Bright scarf pressed into service as a rag","Finger guards for hot work","Canvas messenger bag stuffed with parts","Sheath for a small wrench or awl",
                    "Hairpins shaped like tiny spanners","Pocketed apron over trousers","Oil-resistant smock for messy work","Protective spectacles on a chain","Thimble and thread case clipped to belt"
                  ]
                },
                "neutral": {
                  "physical": [
                    "Eyes that dart around, taking everything in","A perpetually surprised expression","Quick, bird-like movements","Ink-stained fingertips","Short, practical haircut with stubborn cowlicks",
                    "Soot-smudged cheek","Nose reddened by solvents","Wiry frame with unexpected strength","Quick, precise gestures","Slight overbite when smiling",
                    "Wide pupils when curious","Low, balanced stance","Scarred knuckles from tinkering","Callus from turning tiny screws","Smell of warm brass and oil",
                    "Ears pierced with mismatched studs","Eyebrows singed short","Faint static snaps on touch","Steady gaze when problem-solving","Calm, even breathing around chaos"
                  ],
                  "clothing": [
                    "A functional jumpsuit covered in pockets","Fingerless gloves","Magnifying lenses on a chain","Short jacket bristling with loops","Belt lined with tiny tins and screws",
                    "Elastic suspenders that actually help","Tool roll strapped to the thigh","Goggles hung at the hip","Apron rolled and tucked behind the belt","Canvas cap with stiffened visor",
                    "Multi-tool sheath at the chest","Pouch of springs and washers","Boots with protective toe caps","Notebook strapped to forearm","Waist-lanyard with chalk and pencil",
                    "Wire spool clipped to belt","Reinforced elbow patches","Detachable sleeves for hot work","Bandana for dust and fumes","Rag tucked into pocket corner"
                  ]
                }
              }
            }
          },
        "half_orc": {
            "names": {
              "male": ["Brak", "Dorn", "Garak", "Hosk", "Krusk", "Mog", "Rarn", "Thokk", "Vorg", "Zor"],
              "female": ["Arha", "Bagra", "Ekk", "Gora", "Holg", "Maka", "Rela", "Sora", "Urga", "Zasha"],
              "neutral": ["Dak", "Fen", "Grish", "Jorn", "Ror"]
            },
            "lastNames": [
              "Bloodfist","Doomhammer","Fist-Smasher","Iron-Tusk","Rage-Claw","Skull-Splitter","Stone-Breaker","The Unbent","War-Torn",
              "Bonecrusher","Grimjaw","Bloodtusk","Thundermaw","Stonefist","Ashbreaker","Steelmaw","Gorefang","Rendscar","Nightcleaver","Warborn"
            ],
            "name_syllables": {
              "prefix": ["gr", "br", "th", "kl", "dr"],
              "middle": ["u", "o", "a"],
              "suffix": ["k", "g", "sh", "rg"],
              "patterns": ["PS", "PMS"]
            },
            "appearance": {
              "shared": {
                "physical": [
                  "Tall and powerfully built","Grayish or greenish skin","Prominent lower canines (tusks)","A heavy, jutting jaw","Numerous scars","Coarse black hair","Muscular frame",
                  "Amber or yellow-flecked eyes","A broken or chipped tusk","Thick brow ridge","Veins like cords across the forearms","Ritual scarification or tattoos",
                  "Nose flattened by brawls","Callused, split knuckles","Low, rough breathing that rumbles","Old burns or brand marks","Broad hands with blunt nails","Ready, forward-leaning stance",
                  "Hair tied back with a leather thong","Scent of iron, leather, or smoke"
                ],
                "clothing": [
                  "Practical, heavy-duty clothing","Furs and untanned hides","Spiked leather armor","A necklace of teeth or bones","Heavy, cleated boots","Minimalist clothing, showing off muscles and scars",
                  "Iron-banded bracers","War-belts hung with rings","Patchwork cloak pieced from trophies","Bandolier of knives","Scarred shield slung across the back","Bone charms woven into hair or braids",
                  "Arm wrappings of rough cloth","Reinforced harness with lashing points","Broadhead arrows tucked at the hip","Heavy gauntlets for sparring","Trophy cords braided at the wrist",
                  "Metal rings piercing ear and brow","Thick cord necklace threaded with fetishes","Spare wrappings tied to the belt"
                ]
              },
              "gender": {
                "male": {
                  "physical": [
                    "Often bald or with a topknot","Massive, broad shoulders","A perpetually grim expression","Square, jutting jaw with a chipped tusk","Crooked nose from brawls",
                    "Heavy brow casting deep shadow","Ropey neck tendons flexing","Scars crisscrossing chest and arms","Knuckles split and healing","Cautious, assessing stare",
                    "Breath that turns to a growl when anger rises","Tattoo bands around the biceps","Callused palms like rough stone","Slight limp from an old wound","Thick veins threading the forearms",
                    "Ear nicked or torn","Stubble showing scalp scars","Large, square hands","Eyes that glint amber in low light","A faint jaw twitch when irritated"
                  ],
                  "clothing": [
                    "A harness instead of a shirt","A large, crude weapon always at hand","Heavy leather kilt or trousers","Studded belt with trophy rings","Piecemeal armored pauldrons",
                    "Greaves strapped over bare shins","Thick wrist wraps","Spare axe looped across the back","Bone-and-metal pendant","Worn cloak pinned with a spike",
                    "Boots studded with iron","Knuckle guards for brawling","Sling for a throwing spear","Shield hung by a shoulder strap","Simple cord to tie hair back",
                    "Bandolier with whetstone and oil","Heavy sash that doubles as rope","Nail-studded gauntlets","War paint chalk in a small pouch","Reinforced harness for climbing"
                  ]
                },
                "female": {
                  "physical": [
                    "Taller than most human men","Long hair in a thick braid","Fierce, intelligent eyes","Pronounced tusks polished smooth","Solid, athletic legs",
                    "Scar scored across one shoulder","Steady, measuring gaze","Sides shaved into a braid crest","Tattoo spiral at the temple","Strong jaw with an easy, confident smile",
                    "Callused, capable hands","Broad shoulders above a narrow waist","Golden or hazel eyes","Pierced ear with a tooth charm","Old burn on the forearm",
                    "Quick, grounded stance","Voice low and resonant","A slight notch in one tusk","Calm breathing before action","Faint scent of iron and herbs"
                  ],
                  "clothing": [
                    "A practical leather jerkin","Trousers and sturdy boots","Often wears war paint","Braided belt with knife sheaths","Fur-lined cloak for cold marches",
                    "Armored corset-style vest","Greaves fitted over leggings","Fingerless gloves for grip","Bone earrings and torque","Broad sash used for grappling",
                    "Shoulder mantle of wolf or boar","Shield slung across the back","Travel pack with a bedroll","Hair rings threaded with beads","Wrist-guard engraved with clan marks",
                    "Thigh strap for darts","Tool roll tied at the hip","Scarf used as a dust mask","Rain oilskin thrown over gear","Amulet pouch tied close to the chest"
                  ]
                },
                "neutral": {
                  "physical": [
                    "An intimidating presence","A muscular, solid build","A watchful, cautious gaze","Tusks kept neatly filed","Old scar tracking across scalp or lip",
                    "Thick wrists and forearms","Broad back with rope-like muscles","Knuckles scarred from drills","Calm, controlled breathing","Eyes that scan exits first",
                    "Hair cropped short for helmets","Heavy, deliberate footfalls","Slight underbite","Worn calluses on feet and palms","Small ring or stud piercing the nose or ear",
                    "Faint growl under the breath when threatened","A few gray hairs at the temples","Shoulders that carry weight without strain","Veins standing out with effort","Smell of leather and campfires"
                  ],
                  "clothing": [
                    "A mix of practical hide and leather","A hooded cloak to obscure their features","Simple, unadorned gear","Wide belt hung with tie-ons","Soft-soled boots for quiet steps",
                    "Reinforced knee and elbow patches","Scarf or cowl that can hide tusks","Compact toolkit in a roll","Travel harness with lashing points","Spare wrappings for hands",
                    "Stone or bone tokens braided into cords","Light mail beneath a plain tunic","Weathered cloak clasped by a tooth","Short cape cut for movement","Back scabbard for a heavy blade",
                    "Padded vest that spreads blows","Sling pouch for stones","Spare blade concealed in a boot","Whetstone and oil vial on a thong","Bandage roll tucked under the belt"
                  ]
                }
              }
            }
          },
        "dragonborn": {
            "names": {
              "male": ["Arjhan", "Balasar", "Bharash", "Donaar", "Ghesh", "Heskan", "Kriv", "Medrash", "Patrin", "Shedinn", "Torinn"],
              "female": ["Akra", "Biri", "Daar", "Harann", "Jheri", "Kava", "Korinn", "Mishann", "Nala", "Sora", "Zofra"],
              "neutral": ["Baeshra", "Jalan", "Klar", "Oth", "Sorin"]
            },
            "lastNames": [
              "Clethtinthiallor","Daardendrian","Delmirev","Drachedandion","Fenkenkabradon","Kerrhylon","Linxakasendalor","Myastan","Nemmonis","Turnuroth",
              "Akambherylliax","Kepeshkmolik","Kimbatuul","Norixius","Ophinshtalajiir","Prexijandilin","Shestendeliath","Verthisathurgiesh","Yarjerit","Zorxakas"
            ],
            "name_syllables": {
              "prefix": ["Ar", "Bal", "Ghe", "Hes", "Pa", "She"],
              "middle": ["jha", "sa", "sh", "ka", "tri", "di"],
              "suffix": ["n", "r", "sh", "k", "v"],
              "patterns": ["PS", "PMS"]
            },
            "appearance": {
              "shared": {
                "physical": [
                  "Covered in fine scales of a specific color (red, gold, etc.)",
                  "A draconic, reptilian head",
                  "Tall and strongly built",
                  "Clawed hands and feet",
                  "No visible hair",
                  "A proud, upright posture",
                  "Prominent horns or head-frills",
                  "Slitted, luminous pupils",
                  "Heavy, deliberate footfalls",
                  "Thick, ridged brow and snout",
                  "Scars that cross scales in lighter lines",
                  "Deep, chest-rumbling breath",
                  "Powerful, wedge-shaped jaw",
                  "A faint scent of metal, ash, or spice",
                  "Plated scales along forearms and shins",
                  "Fang tips visible even with mouth closed",
                  "Sibilant undertones in speech",
                  "Broad, barrel chest and strong diaphragm",
                  "Nostrils that steam in cold air",
                  "A calm, imposing stillness when at rest"
                ],
                "clothing": [
                  "Often disdains armor, relying on natural scales",
                  "Simple harnesses and belts",
                  "Loincloths or kilts",
                  "Jewelry made of precious metals",
                  "A symbol of their clan worn prominently",
                  "Open-shouldered garments that avoid horn friction",
                  "Polishing kit and oil flask clipped to belt",
                  "Heavy sashes wrapped across the torso",
                  "Wide bracers fitted for thick wrists",
                  "Strapped greaves sized for talons",
                  "Cloak clasped with claw-shaped brooch",
                  "Tool harness or apron over the chest",
                  "Back scabbard spaced for broad shoulders",
                  "Ventilated armor that sheds heat",
                  "Broad belts with engraved plates",
                  "Stiff collar that frames neck frills",
                  "Decorative chain draped across breastbone",
                  "Kilted overskirt in clan colors",
                  "Ceremonial shoulder mantle of mail",
                  "Pouches with large toggles easy for claws"
                ]
              },
              "gender": {
                "male": {
                  "physical": [
                    "A heavier, thicker build",
                    "Larger horns or head-frills",
                    "A deep, resonant voice",
                    "Heavily scarred muzzle from drills",
                    "Broad jaw that flexes when annoyed",
                    "Scale edges dulled from armor rub",
                    "Eyes like banked coals",
                    "Nostrils that flare before a charge",
                    "Squared stance, feet planted wide",
                    "Broad palms with thick talons",
                    "Horns etched or ringed with clan marks",
                    "A low growl threading through laughter",
                    "Stern, steady gaze",
                    "Slight overbite that shows fang tips",
                    "Neck tendons pronounced when speaking",
                    "Heat-warmed breath even in winter",
                    "Crest spines slightly chipped",
                    "A soldier’s straight back and bearing",
                    "Scales darkened along the shoulders",
                    "A rumbling hum when thinking"
                  ],
                  "clothing": [
                    "Often wears a heavy belt for weapons",
                    "Forearm bracers",
                    "Layered leather harness with rings",
                    "Broad baldric crossing the chest",
                    "Kilted war skirt over trousers",
                    "Armored collar protecting the throat",
                    "Thick-soled sandals or boots",
                    "Clan medalion resting on sternum",
                    "Weapon frog sized for a heavy blade",
                    "Scaled cape weighted at the hem",
                    "Greaves laced around the calves",
                    "Sash used as both belt and sling",
                    "Wrist cords with tally beads",
                    "Shoulder pauldron on weapon side",
                    "Apron of hammered plates for drills",
                    "Travel cloak slit for horn clearance",
                    "Glove tips cut to free talons",
                    "Crimson or sable tabard for ceremony",
                    "Tool roll strapped to thigh",
                    "Spare scabbard clipped behind hip"
                  ]
                },
                "female": {
                  "physical": [
                    "A more slender, sinuous build",
                    "More subtle, glossy coloration",
                    "Longer, more delicate horns",
                    "Fine crest spines that catch light",
                    "Eyes bright as polished amber",
                    "Graceful motion even when armored",
                    "Long fingers tipped with neat talons",
                    "Slight, musical rasp to the voice",
                    "Cheek scales smooth and even",
                    "A poised, balanced stance",
                    "Faint heat haze above nostrils in cold",
                    "Ridged scalp plates arranged symmetrically",
                    "Smiles that flash clean fangs",
                    "Thin, pale scar along the jaw",
                    "Measured breathing that barely moves the chest",
                    "Subtle scent like warm stone",
                    "Firm, corded forearms",
                    "Horn tips polished to a sheen",
                    "Eyes narrow slightly when amused",
                    "Tailor-straight posture"
                  ],
                  "clothing": [
                    "More likely to wear decorative jewelry",
                    "A finely crafted sash",
                    "Scaled bodice shaped for ease of movement",
                    "High-cut kilt with under-leggings",
                    "Collar chain with teardrop gem",
                    "Bracers engraved with vine-like motifs",
                    "Light mail layered beneath silk",
                    "Soft cloak clasped with moon-metal",
                    "Leg wraps criss-crossing the calves",
                    "Ceremonial veil that frames horns",
                    "Arm rings linked by delicate chains",
                    "Belt pouches arranged like scales",
                    "Shoulder cape pinned to avoid frills",
                    "Heelless sandals with ankle cuffs",
                    "Knife sheath hidden in sash folds",
                    "Mirror-polished gorget for court",
                    "Travel vest with many inner loops",
                    "Finger guards that leave talons free",
                    "Clan-patterned over-skirt",
                    "Small charm bells woven into belt"
                  ]
                },
                "neutral": {
                  "physical": [
                    "A balanced, powerful physique",
                    "Symmetrical head-frills",
                    "Eyes that seem to hold ancient patience",
                    "Even, matte scale finish",
                    "Steady, powerful breathing",
                    "Smooth horn growth without chips",
                    "Calm gaze that rarely blinks",
                    "Quiet footfalls for such size",
                    "Hands that move with precise economy",
                    "Subtle color shift along the neck plates",
                    "Scales along spine slightly raised",
                    "Jaw that relaxes into a neutral set",
                    "Minimal visible scars",
                    "A low, thrumming hum when content",
                    "Nostrils flare briefly before speaking",
                    "Scales brighten slightly after oiling",
                    "Broad shoulder span",
                    "Fang tips neatly filed",
                    "Scent like warm sand and metal",
                    "Presence that stills a room"
                  ],
                  "clothing": [
                    "Simple, functional, and unadorned clothing",
                    "A single, significant piece of jewelry",
                    "Minimalist harness with secure ties",
                    "Flexible lamellar that bends with the torso",
                    "Cloak that drapes cleanly over frills",
                    "Wide belt with compartmented boxes",
                    "Travelers’ wraps layered for climate",
                    "Clasp pins shaped in clan glyphs",
                    "Tabard with restrained geometric borders",
                    "Strapped sandals for rough ground",
                    "Sleeveless tunic for freedom of motion",
                    "Compact tool kit on a chest rig",
                    "Hood designed not to snag horns",
                    "Soft inner lining to protect scales",
                    "Padded shoulder roll for loads",
                    "Vambrace with hidden writing kit",
                    "Rain cloak oiled against weather",
                    "Looped cords to tie scrolls or maps",
                    "Knife hung low to clear belly plates",
                    "Plain silver torque signifying clan"
                  ]
                }
              }
            }
          },
        "tiefling": {
            "names": {
              "male": ["Akmenos", "Damakos", "Ekemon", "Iados", "Kairon", "Leucis", "Melech", "Morthos", "Pelaios", "Skamos", "Therai"],
              "female": ["Akta", "Anakis", "Bryseis", "Criella", "Damaia", "Ea", "Kallista", "Lerissa", "Makaria", "Nemeia", "Orianna", "Rieta"],
              "neutral": ["Art", "Creed", "Despair", "Fear", "Grieve", "Hope", "Ideal", "Music", "Nowhere", "Poetry", "Quest", "Sorrow", "Torment"]
            },
            "lastNames": [
              "Art","Carrion","Chant","Creed","Despair","Fear","Grieve","Hope","Ideal","Music",
              "Nowhere","Open","Poetry","Quest","Random","Reverence","Sorrow","Temerity","Torment","Weary"
            ],
            "name_syllables": { "prefix": [], "middle": [], "suffix": [], "patterns": [] },
            "appearance": {
              "shared": {
                "physical": [
                  "Small horns in various shapes (ram, gazelle, etc.)",
                  "A long, non-prehensile tail",
                  "Solid-colored eyes (black, red, gold)",
                  "Skin tones can be human-like, or shades of red/purple",
                  "Sharp, defined features",
                  "A faint smell of brimstone",
                  "Subtle heat in the skin, warm to the touch",
                  "Canines a touch longer than human",
                  "Hair in unusual hues (white, cobalt, wine)",
                  "Pupils that don’t track light like humans",
                  "Shadows that seem a fraction too sharp",
                  "Nails that grow a bit like claws",
                  "Brows arched in dramatic lines",
                  "A smile that’s a little too wide",
                  "Ears slightly pointed or fluted",
                  "Tail that twitches with mood",
                  "Freckles that look like cinders or stars",
                  "Voice with a velvet rasp",
                  "Scent of smoke, spice, or cold iron",
                  "Footfalls quieter than expected"
                ],
                "clothing": [
                  "Dark, well-kept clothing",
                  "Practical leather outfits",
                  "Silver jewelry",
                  "A hooded cloak",
                  "High boots",
                  "Sometimes incorporates chains or other metal adornments",
                  "Fingerless gloves that show rings",
                  "Corseted layers that flatter and guard",
                  "High collars that frame the horns",
                  "Long coats with dramatic tails",
                  "Belts hung with charms and keys",
                  "Veils or scarves for discretion",
                  "Studded bracers in elegant patterns",
                  "Slim scabbards fitted to the curve of the back",
                  "Tail slits tailored into hems and coats",
                  "Piercings with dark gemstones",
                  "Gloves with claw-tip reinforcements",
                  "Silk lining that whispers when they move",
                  "Hidden pockets for notes and vials",
                  "Capes or mantles that billow just so"
                ]
              },
              "gender": {
                "male": {
                  "physical": [
                    "A lean but strong build",
                    "More pronounced horns",
                    "A confident, sometimes intimidating, posture",
                    "Eyes that glimmer like coals",
                    "Shadow of stubble that never quite softens",
                    "Tail that lashes when anger rises",
                    "Grin that flashes pointed canines",
                    "Cheekbones cast in sharp relief",
                    "Voice that drops to a purr when plotting",
                    "A devilish dimple that misleads",
                    "Veins faintly visible at temples",
                    "Scars that seem to heal clean and pale",
                    "Hair that refuses to lie flat",
                    "Brows that knit into a wicked angle",
                    "Slight sulfur warmth on the breath",
                    "Steady, catlike balance",
                    "Eyes that hold contact a beat too long",
                    "Smirk that arrives before the joke",
                    "A measured, theatrical pause in speech",
                    "Scent like smoke and citrus"
                  ],
                  "clothing": [
                    "A dark, high-collared coat",
                    "Fingerless gloves",
                    "A simple, unadorned tunic",
                    "Tailored vest with hidden fasteners",
                    "Chain-detailed belt",
                    "Boots with metal heels that click",
                    "Silk cravat or scarf",
                    "Long gloves tucked beneath sleeves",
                    "Half-cape pinned with a spike brooch",
                    "Jacket lined in crimson",
                    "Sash that hides a slim blade",
                    "Gorget polished like a mirror",
                    "Trousers with subtle pinstripes",
                    "Bracer sheaths along the forearm",
                    "Signet ring with an ambiguous crest",
                    "Cufflinks set with dark stones",
                    "Pocket watch on a black chain",
                    "Tail wrap with silver thread",
                    "Wide belt with symmetrical studs",
                    "Hat with a narrow brim for shadows"
                  ]
                },
                "female": {
                  "physical": [
                    "More slender, graceful horns",
                    "An intense, focused gaze",
                    "Longer, more whip-like tail",
                    "Eyes like liquid gold or garnet",
                    "A voice that carries a velvet edge",
                    "High cheekbones with a faint glow",
                    "Hair that falls like ink",
                    "Smile that never shows all its thoughts",
                    "Freckles like embers across shoulders",
                    "A step that seems to float",
                    "Dramatic, expressive brows",
                    "Delicate fangs that catch the light",
                    "Tail tip that sketches little question marks",
                    "Hands with elegant, tapered nails",
                    "A laugh that warms or chills by choice",
                    "Skin that holds perfume longer",
                    "Slight curl of smoke on cold air",
                    "Head tilt that signals amusement",
                    "A scent like spice markets after rain",
                    "Steady, unblinking attention"
                  ],
                  "clothing": [
                    "Elegant but practical dark dresses",
                    "Silver rings or amulets",
                    "A corset-like bodice",
                    "High-slit skirts over leggings",
                    "Shoulder mantles with chain fringe",
                    "Gloves that fold to reveal claws",
                    "Velvet choker with charm",
                    "Hooded traveling cloak with satin lining",
                    "Laced bodice armored with hidden stays",
                    "Boots that rise to mid-thigh",
                    "Sash with sewn-in pockets",
                    "Tail jewelry that jingles softly",
                    "Sheer over-layer for misdirection",
                    "Sleeves that bell and conceal",
                    "Hairpins shaped like little tridents",
                    "Mask for masquerades in {place}",
                    "Bracers too pretty to be harmless",
                    "Short cape that frames the horns",
                    "Knife garter beneath the hem",
                    "Veil with tiny silver stars"
                  ]
                },
                "neutral": {
                  "physical": [
                    "Subtle, symmetrical horns", "An enigmatic expression", "Moves with quiet confidence", "Eyes that glint in low light", "Tail held very still when thinking", "Skin that seems to drink in shadows", "Breath that fogs only a little in cold", "A heartbeat that stays calm", "Steady hands even under accusation", "Smile that barely curves but transforms the face", "Hair that frames horns like a crown", "Ears with delicate cuffs or none at all", "Posture that reads as poised, not tense", "Faintly perfumed like myrrh or smoke", "Teeth slightly sharper than human", "A stillness before striking or speaking", "Brows that rise in microscopic arcs", "Footfalls that don’t quite echo", "Shadow that seems to cling a moment", "Presence that turns heads without trying"
                  ],
                  "clothing": [
                    "Well-fitted dark leathers",
                    "A long scarf or cloak to obscure features",
                    "Functional, unadorned gear",
                    "Slim belt with precise pouches",
                    "Boots that leave little trace",
                    "Jacket cut to accommodate tail",
                    "Simple rings that hide tiny sigils",
                    "Half-gloves with reinforced palms",
                    "Cowl that frames horns cleanly",
                    "Vest with hidden fastenings",
                    "Inner pockets for letters and vials",
                    "Sash that doubles as binding cord",
                    "Hooded mantle for quick anonymity",
                    "Tail sleeve stitched into coat hem",
                    "Dagger sheath nested in boot",
                    "Quiet buttons and catches (no jingle)",
                    "Travel cloak that drops into deep shadow",
                    "Gorget padded to soften silhouettes",
                    "Back scabbard angled to clear horns",
                    "A single bright accent to draw the eye"
                  ]
                }
              }
            }
        }
    }
}
