
{
  "types": ["Roadside Coaching Inn", "Urban Tavern", "Dockside Dive", "Elven Treetop Fane", "Dwarven Mead Hall", "Halfling Burrow-Pub", "Adventurer's Guildhall", "Quiet Monastery Guesthouse"],
  "qualities": ["Squalid", "Poor", "Modest", "Comfortable", "Wealthy"],
  "nameTemplates": {
    "patterns": ["The {adjective} {noun}", "The {noun} and {noun2}", "{ownerName}'s {establishment}"],
    "adjectives": ["Gilded", "Leaky", "Prancing", "Sleeping", "Green", "Salty", "Stumbling", "Last", "Whispering", "Broken", "Singing", "Golden", "Dusty", "Hidden", "Lucky", "Crooked", "Ivory", "Copper", "Misty", "Shattered", "Crimson", "Silver", "Jade", "Twinned", "Hollow", "Cloven", "Velvet", "Obsidian", "Cinder", "Shy", "Brazen", "Moonlit", "Stormworn", "Wayward", "Narrow", "Broad"],
    "nouns": ["Dragon", "Gryphon", "Goat", "Mug", "Flagon", "Kettle", "Boot", "Anchor", "Waystone", "Grin", "Fiddle", "Crown", "Shield", "Pipe", "Hearth", "Mare", "Serpent", "Tankard", "Stag", "Lantern", "Axe", "Compass", "Pickaxe", "Penny", "Cask", "Harp", "Bell", "Anvil", "Needle", "Hammer", "Quill", "Cannon", "Fox", "Otter", "Jackdaw"],
    "noun2": ["Whistle", "Grin", "Fiddle", "Crown", "Shield", "Pipe", "Feather", "Coin", "Stool", "Dagger", "Rose", "Wagon", "Lantern", "Anchor", "Anvil", "Hearth", "Boot", "Mare", "Harp", "Tankard", "Raven", "Spindle", "Compass", "Banner"],
    "ownerNames": ["Grizelda", "Stumbleduck", "Oakharrow", "Silas", "One-Eye", "Mistress Gable", "Old Man Willow", "Barnaby", "Fatty Bolger", "Rosie", "Maud", "Thorn", "Calder", "Brinna", "Wren", "Kettle Tom", "Nella", "Rusk", "Perrin", "Lark", "Jorra", "Mirelle", "Bram", "Isolde", "Duggan", "Poppy", "Ravel", "Kelvin", "Yara", "Old Nett"],
    "establishments": ["Rest", "Hole", "Taproom", "Hearth", "Inn", "Tavern", "Brewery", "Corner", "Respite", "Gamble", "Table", "Board", "House", "Cellar", "Cask", "Lodge", "Roost", "Porch", "Post", "Cup"]
  },
  "descriptions": {
    "Roadside Coaching Inn": {
      "Squalid": [
        "A drafty, hastily-built shack with a leaky roof and dirt floors. The air is thick with wet dog and despair. Every surface is sticky.",
        "A sagging timber box at a crossroads, shutters flapping in the wind and puddles on the floor. The hearth smokes more than it heats.",
        "A thrown-together stop with worm-eaten benches and rain-warped doors. Fleas hop at your ankles while the stew congeals in bowls.",
        "A wind-battered lean-to painted with peeling promises: 'Hot Meals' and 'Soft Beds'—both lies.",
        "Mouldy rafters, a sour cask, and a host who says the rats were here first."
      ],
      "Poor": [
        "This weary timber building sags in the middle. The common room is smoky with rickety furniture and the low murmur of tired travelers.",
        "A road-worn inn with wobbly trestles, stained tankards, and a stable that smells better than the kitchen.",
        "A creaking porch, peeling paint, and drafty walls. The host smiles, the floorboards groan, and the ale is thin but cheap.",
        "Patchwork shutters, patched chairs, and patched stories that improve after the third cup.",
        "A bell on a frayed rope and a sign that swings hard in every gust."
      ],
      "Modest": [
        "A sturdy, well-kept stop for travelers. A broad hearth and clean tables offer honest rest after a long day on the road.",
        "Fresh straw in the stable, polished mugs, and a steady stew pot. The sort of place caravans mark on their maps.",
        "Stone footings, sound beams, and a tidy taproom brightened by lantern-glass. The host knows names and routes alike.",
        "A courtyard pump, straight-backed chairs, and pie cooling in the window.",
        "Waymarkers carved into the lintel from grateful teamsters."
      ],
      "Comfortable": [
        "A sprawling, multi-story inn with a bustling stable and wide porch. Polished tables, good linens, and a cheerful din of talk.",
        "Well-appointed rooms, hot baths by request, and a kitchen known for pies. Couriers, merchants, and minor nobles trade news here.",
        "Gleaming brass lamps and soft carpets hush the footfalls. The hostess keeps a ledger and a keen eye.",
        "A private parlor for negotiations and a bell-ring for discreet service.",
        "Stableboys race to meet your reins before you dismount."
      ],
      "Wealthy": [
        "An impressive stone edifice with leaded panes and a liveried stablehand. Private booths, fine tapestries, and quiet, attentive service.",
        "A prestigious coaching house with enclosed coach bays, bell attendants, and a cellar of rare vintages.",
        "Marble-faced hearths and velvet-roped alcoves. Contracts are signed here under the watch of discreet guards.",
        "Carved milestones in the hall mark the distances to every capital.",
        "A conservatory breakfast room where birdsong accompanies silver service."
      ]
    },
    "Urban Tavern": {
      "Squalid": [
        "A cellar dive down a stinking alley, marked by a faded sign. The air is foul, the light is dim, and the patrons are best left alone.",
        "A sunless pit of a bar with sour floors, bruised egos, and a barkeep who waters everything, even the mop bucket.",
        "A mildew-stained den where the dice are shaved and the smiles show missing teeth.",
        "Shuttered at noon, packed at dawn, and never truly clean.",
        "Roaches scatter when the song starts—and it often does."
      ],
      "Poor": [
        "A cramped, noisy taproom on a busy corner. Sawdust carpets the floor and every chair wobbles.",
        "A brick-boxed bar with steamed windows, chipped mugs, and a back door that never shuts right.",
        "Lantern soot, crowd heat, thin stews, loud laughs. The city’s pulse, rough and unfiltered.",
        "Stools tilt, patrons tilt more, but the room somehow holds.",
        "A chalkboard menu that never changes but always sells out."
      ],
      "Modest": [
        "A popular local haunt with dark wood paneling and friendly staff. Often crowded, but cheerful and welcoming.",
        "A neighborhood favorite where the proprietor knows regulars’ orders and the house special sells out nightly.",
        "Warm lamplight, decent ale, and a stage for bards. You can find work, gossip, and a seat if you are quick.",
        "Hooks by the door for cloaks and worries alike.",
        "Ceiling beams etched with initials of couples who made it—and those who didn’t."
      ],
      "Comfortable": [
        "A well-appointed tavern in a respectable district, famed for good food and a deep drink list. Merchants and guildsmen linger here.",
        "Polished bar, linen-wrapped cutlery, and private booths. The guard captain quietly favors this place.",
        "Seasonal menus, imported wines, and staff who notice before you need to ask.",
        "A corner hearth where disputes cool and pastries warm.",
        "A cellar tour on request for those who speak the passphrase."
      ],
      "Wealthy": [
        "An exclusive house with a refined hush. A discerning host seats patrons, and prices climb with the vintage.",
        "Muted carpets, crystal glassware, and a roster of musicians under contract. Disputes are settled offsite.",
        "Invitation-only salon where nobles and financiers test ideas and alliances over rare spirits.",
        "A sommelier whose nod can make or break a trade deal.",
        "Walls hung with commissioned landscapes of estates no one here must ever visit."
      ]
    },
    "Dockside Dive": {
      "Squalid": [
        "A ramshackle lean-to of salvaged planks teetering over murk. The reek of cheap grog, fish guts, and desperation hangs heavy.",
        "Tar-patched walls, nets for curtains, and a floor crusted with salt and stories no one should hear.",
        "A slanting shack where waves slap the pilings and knives glint in the gaps.",
        "A gull-haunted hole where the door sticks at low tide.",
        "Barnacles grow faster than tabs get paid."
      ],
      "Poor": [
        "Loud, violent, and perpetually damp. Sailors from a dozen lands shout over one another; a brawl is a spilled drink away.",
        "Barnacle-bit benches, storm-scarred faces, and a chalkboard tally of broken noses.",
        "Rope-scarred rafters, anchor-chain stools, and a shark jaw nailed above the bar for luck.",
        "Tar-flavored stew, tide-flavored beer, and songs that end in wrestling.",
        "A harpoon nail where regulars hang their caps and grudges."
      ],
      "Modest": [
        "A reliable berth for hot meals and strong drink. Nautical maps, knotted ropes, and trophies from the sea line the walls.",
        "Ship bells mark the hours; stew simmers with clams; the harbor breeze cools the room.",
        "A chart-strewn common filled with captains hiring hands and hands hiring hope.",
        "Windows glazed with salt; stories glazed with rum.",
        "A deck rail where messages are carved as deep as love or debt."
      ],
      "Comfortable": [
        "A clean, well-lit tavern overlooking the harbor, popular with captains and factors. Private rooms for business and fine views.",
        "Polished brass railings, clear panes to the piers, and a cellar kept as neat as a captain’s ledger.",
        "Harbor-light chandeliers and a balcony for spotting sails you have been waiting for.",
        "A bell you can ring for a pilot—or a poet—depending on the night.",
        "Oysters shucked to order and contracts signed with steady hands."
      ],
      "Wealthy": [
        "A lavish Captain’s Club with waxed decks, panoramic windows, and polished sextants in glass cases.",
        "Membership-only lounge where fortunes are wagered on cargo before it lands.",
        "Crystal decanters, hushed valets, and contracts inked with seal rings still wet from the sea.",
        "A private chartroom where currents and markets are both predicted.",
        "An honor board of ships that never missed a tide—and those that never returned."
      ]
    },
    "Elven Treetop Fane": {
      "Squalid": [
        "A neglected platform with frayed ropes and a drooping canvas roof. Less fane, more abandoned tree fort.",
        "Sap-stained planks, wind-torn pennants, and lanterns that sputter in the mist.",
        "A dizzy perch with creaking lashings; the breeze does most of the cleaning.",
        "A rope ladder that complains in every language of the forest.",
        "A view worth the risk, a drink not worth the climb."
      ],
      "Poor": [
        "A simple, open-air deck woven from living branches. The wine is thin, but the canopy view is lovely.",
        "Wicker seats, leaf-thatched shade, and a gentle hush when the wind moves.",
        "Sparse garlands and a humble chorus of night-birds for musicians.",
        "Pollen-dusted tables and cups that taste faintly of sap.",
        "A chipped moonstone bell calls service from somewhere above."
      ],
      "Modest": [
        "A graceful, tiered structure in a silverwood’s boughs. Soft lanterns glow and a harp’s notes ride the breeze.",
        "Latticework railings, dew-cooled stone bowls, and attendants as light on their feet as leaves.",
        "Moon-runes etched into the grain and steps that spring rather than creak.",
        "Petal-pressed menus and cups carved from polished seedpods.",
        "A glade-bridge to a quieter deck for whispered conversations."
      ],
      "Comfortable": [
        "An elegant fane with carved rails, silken cushions, and a central fall that spills into a crystal pool. Service is discreet.",
        "Perfumed mists, starlit canopies, and wines poured with soft songs to guide the bouquet.",
        "Wind-harps, blossom tea, and couches curved to cradle guests like boughs.",
        "A scribe of seasons records notable evenings in leaf-script.",
        "Fireflies trained to gather when a glass is raised."
      ],
      "Wealthy": [
        "A breathtaking palace of living wood and crystal, high enough to pierce clouds. It serves luminescent cocktails and edible art.",
        "Bridges of grown glass, chalices of dew, and paths that unfurl at a word.",
        "An eyrie for diplomats and dreamers where dawn light is a curated experience.",
        "A choir of nightingales under contract and under enchantment.",
        "A seed vault of vintages that bloom only once per century."
      ]
    },
    "Dwarven Mead Hall": {
      "Squalid": [
        "A damp, cramped cavern with a ceiling so low non-dwarves stoop. The ale tastes of mold; benches slick with fungus.",
        "Smoke pools at beard level; the hearth sulks; and the mead stings like bad medicine.",
        "Pickaxes for coat hooks and puddles that never dry.",
        "A cracked keg serves as both table and warning.",
        "Stone dust on the bread and in the lungs."
      ],
      "Poor": [
        "Rough-hewn hall smelling of earth, sweat, and spilled mead. Tankards clang; songs are loud and crooked.",
        "Soot-black beams, cracked steins, and stories stretched like taffy.",
        "Sturdy, if splintered, with a keg that likes to fight back.",
        "Table games carved directly into the rock and paid in coppers.",
        "A pit for axe-throwing and pride-throwing alike."
      ],
      "Modest": [
        "A grand stone hall held by carved pillars. Long trestles, a roaring hearth, and tales thick as foam.",
        "Mural tapestries, iron braziers, and a bar lined with honest brews.",
        "A feast-bench culture where strangers leave with nicknames.",
        "Casks labeled by clan and season, all well-guarded by custom.",
        "Bellows hum in the back room where the house malt is born."
      ],
      "Comfortable": [
        "Polished floors, intricate tapestries of clan history, and a bar of rare ales and meads.",
        "Inlaid runes underfoot, copper-hooded hearths, and casks signed by master brewers.",
        "A tasting flight arrives on a carved plank shaped like a mountain.",
        "Amber candles in stone sconces and seats that fit like a handshake.",
        "A master of toasts who remembers every victory and every loss."
      ],
      "Wealthy": [
        "An opulent cavern with veins of gold and mithril winking in the walls. Lava flows behind crystal, warming the hall.",
        "Crown-keg reserves, gem-cut goblets, and an oath-table of black stone.",
        "A royal dais where toasts are recorded by a scribe in hammered leaf.",
        "A vault of ancient honeys sealed with clan songs.",
        "A waterfall that pours through a pipe-organ of stone."
      ]
    },
    "Halfling Burrow-Pub": {
      "Squalid": [
        "A damp, smelly hole with a collapsed tunnel in back. Sour ale, dripping ceilings, and the occasional centipede.",
        "Mold-specked turf walls, wobbly stools, and pies that apologize rather than delight.",
        "Low ceilings, lower spirits, and a cat who owns the place.",
        "A door that sticks unless coaxed with jam.",
        "Dusty plates stacked beside a brave little teapot."
      ],
      "Poor": [
        "A cozy but cluttered burrow with low, rounded ceilings. Mismatched furniture, warm fire, friendly faces.",
        "Chipped teacups, patched doilies, and laughter that makes up for thin pastry.",
        "A knotted-oak bar, an old fiddle, and enough crumbs to feed a small nation.",
        "A pantry that smells of yesterday’s onions and tomorrow’s hopes.",
        "A snug where secrets are told loudly."
      ],
      "Modest": [
        "A cheerful pub with a round green door, a pantry full of pies, and a cellar of excellent ale. The village heart beats here.",
        "Sunlit nooks, polished kettles, and chalkboards listing the day’s tarts.",
        "Garden herbs hang to dry; the floor smells faintly of apple and cinnamon.",
        "A children’s corner with blocks and very serious rules.",
        "Weekly pie contests judged by the most bribable elders."
      ],
      "Comfortable": [
        "Spacious and tidy with whitewashed walls, embroidered cushions, and garden views through round windows. Award-winning ciders.",
        "Feather beds upstairs, butter warmers on the tables, and candied walnuts by the bowl.",
        "Lace curtains, terraced gardens, and cider flights served with cheese slivers.",
        "A reading nook under the stair and slippers for loan.",
        "A sunny conservatory where time keeps a gentler pace."
      ],
      "Wealthy": [
        "An expansive burrow-suite with several commons, a lending library, and gourmet comfort food. The mayor’s favorite.",
        "Silver-banded tankards, heirloom recipes, and a map room for planning picnics.",
        "A conservatory of glass and ivy where teas sparkle like jewels.",
        "Guest books filled with recipes shared and friendships pledged.",
        "A pantry with more locks than a treasury—on the jam cupboard."
      ]
    },
    "Adventurer's Guildhall": {
      "Squalid": [
        "A rundown hall with a thin notice board and desperate patrons. The roof leaks over the one good table.",
        "Dusty trophy cases, unpaid bounties, and a clerk who shrugs more than stamps.",
        "A training mat patched with hope and canvas.",
        "A bell that rings only for trouble and never for pay.",
        "A weapons rack that is mostly splinters and regrets."
      ],
      "Poor": [
        "Functional but drab. Cheap ale, nervous recruits, and veterans who watch the door more than the darts.",
        "A chalklined sparring ring, stale bread, and contracts that smell like trouble.",
        "A gear-swap crate labeled 'take one, leave one' that no one obeys.",
        "A quartermaster who measures rope in sighs.",
        "A healer with two poultices and twelve opinions."
      ],
      "Modest": [
        "A bustling hub. A board dense with contracts; tables full of planning, boasting, and sorrow drowning.",
        "Quartermasters haggle, scribes file, and medics stitch. Work finds you if you linger.",
        "Maps bristle with pins and string. The room hums with intent.",
        "A bragging shelf of odd trophies that sometimes blink.",
        "A back room where greenhorns learn to be less green."
      ],
      "Comfortable": [
        "Well-funded with a lounge, yard, library, and a bar with surprisingly good food. Professional through and through.",
        "Armorer, alchemist, and archivist on site; fees posted; fairness enforced.",
        "Members-only alcoves with sound-dampening charms.",
        "A vault clerk who smiles only for perfect paperwork.",
        "A sparring yard where the sand is raked between bouts and egos."
      ],
      "Wealthy": [
        "An imposing fortress-hall for elites. Its own forge, lab, and vault for magical spoils.",
        "Interview rooms with truth-sigils and retainers who sign in blood or ink as needed.",
        "A wall of medals and a quiet memorial that never collects dust.",
        "An operations theater with moving maps and moving speeches.",
        "A skybridge to the embassy wing where treaties sometimes begin."
      ]
    },
    "Quiet Monastery Guesthouse": {
      "Squalid": [
        "Straw pallets on cold stone; thin, watery gruel. The monks offer silence and little else.",
        "Candle stubs, frigid cells, and a bell that rings too early and too often.",
        "Bare walls, bare bowls, and a draft that chants louder than the choir.",
        "A cracked cistern and a vow of humility you can taste.",
        "Sandaled footsteps echo where comfort does not."
      ],
      "Poor": [
        "Simple and spartan: hard bed, clean blanket, and a meal of bread and broth. Silence expected.",
        "Rough wool robes for loan, chores for penance, and blessings for patience.",
        "A courtyard swept with care if not with joy.",
        "A novice assigned to show you the rules; there are many.",
        "Food served with grace and without flavor."
      ],
      "Modest": [
        "Peaceful, well-tended guesthouse. Simple, clean rooms, wholesome food, and tranquil gardens.",
        "Herb scents drift from cloisters; novices practice plain-song; visitors sleep deeply.",
        "A small scriptorium offers quiet work to restless hands.",
        "A bell schedule posted and mercifully reasonable.",
        "Walks at dusk where worries exhale with the candles."
      ],
      "Comfortable": [
        "A serene retreat famed for its scriptorium and healing herbs. Learned monks share knowledge with respect.",
        "Warm tile floors, gentle bells, and teas steeped to soothe mind and bone.",
        "A hospice wing where aches leave lighter than they came.",
        "A reflecting pool where stars rehearse for night.",
        "Guest lecterns with inks that never blot."
      ],
      "Wealthy": [
        "A renowned monastery that crafts legendary wines or ales. Guesthouse luxuries are patron-funded.",
        "Cellars like cathedrals, refectories like courts, and silence that heals rather than scolds.",
        "Pilgrim suites with terraces over vineyards trimmed like scripture.",
        "A reliquary of recipes guarded like relics.",
        "A library whose ladders know your favorite page."
      ]
    }
  },
  "innkeepers": {
    "personalities": [
      "Gruff but fair", "Overly cheerful and nosy", "Suspicious and watchful of everyone", "Tired, world-weary, and cynical",
      "A bustling, motherly figure", "A former adventurer with a bad leg", "A slick, profit-obsessed charmer", "Quiet and observant, misses nothing",
      "A bubbly gossip who knows everything", "Stern and humorless, runs a tight ship", "Deadpan joker who never smiles at their own punchlines",
      "Nervous host who hates loud noises", "Relentless optimist who believes in second chances", "Scholar of local history who corrects everyone’s dates",
      "Soft-spoken diplomat who diffuses fights with compliments", "Rule-stickler who loves forms and tokens", "Grand storyteller whose tales grow with each telling",
      "Pious caretaker who insists on grace before drinks", "Warm pragmatist who can price anything at a glance"
    ],
    "quirks": [
      "polishes the same mug constantly", "has a pet mouse that lives in their pocket", "never gives a straight answer to a direct question",
      "is missing three fingers on their left hand", "hums the same sad tune when they think no one is listening", "insists on being paid in odd-numbered coins",
      "has an irrational fear of magic", "collects wanted posters", "can perfectly mimic any patron's voice after hearing it once", "is secretly a skilled poisoner",
      "labels every chair with a name and a backstory", "keeps a secret ledger written in code", "always forgets faces but remembers orders forever",
      "wears a different ridiculous hat each day", "counts stairs out loud when stressed", "claims to dream tomorrow’s menu",
      "refuses to serve knives with meals on Tuesdays", "has a bell that summons staff who never seem to walk",
      "bets on how many songs until the next brawl", "feeds the hearth like it’s a pet"
    ]
  },
  "signature_drinks": {
    "Squalid": [
      "'Gutter Grog,' a cloudy, sour mystery liquid",
      "'Swampwater Ale,' which has bits floating in it",
      "'Orc's Piss,' a notoriously foul but potent brew",
      "Watered-down, flat ale",
      "Vinegar-like wine",
      "Bootwash Bitter drawn from the dregs",
      "Ratcatcher's Rum with a suspicious bouquet",
      "Mildew Mead that tastes like cellar walls",
      "Back Alley Bitter served warm by accident",
      "Cracked Cask Cider with splinters not optional",
      "Slopbucket Spritz topped with stale foam",
      "Peatwater Toddy that stains the teeth",
      "Pickled-Hop Tincture measured in drops",
      "Tin-Rust Red that fizzles on the tongue",
      "Mopbucket Punch steeped in regret",
      "Dock Sludge Porter, opaque and ominous",
      "Flophouse Fizz poured from an unlabeled jug",
      "Weevil Wine with protein no one asked for",
      "Stale-Bread Kvass that almost works",
      "Cellar Shade—whatever was left, mixed"
    ],
    "Poor": [
      "'The Rusty Nail,' a cheap, strong ale",
      "'Mug O' Brown,' a standard, forgettable beer",
      "Rough, throat-burning whiskey",
      "Sour cider from last year's press",
      "'Traveler's Tanglefoot,' a dark, heavy stout",
      "Tin Cup Lager with a metallic tang",
      "Dockhand Draught with a briny finish",
      "Penny Porter that does its humble job",
      "Stablehand Cider pressed behind the barn",
      "Brickhouse Brown with a chalky edge",
      "Cheap Fig Wine sold by the chipped jug",
      "Copper Kettle Ale with uneven bubbles",
      "Backstreet Bitter with a pine bite",
      "Turnip Topper, a peasant cordial",
      "Coal-Scuttle Stout roasted too far",
      "Lantern Oil Gin cut too thin",
      "Breadcrust Brown brewed from scrapes",
      "Hearthsweep Red with ash-kissed notes",
      "Milestone Mild that warms the feet",
      "Marketday Mead sweet and simple"
    ],
    "Modest": [
      "'Golden Grain Ale,' a crisp, refreshing local favorite",
      "Warm spiced cider in the winter",
      "A decent, robust red wine",
      "'The Hearthwarmer,' a smooth, dark porter",
      "Blackberry mead from a nearby farm",
      "Wayfarer's Witbier with citrus peel",
      "Amberfields Lager with a biscuit nose",
      "Mulberry Wine bottled in spring",
      "Sage-and-Lemon Shandy bright and clean",
      "Oak-Aged Amber with vanilla hints",
      "Hillfolk Rye Ale with a peppery bite",
      "Rosehip Tonic with a soft fizz",
      "Pilgrim Pils with meadow notes",
      "Caravansary Saison with spice",
      "Honeyed Brown that drinks like bread",
      "Bramble Braggot with berry lift",
      "Stonebridge Red with tart cherry",
      "Cedar Cup Toddy for cold nights",
      "Miller’s Marzen with caramel malt",
      "Fieldhand Kölsch crisp and quick"
    ],
    "Comfortable": [
      "'Starlight Lager,' an elven import with a faint shimmer",
      "'Dragon's Breath Chili Stout,' a spicy, warming brew",
      "Aged dwarven whiskey, smooth as silk",
      "Fine wine from a reputable vineyard",
      "'The Scholar's Sip,' a spiced herbal tea with a kick",
      "Lavender Honey Mead served in crystal",
      "Cedar-Smoked Ale with a campfire whisper",
      "Moonpetal White with a floral bouquet",
      "Thornbriar Rosé, dry and delicate",
      "Spire Gin with tonic and juniper berries",
      "Seafarer's Reserve Rum, subtly salted",
      "Amberfire Braggot blending mead and malt",
      "Abbey Dubbel with raisin and clove",
      "Goldleaf Chardonnay from sun slopes",
      "Elderflower Cordial with sparkle",
      "Claret of the Three Valleys, dependable",
      "Ginger-Pear Perry, off-dry and lively",
      "Cask-Strength Rye with orange peel",
      "Midnight Mocha Stout, silky",
      "Rookery Vermouth poured over ice"
    ],
    "Wealthy": [
      "'Celestial Radiance,' a wine that glows faintly with golden light",
      "'Mithril Mead,' a dwarven brew aged for a century in mithril-lined casks",
      "Scintillating spirits from another plane",
      "The king's own private stock of brandy",
      "A cocktail that changes color and flavor with every sip",
      "Timekeeper Port that tastes of old victories",
      "Diamond-Dust Elixir served with a silver spoon",
      "Everbloom Sparkling that never goes flat",
      "Archmage's Reserve with notes that rearrange on the tongue",
      "Dragonbone Brandy warmed over rune-stones",
      "Mirrorglass Vodka that refuses to frost",
      "Eclipse Absinthe that swirls like night sky",
      "Queen’s Liqueur of quince and starlight",
      "Singing Saffron Mead, lightly enchanted",
      "Phoenix Bitters in crystal drops",
      "Imperial Tokay from locked vineyards",
      "Sylvan Icewine harvested by moonblade",
      "Runespun Amaro complex as prophecy",
      "Crown-Cut Champagne sabred at table",
      "Aether Gin filtered through cloud"
    ]
  },
  "rooms": {
    "Squalid": [
      "Common loft: flea-bitten pallets, one thin blanket, no privacy.",
      "Broom closet: bucket, broom, and a nail for your cloak.",
      "Lean-to cot: draft through the boards, chamber pot shared by all.",
      "Stall loft: sleep above the stable on scratchy hay.",
      "Windowless cell: damp stone, sputtering candle stub.",
      "Kitchen corner: curtain divider, smell of onions and smoke.",
      "Attic crawlspace with slanted roof and spider company.",
      "Broken cot mended with rope, slumps in the middle.",
      "Rope hammock hung between two creaking beams.",
      "Storage room with crates for a nightstand and mice for neighbors.",
      "Pallet by the back door that never quite latches.",
      "Basement niche with puddles and a promise of 'it’s dry most nights.'",
      "Under-stairs cubby where the broom is your roommate.",
      "Sooty loft above the chimney, warm and gritty.",
      "Alley window slit with smells on draft.",
      "Draft-tunnel bedroll beside the keg stack.",
      "Bench by the kitchen hearth claimed by first to nod.",
      "Mat on the porch, rain-permitted.",
      "Collapsed trundle with one brave leg.",
      "Moth-nibbled wool and a borrowed prayer"
    ],
    "Poor": [
      "Narrow single: straw mattress, splintered frame, draft under door.",
      "Twin bunks: creaky ladder, one shutter sticks, latch barely holds.",
      "Low-ceiling nook: footlocker with a missing lock plate.",
      "Street-side room: noise until dawn, view of alley fights.",
      "Shared quarters: four cots, one peg per guest.",
      "Corner room: slants toward the eaves, basin with a chip.",
      "Stable bunk: clean hay, lantern, and a friendly mule nearby.",
      "Trundle bed beneath a wobbling window.",
      "Rope bed with coarse linens and a dented pitcher.",
      "Back stair room: warm from kitchen, smells persist.",
      "Box room with folding screen and a nail for a candle.",
      "Cupboard room with a stool that doubles as table.",
      "Loom room cleared for 'temporary guests.'",
      "Dockside view of nets and arguments.",
      "Gatehouse loft with key drafts.",
      "Sparrow room: small, chirpy at dawn.",
      "Lintel room where tall folk stoop often.",
      "Peeling plaster and a loyal chamber pot.",
      "Eaves nook with a window that won’t decide.",
      "Gutter-view single that rains indoors sometimes"
    ],
    "Modest": [
      "Private single: clean straw tick, small table, shuttered window.",
      "Twin room: washbasin, peg rack, and a latch that works.",
      "Garden look-out: sunlight in the morning, birdsong alarm.",
      "Caravan room: wide hooks for gear and a sturdy trunk.",
      "Street balcony: chair for people-watching and a safe rail.",
      "Corner double: thicker mattress and quilted coverlet.",
      "Desk room: writing table, ink well, and a view of the square.",
      "Warm hearth room: shares a wall with the chimney; toasty.",
      "Quiet inner room: thick door, thin rug, restful.",
      "Attic dormer with clean linens and a star peek at night.",
      "Bath token included for the public bathhouse down the lane.",
      "Window seat big enough to nap in after lunch.",
      "Courtyard-facing with herb boxes and bees.",
      "Map hooks, boot tray, and honest locks.",
      "Sunbeam room that glows at noon.",
      "Reading lamp and a shelf of old romances.",
      "Laundry service by the bundle.",
      "Traveler’s crib for little ones upon request.",
      "Spare cloak and slippers folded at foot.",
      "Spacious single with a writing kit"
    ],
    "Comfortable": [
      "Private chamber: feather bed, washstand, lockable door.",
      "Merchant’s room: big desk, ledger shelf, strongbox on loan.",
      "Corner suite: sitting nook, thick curtains, and slippers.",
      "Harbor view: sea breeze, lanterns like scattered stars.",
      "Canopy bed with fresh flowers and mint on pillows.",
      "Fireplace room: stack of seasoned wood and tinderbox.",
      "Soft rug underfoot and a wardrobe with boot jack.",
      "Bath on request: copper tub rolled in with steaming pails.",
      "Breakfast tray included: bread, fruit, and jam.",
      "Soundproofed door for uninterrupted sleep.",
      "Reading lamp with adjustable shade and a small library.",
      "Writing service: leave a note, get a fair hand copy.",
      "Private balcony with chair for one and thoughts for two.",
      "Footstool, footbath, and footman—sometimes the same man.",
      "Tea caddy with local blends and honey sticks.",
      "Valet brush and sewing kit in drawer.",
      "Linen press warm to the touch.",
      "Map cabinet and lockable chest.",
      "Fresh fruit bowl replenished at dusk.",
      "Turn-down with lavender sachet"
    ],
    "Wealthy": [
      "Grand suite: parlor, bedroom, balcony, and private bellpull.",
      "Four-poster with silk sheets and a warming pan.",
      "Marble washbasin, perfumed soaps, and hot water on tap.",
      "Dressing room with mirror of polished silver.",
      "Library suite with curated volumes and a globe of the realm.",
      "Music room option: harp in tune and stool by the window.",
      "Valet on call and boots returned shined by dawn.",
      "Private terrace overlooking gardens or harbor lights.",
      "Security chest with runic seal and guest signet.",
      "Document desk with lock, wax, and house signet stamp.",
      "Chef’s tasting brought to the parlor on request.",
      "Night-sky ceiling with phosphor constellations.",
      "Fireplace with hidden latch for secret wood stash.",
      "Silk robe and slippers tailored overnight.",
      "Decanter set engraved with the house crest.",
      "Reception bell that actually summons grace.",
      "Letterpress for personal stationery on demand.",
      "Private vestibule with umbrella stand of antler.",
      "Wall safe inside a painting that isn't suspicious at all.",
      "Attendant who remembers how you take your tea"
    ]
  },
  "patrons": [
    "A grizzled bounty hunter cleaning their nails with a dagger, pointedly ignoring everyone.",
    "A young lover whispering to a locket, clearly hiding from someone.",
    "A merchant loudly complaining about road tolls to anyone who will listen.",
    "A quiet, hooded figure in the corner nursing a single drink, watching the room from under their brim.",
    "An off-duty city guard, gambling loudly and cheating poorly.",
    "A traveling bard singing a rather bawdy song for a handful of coins.",
    "An old man with a long white beard, seemingly asleep, but his eyes are tracking the room.",
    "A richly-dressed noble and their bored-looking guard, clearly out of place.",
    "A local farmer trying to sell a prize-winning pig to a skeptical innkeeper.",
    "A half-orc gladiator sharpening a massive axe, making everyone nervous.",
    "A gnome tinker trying to demonstrate a new, smoke-belching contraption.",
    "An elf scribe taking meticulous notes in a leather-bound journal.",
    "A dwarf loudly challenging everyone to a drinking contest, and losing.",
    "A halfling bard captivating a small crowd of children with a fantastical tale.",
    "A priest of the god of travel, offering blessings for a small donation.",
    "A cloaked smuggler counting crates on their fingers and toes.",
    "A sailor with a fresh tattoo, swearing it maps a cursed reef.",
    "A shaman flipping runestones, refusing to read for themselves.",
    "A scarred gladiator comparing old wounds with new friends.",
    "A masked bard who never removes their gloves.",
    "A hunter drying boots by the fire, two different sizes.",
    "A scribe copying a contract so carefully the ink holds its breath.",
    "A sleepy mule in the doorway while its owner drinks alone.",
    "A tiefling innkeeper tasting the room’s stew and wincing politely.",
    "A dwarf cartographer sketching the tavern as if it were a mountain.",
    "A goblin scout with satchels layered like scales.",
    "A temple guard polishing a dent that refuses to leave a shield.",
    "A wizard's apprentice with ink-stained cuffs bartering for a lock of hair.",
    "A herbalist trading salves for stories of rare moss.",
    "A masked thief winning at cards with hands no one saw them play.",
    "A priest of luck rolling bones until they show a sign.",
    "A bard with a broken lute asking for string by string.",
    "A retired gladiator telling the same tale three ways.",
    "A farmer delivering pastries and gossip in equal portions.",
    "A black-market alchemist whose satchel rattles ominously.",
    "A bored guard recruit practicing knots with the tablecloth fringe.",
    "A hunter hanging snares from chair backs like decorations.",
    "A scout with mud on one boot and blood on the other.",
    "A scribe tallying debts of ancient kings on a napkin.",
    "A warforged with a dented helm, ordering oil like brandy.",
    "A catfolk merchant purring over a tray of silver rings.",
    "A halfling innkeeper recruiting tasters for tomorrow’s pies.",
    "A dwarven alchemist offering a suspiciously smoky sample.",
    "A bard practicing a lullaby no one remembers hearing before.",
    "A young thief counting tips for a table they never served.",
    "A thief spinning picks between their knuckles.",
    "A glassblower admiring the window panes more than the view.",
    "A herbalist smelling faintly of honey and smoke.",
    "A quiet wizard's apprentice knitting, skull needles clicking.",
    "A thief tracing routes on a map with an empty finger.",
    "A monk silently balancing a teacup on one fingertip.",
    "A noble incognito, betrayed only by soft, unused hands.",
    "A sea-druid picking salt from her hair and cursing tides.",
    "A mason appraising the walls and finding them wanting.",
    "A courier raven on a perch, staring like a tax collector.",
    "A fortune-blind gambler insisting the next hand will turn.",
    "A deserter studying the door more than the ale.",
    "A wizard's apprentice selling weather in bottles, half full of sky.",
    "A bard arguing with their own lute over the correct key for a song.",
    "A guard sergeant promising pay tomorrow, again.",
    "A thief clapping at the bard’s best line a heartbeat late.",
    "A tinker testing coins with a bite and a glare.",
    "An innkeeper who moves like a dancer and dodges like one.",
    "A bard known for fire-eating taking the night off and swallowing complaints instead.",
    "A farmer with a lamb in a shawl and a story in tow.",
    "A sailor who runs a ferry refusing to sit with their back to a mirror.",
    "A healer knitting and nodding at every rumor like a judge.",
    "A tinker replacing a hinge mid-argument mid-drink.",
    "A cloistered librarian baffled by tavern arithmetic.",
    "A gladiator drinking left-handed to practice restraint.",
    "A hunter with a wolfhound that minds its own drink.",
    "A bard whose marionette watches the room.",
    "A spice-merchant sneezing with theatrical precision.",
    "A quiet tailor wringing secrets from a bar of soap.",
    "A bard practicing scales on a pipe that sound like rain.",
    "A merchant specializing in furs disputing with a moth.",
    "An alchemist smelling of clove and hope.",
    "A chandler off duty and in the dark.",
    "A road priest blessing boots for fewer blisters.",
    "A tailor critiquing the room by its scuffed boots.",
    "A stablemaster asleep guarding nothing in particular.",
    "A smuggler pretending to be a coat rack.",
    "A bard rehearsing silence, with theatrical intensity.",
    "A scribe drawing maps to lost hungers.",
    "A caravan scout counting exits out loud.",
    "A scout with a sealed letter that hums.",
    "A tailor measuring trouble for a suit.",
    "A chandler offering wax in exchange for news.",
    "A librarian on holiday, judging the menu index.",
    "A guard practicing whispers.",
    "A smuggler of glass knives refusing to sit near the hearth.",
    "A healer sharpening a razor on an old grudge.",
    "A farmer, dusted white with flour, smiling like snow.",
    "A smuggler laughing at cargo jokes too hard.",
    "A gambler playing with cards that don’t match but still win.",
    "A hunter feeding crumbs to a hawk no one else can see.",
    "A bard writing a heroic couplet about the mop.",
    "A thief known for stealing pies, paying back in slices.",
    "A wandering gladiator with a crest of crossed spoons.",
    "A herbalist selling sleep by the pinch.",
    "A tinker tapping time on the tabletop.",
    "A pilgrim polishing a scallop shell between prayers.",
    "A bard who juggles, never dropping anything except the truth",
    "An innkeeper arguing with the soup like an equal",
    "A mute sailor who speaks fluent eyebrow",
    "A carpenter admiring the beams and the brawl potential",
    "A messenger pigeon on a windowsill, judging"
  ],
  "rumors": [
    "They say the old well behind the inn leads to a forgotten smuggler's tunnel.",
    "The innkeeper is in debt to the local thieves' guild and is being forced to act as an informant.",
    "A ghostly woman in white is sometimes seen in the upstairs hallway, searching for her lost love.",
    "A wealthy merchant is staying here incognito, looking to hire guards for a dangerous expedition.",
    "The 'special stew' isn't made from mutton... and the local butcher has some questions about his missing dog.",
    "There's a loose floorboard in the corner booth that hides a map to a hidden treasure.",
    "The inn was built on an ancient burial ground, and the dead are starting to get restless.",
    "One of the patrons is a wanted fugitive with a huge bounty on their head.",
    "The innkeeper's daughter is in love with the leader of the local bandit crew.",
    "The strange sigils carved into the hearth are part of a ritual to summon a powerful entity.",
    "A secret, high-stakes card game happens in the cellar every midnight. The password is 'rusty flagon'.",
    "The bard who plays here on weekends is actually a spy for a rival kingdom.",
    "The 'dwarven ale' is just cheap swill mixed with goblin moonshine. The real stuff is sold to special customers.",
    "A valuable item was recently stolen from a noble's room, and the innkeeper is covering it up.",
    "The building itself is alive, and sometimes the rooms rearrange themselves in the dead of night.",
    "A caravan vanished after leaving this inn; their shadows still arrive at dusk.",
    "The cellar door locks from the outside on its own when the moon wanes.",
    "A hidden chapel beneath the bar blesses—or curses—travels begun here.",
    "A royal taste-tester dined here last week and never left a coin… or a breath.",
    "The town council meets here in secret to decide who gets 'lost' on patrol.",
    "A map etched into the underside of a table shows a route across rooftops.",
    "The resident cat has outlived three landlords and remembers debts.",
    "A phantom fiddler can be heard when storms roll in from the west.",
    "The signboard changes its picture when a lie is told inside.",
    "A gilded tankard returns to the shelf no matter who steals it.",
    "A rival tavern poisons rumors, not drinks—and business suffers.",
    "A portrait in the hall winks when someone enters with ill intent.",
    "Someone’s paying double for information about a certain adventuring party.",
    "The fireplace ash arranges itself into names the night before trouble.",
    "A cask in the cellar refills itself… with seawater at high tide.",
    "The monastery up the road buys spices that don’t grow on this plane.",
    "If you knock thrice on room five’s headboard, you hear knocking back.",
    "A noble heir tends bar on odd nights, hiding from an arranged marriage.",
    "A traveling judge lost their seal here; the thief is still drinking nearby.",
    "A hidden loft above the stage holds letters that end wars or start them.",
    "A kobold crew tunnels toward the pantry, one spoon at a time.",
    "The house pie recipe is a treaty written in pastry code.",
    "A lantern in the alley draws moths that spell out warnings.",
    "A guild agent swaps the menu ink daily to track spies."
  ]
}